[
  {
    "job_id": "1896538",
    "title": "Venture Capital-Partner Development Manager",
    "locations": [
      "Mountain View, California, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 19, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896538/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration, Business Science, or an advanced degree in a Science, Technology, Engineering, and Mathematics (STEM) or a related field AND 10+ years experience in partner management, sales, business development, or partner channel development in the technology industry or related experience OR equivalent experience. In-depth understanding of the venture capital ecosystem Familiarity with venture capital and/or pr i v ate equi t y firms in the local market Executive pr esence (c-suite and board level) and ability to influence business leaders through business value pr opositions Ex pe rience with technology platforms and developing new solutions Strong ex pe rience of managing virtual teams across functions and geographies Inclusive and collaborative – driving teamwork and cross-team alignment Strong partner relationship management and solution development skills Strong communication and pr esentation skills with a high degree of comfort Challenger mentality leveraging internal and/or external resources, conflict resolution, and follow through Partner Development Management IC5 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role's job duties. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $133,000 - $222,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $170,300 - $239,800"
      }
    ]
  },
  {
    "job_id": "1891507",
    "title": "Principal Product Manager - Ecosystem Growth",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 19, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891507/",
    "required_qualifications_text": ": Bachelor's Degree AND 8+ years experience in product/service/program management or software development OR equivalent experience. 5+ years of product management experience, with significant time spent on platforms, ecosystems, or developer products. 5+ years of product or business strategy experience.",
    "preferred_qualifications_text": ": Experience building and scaling platform ecosystems that attract and retain top developers and partners. Deep understanding of AI/ML, developer platforms, or enterprise software markets. Product Management IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1898065",
    "title": "Associate Creative Director",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 19, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898065/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "5+ years demonstrated growth in writing or content design AND a certification, degree, or training in English, Writing, Human-centered Design, Literature, or related field OR equivalent experience. 3+ years project leadership experience. 2+ years experience in a related content domain/area. Familiarity with AI tools for content creation and curiosity about how AI can enhance storytelling and workflow. Empathetic communicator with a sense of humor and a flexible, inclusive mindset. Production experience and ability to handle different types of productions. Demonstrated storytelling skills. Writing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1891626",
    "title": "Partner co-marketing manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 19, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891626/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration, or related field AND 4+ years sales, marketing, technology-based, or business development experience OR Bachelor's Degree in Business, Marketing, Business Development, Business Management, Communications, or related field AND 6+ years sales, marketing, or business development experience OR equivalent experience. 6+ years of marketing experience, preferably in both consumer and commercial segments. Background in PC hardware and/or the PC OEM / silicon eco system is a plus Adept at understanding and articulating marketing concepts and initiatives. Established track record managing and developing diverse high-performance hybrid teams and the ability to orchestrate and collaborate with a wide array of stakeholders across teams and organizations. Ability to engage and influence at senior levels – strong executive presence and cross-functional collaborator. Project management skills, ability to listen and absorb stakeholder needs to clearly document and manage complex matrixed projects. Demonstrated presentation skills to groups of all sizes and levels and a successful track record of sales and negotiation skills. Experience managing ambiguity and rapid change – demonstrate agility and risk-taking Analytical skills to identify growth opportunities, manage investments, and maximize ROI. Knack for adopting the latest AI technologies for Frontier marketing. Partner Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1895057",
    "title": "Partner Development Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 19, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1895057/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration, Business Science, or an advanced degree in a Science, Technology, Engineering, and Mathematics (STEM) or a related field AND 10+ years’ experience in partner management, sales, business development, or partner channel development in the technology industry or related experience OR equivalent experience. Working knowledge of software and solution development practices Ability to work in an abstract, cross-organizational boundary and cross-discipline manner Understanding of the Microsoft cloud platform, including Microsoft Azure, AI landscape, and Microsoft 365 Understanding of cloud computing technologies (Microsoft and competitors) and business drivers, as well as the impact of these on Software and Services partners and their customers. Interpersonal, collaboration, verbal and written communication, analytical and presentation skills Decision-making, conflict resolution, problem solving and negotiation skills Partner Development Management IC5 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role's job duties. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $133,000 - $222,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $170,300 - $239,800"
      }
    ]
  }
]