[
  {
    "job_id": "1899698",
    "title": "Principal Product Manager - Audience Platform",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899698/",
    "required_qualifications_text": ": Bachelor's Degree AND 8+ years experience in product/service/program management or software development OR equivalent experience. 5+ years experience delivering products that include data, audience, or advertising platform products. 2+ years of experience with audience profiling, segmentation, or data enrichment systems. Experience working with data science or machine learning teams on modeling, trait inference, or audience expansion.",
    "preferred_qualifications_text": ": Experience with advertising or marketing technology platforms [e.g., Demand Side Platform (DSPs), Data Management Plan (DMPs), Customer Data Platform (CDPs), and data collaboration systems]. Understanding of signal acquisition across web, mobile, and partner ecosystems. Product Management IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1903106",
    "title": "AI Business Solutions Sales Specialist",
    "locations": [
      "New York City, New York, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903106/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration (i.e., MBA), Information Technology, Information Security, or related field AND 8+ years experience in technology-related sales or account management OR Bachelor's Degree in Computer Science, Information Technology, Business Administration, Information Security, or related field AND 12+ years experience in technology-related sales or account management OR equivalent experience. 6+ years experience with solution or services sales experience. 2+ years experience Experience facing with Japanese customers and business practices will be even better Solution Area Specialists IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $133,000 - $222,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $170,300 - $239,800"
      }
    ]
  },
  {
    "job_id": "1898468",
    "title": "Frontier Finance Learning and Development Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Nov 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898468/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Experience partnering with global learning and development teams. Familiarity with Microsoft 365, Viva Learning, and other enterprise learning technologies. Recognized certification in project or program management (e.g., PMP). Proven ability to operate with agility in a dynamic environment, adjusting priorities and approach as needed. Technical fluency with Microsoft platforms used in enterprise learning and Finance scenarios, including: Microsoft 365, SharePoint content architecture, Teams delivery Power BI or Microsoft Fabric for learning analytics and outcome dashboards Power Platform (Power Automate/Power Apps) to streamline learning workflows and capture telemetry Copilot for Microsoft 365, Copilot Studio, and/or Azure AI Foundry Business Program Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  }
]