[
  {
    "job_id": "1903667",
    "title": "Business Strategy - Revenue & Profitability",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903667/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration or related field AND 3+ years marketing, strategy, business planning, business consulting, banking, finance, economics, and/or partner organization experience OR Bachelor's Degree in Business, Finance, Economics, Liberal Arts, Computer Science, or related field AND 5+ years marketing, strategy, business planning, consulting, banking, finance, economics, and/or partner organization experience OR equivalent experience. 2+ years experience in Strategy, Management Consulting, and/or Finance. An advanced understanding of technology business models. Willing to take on a big challenge with significant growth potential. Business Strategy IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $85,100 - $169,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $112,000 - $185,300"
      }
    ]
  },
  {
    "job_id": "1902455",
    "title": "Senior Portfolio Manager, Real Estate",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1902455/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Business Management, Real Estate, Project Management, or related field AND 5+ years Portfolio Management, Real Estate, or Office Management experience OR 7+ years equivalent experience. Ability to comprehend, analyze, and interpret complex documents and data, demonstrating advanced analytical and quantitative skills to solve multifaceted problems and positively influence partners. Ability to apply long-term, strategic perspective and forecasting, demonstrating organizational skills to develop and prioritize plans at both strategic and execution levels. Understand workplace, financial, and organizational dynamics to deliver successful corporate real estate solutions. Communication skills that include presenting information clearly and respond effectively to sensitive issues. Ability to drive solutions and lead effectively in a fast-paced, dynamic environment. A continuous improvement mindset with a passion for optimizing space solutions and driving innovation within the company. Real Estate Portfolio Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1882214",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882214/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to C++, C#, Java, JavaScript, or Python OR equivalent experience. 6+ years experience designing, building, and managing high-scale full-stack systems including authentication, microservices, distributed systems, data and analytics workloads, and AI training and inferencing services. 6+ years experience with AI, cloud-based architectural patterns and best practices.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. OR equivalent experience. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1903403",
    "title": "Principal AI Applied Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903403/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 8+ years of experience leading large-scale AI systems and cross-org initiatives that shipped. 8+ years of experience in software engineering foundations and hands-on depth in Python plus deep-learning frameworks ( PyTorch / TensorFlow) and modern MLOps /tooling.",
    "preferred_qualifications_text": ": PhD in AI/ML or related field with top-venue publications and/or patents. Experience architecting and deploying LLMs/multimodal models and multi-agent systems in production at scale. Familiarity with Responsible AI frameworks and bias-mitigation techniques. Demonstrated ability to shape product strategy and drive organizational change. Experience with Microsoft’s LLMOps stack: Azure AI Foundry, Azure Machine Learning, Semantic Kernel, Azure OpenAI Service, and Azure AI Search for vector/RAG Applied Sciences IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer , and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1903678",
    "title": "Director Business Strategy - Revenue & Profitability",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903678/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration or related field AND 8+ years marketing, strategy, business planning, consulting, banking, finance, economics, and/or partner organization experience OR Bachelor's Degree in Business, Finance, Economics, Liberal Arts, Computer Science, or related field AND 12+ years marketing, strategy, business planning, consulting, banking, finance, economics, and/or partner organization experience OR equivalent experience. 4+ years experience in Strategy, Management Consulting, and/or Finance. Business Strategy IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1860861",
    "title": "Technical Program Management IC3",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1860861/",
    "required_qualifications_text": ": Bachelor's Degree AND 2+ years experience in engineering, product/technical program management, data analysis, computer science, or product development OR equivalent experience. 1+ years project management experience Ability to communicate complex technical concepts clearly to non-technical stakeholders. Strong skills in cross-functional collaboration, project planning, and risk management.",
    "preferred_qualifications_text": ": Bachelor's Degree AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 1+ year(s) of experience reading and/or writing code (e.g., sample documentation, product demos). Strong understanding of WINDOWS OS technologies including but not limited to commercial use; Windows 11 Enterprise, Windows Server, and Azure Virtual Desktop, infrastructure support, and scalable virtualization. For Consumer; Windows 11 Home & Pro, Microsoft 365 Personal & Family, and Copilot in Windows. And for Windows 365 space; Windows 365 Enterprise, and Business. Experience in industries such as technology, healthcare, or finance, where WINDOWS OS is applied to solve real-world problems. Cloud (OS) proficiencies highly desired. Scrum Master, or other relevant certifications. Technical Program Management IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  }
]