[
  {
    "job_id": "1890338",
    "title": "Senior Product Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890338/",
    "required_qualifications_text": ": Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience. 5+ years of product management experience, overseeing successful product launches by effectively meeting market demands and business objectives. Key skills include strategic planning, cross-functional collaboration, and data-driven product lifecycle management. 2+ years of experience designing and delivering Cloud and SaaS products.",
    "preferred_qualifications_text": ": 3+ years experience developing cross-platform frameworks compatible with Windows, macOS, iOS, Android, and Linux. Proven experience in operating systems, software, and similarly complex technical fields. Proactive approach to ambiguity with an agile mindset. #W+DJOBS #WindowsCloud #Windows365 #CloudPC\nRequired Qualifications:\n• Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience.\n• 5+ years of product management experience, overseeing successful product launches by effectively meeting market demands and business objectives. Key skills include strategic planning, cross-functional collaboration, and data-driven product lifecycle management.\n• 2+ years of experience designing and delivering Cloud and SaaS products.\n• OR equivalent experience.\nOther Requirements :\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications :\n• 3+ years experience developing cross-platform frameworks compatible with Windows, macOS, iOS, Android, and Linux.\n• Proven experience in operating systems, software, and similarly complex technical fields.\n• Proactive approach to ambiguity with an agile mindset.\n#W+DJOBS\n#WindowsCloud\n#Windows365\n#CloudPC",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1844313",
    "title": "Azure Advanced Cloud Engineer 2 – Customer Focus",
    "locations": [
      "Redmond, Washington, United States + 7 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1844313/",
    "required_qualifications_text": ": Bachelor's Degree Engineering, Computer Science, Information Technology (IT), Data Analytics/Science, Artificial Intelligence (AI), or related field AND 2+ years experience in technology industry, cloud, technical support, and/or customer experience engineering OR equivalent experience. 2+ years of demonstrated experience supporting and troubleshooting enterprise level, mission-critical applications and infrastructure resolving complex issues/situations and driving technical resolution across cross-functional organizations. 1+ years of Experience with being on-call and driving mitigation for mission critical incidents.",
    "preferred_qualifications_text": ": Technical Skills: Demonstrated hands-on experience with expertise in one or more of the following Cloud technologies: Core IaaS: Compute (Windows/Linux), Storage, Networking, Kubernetes, High Availability Data Platform and Bigdata: Azure SQL DB, Cosmos DB, PostgreSQL on Azure, Azure Data Bricks, Azure Data Factory, AI/ML Azure PaaS Services: App Services, Azure Functions, Redis Cache, and Event Hub. Monitoring technologies: Azure Monitor, Log Analytics, Grafana, Datadog, Confluent and similar technologies. Communication skills: ability to empathize with customers and convey confidence. Able to explain highly technical issues to varied audiences. Able to prioritize and advocate customer’s needs to the proper channels. Take ownership and work towards a resolution. Customer Obsession: Passion for customers and focus on delivering the right customer experience. Growth Mindset: Openness and ability to learn new skills and technologies in a fast-paced environment. Customer Experience Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1894562",
    "title": "Digital Win Room Deal Strategist - Americas",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894562/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in a related field. 5+ years managing projects, including planning, managing timelines, and tracking progress, and/or change management experience. 5+ years experience working with sales organizations. 5+ years experience with proposals and sales pursuits. 5+ years of sales experience supporting cloud solutions for customers, and deep understanding of account planning and execution 5+ years experience with solid understanding of the sales process and organizations 5+ years of commercial business experience. Familiarity with Microsoft-specific processes and Sales frameworks (e.g., MCEM), with the ability to navigate and apply them effectively in dynamic environments. Demonstrated success leading virtual teams; experience in people management is welcomed. Skilled in executive-level communication (both verbal and written), with a track record of partnering with senior leadership and translating complex business scenarios into actionable insights. Adept at guiding cross-functional teams—including account, services, sales, and area leadership—through opportunity development, solution planning, offer creation, and growth acceleration. Proficient in leveraging data and insights to inform decisions and drive meaningful outcomes. Known for cultivating trusted relationships with senior leaders and contributing to the advancement of strategic initiatives. Sales Excellence IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1889378",
    "title": "Sourcing and Category Manager",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889378/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Proven cross-functional team facilitation experience preferred. Experience working successfully with international businesses and understanding the intricacies and nuances of various cultures and countries. Analytical and strategic problem-solving capabilities in finance and business subjects. Excellent communication and presentation skills. Sourcing and Category Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1885682",
    "title": "Program Manager, External Operations",
    "locations": [
      "Redmond, Washington, United States + 8 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885682/",
    "required_qualifications_text": ": Bachelor's Degree in Business, Operations, Finance, or related field AND 6+ years experience in program management, process management, or process improvement OR equivalent experience. 2+ years Vendor/supplier experience 4+ years stakeholder communications 4+ years leveraging data, strategic thinking and process development 2+years indirect people management",
    "preferred_qualifications_text": ": Master's Degree in Business, Operations, Finance, or related field AND 8+ years experience in program management, process management, or process improvement OR Bachelor's Degree in Business, Operations, Finance, or related field AND 12+ years experience in program management, process management, or process improvement OR equivalent experience. 4+ years working with Microsoft 365 Suite demonstrating advanced proficiency. Business Program Management IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $116,900 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $148,400 - $222,600"
      }
    ]
  },
  {
    "job_id": "1892522",
    "title": "Onboarding Program Manager",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892522/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "10+ years of program management experience, confident partnering with Senior Leadership and subject matter experts. 7+ years demonstrated experience in leading complex projects from start to delivery, with a broad array of skills to ensure high-value, end-user focused outcomes. Deep understanding of SME&C and MCAPS roles and business priorities. Experience designing and validating learning programs, including curriculum frameworks and skills assessments. Resilient, with a Growth Mindset, able to navigate a fast-changing environment and iterate quickly on potential solutions. Excellent oral, written, and interpersonal communication skills – known as a great communicator with the ability to synthesize the complex. Relevant Bachelor’s degree or experience commensurate with job expectations for this position is required. Integrated Learning IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $116,900 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $148,400 - $222,600"
      }
    ]
  },
  {
    "job_id": "1891619",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891619/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 5+ years of experience designing and implementing hyperscale distributed platforms and cloud services. Experience in high-scale service architecture, Azure technologies (Azure Kubernetes Service, Cosmos DB, Blob Storage), and modern cloud patterns.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1894487",
    "title": "Principal Business Manager - Datacenter Operations",
    "locations": [
      "Redmond, Washington, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894487/",
    "required_qualifications_text": ": Bachelor's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 8+ years’ experience in business management, business planning, operations management, strategy, project management, or business-related roles OR equivalent experience. 8+ years of experience in leadership positions, demonstrating the ability to work closely with senior leadership and promote collaboration among cross-functional teams . 8+ years business or program management experience working in a production, mission-critical 24/7 environment such as Data Center or other Critical Environments . Background Check Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Master's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 12+ years experience in financial management , business planning, operations management, strategy, project management, or business-related roles OR Bachelor's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 15+ years experience in financial management , business planning, operations management, strategy, project management, or business-related roles OR equivalent experience. B usiness acumen and u nderstan ding of the data center i nd ustry . E xecutive presence and proven ability to influence technical peers and senior leaders. Industry P roject management, data an alytics and organization skills. Effectiveness driving complex multi-stakeholder planning processes, driving cross-team programs to desired results. Experience collaborating across diverse groups t o drive clarity and effectiveness in rhythm of business and delivering projects on time. Proactiveness and a positive outlook and approach to change management. B usiness acumen and agility to ramp quickly across our diverse business and offerings. Effectiveness driving complex multi-stakeholder planning processes, driving cross-team programs to desired results. Ability to synthesize complex ideas into easy-to-understand concepts for communications. Demonstrated capability in verbal and written communications skills across a geographically dispersed audience. People management experience a plus, as the role is likely to grow as the organization grows. Business Management IC6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $277,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $303,600"
      }
    ]
  },
  {
    "job_id": "1875977",
    "title": "Software Engineer II - CTJ - Poly",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1875977/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Preferred/Additional Qualifications: 4+ years of experience with PowerShell, C#, Python, Go or C++. Experience working on large-scale distributed services with on-call responsibilities. Ability to build and influence broadly towards common goals and priorities. Ownership of end-to-end project lifecycle with solid project management skills. Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 19, 2025 #Silver\nRequired/Minimum Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination.\n• Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n• Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nPreferred/Additional Qualifications:\n• 4+ years of experience with PowerShell, C#, Python, Go or C++.\n• Experience working on large-scale distributed services with on-call responsibilities.\n• Ability to build and influence broadly towards common goals and priorities.\n• Ownership of end-to-end project lifecycle with solid project management skills.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 19, 2025\n#Silver",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1887734",
    "title": "Regional Datacenter Business Operations Program Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887734/",
    "required_qualifications_text": ": High School Qualification or equivalent AND 3+ years experience supporting IT equipment or related technology or delivering server and network deployment projects in large-scale environments OR equivalent experience. 3+ years equivalent experience providing business support in a 24x7x365 production environment. 3+ years experience in the development of tools and apps utilizing Power Apps, Power BI, Power Automate, Azure DevOps, SharePoint, Dynamics OR equivalent experience. Background Check Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": "Bachelor's or Technical College Degree in Computer Science, Math, Telecommunications, Electrical/Mechanical Engineering, Supply Chain Management or related field AND 8+ years experience in critical environment infrastructures (e.g., UPS, Generator, AHU), or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling) OR High School Qualification or equivalent AND 10+ years experience in critical environment infrastructures (e.g., UPS, Generator, AHU), or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling) OR equivalent experience. Applicable certifications: APICS/Inventory Control, CompTIA, Microsoft, Network Certifications, CCNA Certifications, ITIL v3 Foundation, Microsoft Operations Framework (MOF) Certifications. 6+ years of relevant finance, planning or analysis work experiences with a strong analytical foundation. Knowledge or background supporting AI PowerPoint, Excel, PBI and tools skills Data Center Operations Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $102,600 - $202,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,500 - $225,800"
      }
    ]
  },
  {
    "job_id": "1865066",
    "title": "Group Product Manager - CoreAI Infrastructure",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1865066/",
    "required_qualifications_text": ": Bachelor's Degree AND 8+ years experience in product/program management or software development OR equivalent experience. 1+ year(s) people management experience. 8+ years of experience designing and shipping complex products for developers, machine learning professionals, or similar 3+ years of experience with distributed platform ecosystem (multi-tenant / real-time processing, batch computing etc.) Proven experience in technical program management, preferably in AI infrastructure or cloud services. Experience with GPU fleet management, scheduling systems, and API lifecycle.",
    "preferred_qualifications_text": ": Experience creating solutions using Azure, AWS, or Google Cloud Experience writing Python, particularly for machine learning Experience with machine learning platforms Effective at driving complex multi-stakeholder processes and cross-team programs Ability to build effective relationships, influence and collaborate at all organizational levels Effective verbal and written communications skills for a global audience Proven business acumen, analytical and detail oriented Excellent communication and stakeholder management skills. Ability to navigate ambiguity and drive clarity across complex, cross-functional initiatives. Product Management M5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1890581",
    "title": "Partner Manager",
    "locations": [
      "New York, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890581/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master of Business Administration (MBA) Degree in Sales, Marketing, or related field AND 5+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR Bachelor's Degree in Sales, Marketing, or related field AND 7+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR 10+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR equivalent experience. 4+ years’ experience in digital media sales/service with a focus on agencies. Understanding of the Agency buying landscape and media operations Experience in nurturing AdTech and data-driven partnerships alongside media activation. Experience with Demand side platform (DSPs) and/or Publisher side buying tools Advertising Client Success IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1882690",
    "title": "Senior Software Engineer - Virtualization",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882690/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3+ years of experience with systems engineering such as operating systems, virtualization, kernel development, and driver development.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Rust OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Rust OR equivalent experience. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1892843",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892843/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Breadth of knowledge across industries and solution areas, with a focus across data services on Microsoft platforms (SQL Database, COSMOS, Databricks, Fabric, Synapse, Purview Data Governance) Proven track record with successful delivery and execution of specific cloud projects/programs. Business acumen and effective communication skills with executive audiences. Commitment to the growth mindset exemplified by continued learning and demonstrated willingness to stay abreast of cloud advancements, including relevant cloud trends across the competitive landscape. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1844312",
    "title": "Senior Azure Advanced Customer Engineer – Customer Focus",
    "locations": [
      "Redmond, Washington, United States + 8 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1844312/",
    "required_qualifications_text": ": Bachelor's Degree in Engineering, Computer Science, Information Technology (IT), Data Analytics/Science, Artificial Intelligence (AI), or related field AND 4+ years experience in technology industry, cloud, technical support, and/or customer experience engineering OR equivalent experience. 4+ years of demonstrated experience supporting and troubleshooting enterprise level, mission-critical applications and infrastructure resolving complex issues/situations and driving technical resolution across cross-functional organizations. 2 + years of Experience with being on-call and driving mitigation for mission critical incidents.",
    "preferred_qualifications_text": ": Technical Skills: Demonstrated hands-on experience with Subject Matter Expert level expertise in one or more of the following Cloud technologies: Core IaaS: Compute (Windows/Linux), Storage, Networking, Kubernetes, High Availability Data Platform and Bigdata: Azure SQL DB, Cosmos DB, PostgreSQL on Azure, Azure Data Bricks, Azure Data Factory, AI/ML Azure PaaS Services: App Services, Azure Functions, Redis Cache, and Event Hub. Monitoring technologies: Azure Monitor, Log Analytics, Grafana, Datadog, Confluent and similar technologies. Communication skills: ability to empathize with customers and convey confidence. Able to explain highly technical issues to varied audiences. Able to prioritize and advocate customer’s needs to the proper channels. Take ownership and work towards a resolution. Customer Obsession: Passion for customers and focus on delivering the right customer experience. Growth Mindset: Openness and ability to learn new skills and technologies in a fast-paced environment. Customer Experience Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885258",
    "title": "Software Engineer: Full-stack",
    "locations": [
      "Mexico City, México, Mexico"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885258/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python o OR equivalent experience Business fluency in English (read, write, speak).",
    "preferred_qualifications_text": ": Exposure to Microsoft Azure or other cloud platforms (GCP, AWS). Familiarity with AI/ML fundamentals, tools (like Azure ML, OpenAI), or data analytics workflows. Understanding of version control systems (e.g., Git) and DevOps and CI/CD practices. Cloud Native Architecture, with a strong understanding of cost management, Scalability and observability. Hands-on experience with Selenium or any automation tools and SQL. Curiosity, collaboration mindset, and a passion for solving real-world customer problems. #EiP\nRequired Qualifications:\n• Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python o OR equivalent experience\n• Business fluency in English (read, write, speak).\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR equivalent experience\nPreferred Qualifications:\n• Exposure to Microsoft Azure or other cloud platforms (GCP, AWS).\n• Familiarity with AI/ML fundamentals, tools (like Azure ML, OpenAI), or data analytics workflows.\n• Understanding of version control systems (e.g., Git) and DevOps and CI/CD practices.\n• Cloud Native Architecture, with a strong understanding of cost management, Scalability and observability.\n• Hands-on experience with Selenium or any automation tools and SQL.\n• Curiosity, collaboration mindset, and a passion for solving real-world customer problems.\n#EiP",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1832306",
    "title": "Data Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1832306/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 2+ years experience in business analytics, data science, software development, data modeling or data engineering work OR Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 1+ year(s) experience in business analytics, data science, software development, or data engineering work OR equivalent experience. 1+ year (s) of experience building generative AI applications.",
    "preferred_qualifications_text": ": 2+ years of experience contributing to the design and implementation of model finetuning pipelines (e.g., LoRA, domain/task-specific adaptation) for customer and product scenarios. 2+ years of applying transformer architectures and reinforcement learning techniques to improve finetuned models for reasoning, search, and generation tasks. 2+ years contributing to research publications (e.g., patents, libraries, or academic papers) and beginning to share work externally through conferences or industry events. Deep expertise in designing and scaling Generative AI pipelines (e.g., RAG systems, domain/task-specific finetuning ) Data Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1894536",
    "title": "Solution Area Specialist - AI Business Process",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894536/",
    "required_qualifications_text": "2+ years of experience in technology-related sales or account management AND a Bachelor's Degree in Computer Science, Information Technology, Business Administration, Information Security, or related field OR equivalent experience 2+ years of experience selling AI Business Process applications to enterprise customers 2+ years of experience forecasting, developing demand and building pipeline, and leading/orchestrating complex, matrixed teams.",
    "preferred_qualifications_text": "Bachelor's Degree in Computer Science, Information Technology, Business Administration, Information Security, or related field AND 8+ years experience in technology-related sales or account management OR a Master's Degree in Business Administration (i.e., MBA), Information Technology, Information Security, or related field AND 6+ years experience in technology-related sales or account management OR equivalent experience 4+ years solution or services sales experience Experience with selling CRM and/or ERP applications including Marketing Automation, Sales Automation, Relationship Sales, Customer Service, Field Service, Finance, Supply Chain Management and Commerce and an understanding of how they translate into business impact and value Broad understanding of commercial cloud offerings, ideally including Microsoft’s cloud platform, as well as competitors and related ecosystems. Industry expertise in any of the following: Financial Services, Healthcare, Retail, Manufacturing & Mobility, High-Tech, Automotive, Oil/Gas/Energy, Professional Services, Telco/Media/Gaming, and/or SLED. Solution Area Specialists IC3 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role’s job duties.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $87,000 - $148,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $113,400 - $164,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $107,600 - $187,500"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $145,600 - $205,600"
      }
    ]
  },
  {
    "job_id": "1832308",
    "title": "Senior Data Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1832308/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science , Math, Software Engineering, Computer Engineering, or related field AND 4 + years experience in business analytics, data science, software development, data modeling or data engineering work OR Master's Degree in Computer Science , Math, Software Engineering, Computer Engineering , or related field AND 3 + year(s) experience in business analytics, data science, software development, or data engineering work OR equivalent experience. 1+ year(s) of experience building generative AI applications. 1+ year (s) of experience fine-tuning language models.",
    "preferred_qualifications_text": ": 2+ years of experience leading the development of advanced model finetuning techniques (e.g., multi-tenant LoRA, instruction tuning, reinforcement learning–based optimization), establishing best practices across teams. 4+ years of technical leadership in designing and scaling Generative AI pipelines (RAG, finetuning, evaluation frameworks), with deep expertise in transformer models and architectures. Data Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1891419",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891419/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 8 years of experience in system software development with a proven track record of delivering complex system-level software. Experience working with SoC platforms, PCIe, or other hardware interfaces. Exposure to secure coding practices and system-level security concepts. Familiarity with CI/CD pipelines and automated testing frameworks. Contributions to open-source or internal platform libraries and tools. Proficient communication and leadership skills. Experience influencing architecture and long-term technical strategy. Track record of driving engineering excellence and innovation. Hands-on experience in Embedded Linux Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1891556",
    "title": "Head of Affiliate Marketing, Minecraft",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891556/",
    "required_qualifications_text": ": Bachelor's Degree in Business, Marketing, Business Development, Business Management, Communications, or related field AND 5+ years sales, marketing, or business development experience OR equivalent experience. 5+ years of experience in affiliate marketing setting strategy and driving implementation for affiliate programs. 3+ years of experience collaborating directly with influencers, engaging with a diverse range of audiences from grassroots to celebrities or similar groups. Experience working with executive leadership.",
    "preferred_qualifications_text": ": Master's Degree in Business Administration, or related field AND 4+ years in Affiliate Marketing OR Bachelor's Degree in Business, Marketing, Business Development, Business Management, Communications, or related field AND 6+ years in Affiliate Marketing OR equivalent experience. Knowledge of Minecraft; and understanding of the Minecraft community and franchise. Experience working with global brands and practical experience creating both global and regional strategies. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1894505",
    "title": "Research Intern - AI Agents & Reasoning",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894505/",
    "required_qualifications_text": "Currently enrolled or accepted in a PhD program in Computer Science, Software Engineering, Electrical Engineering, or a related STEM field. At least 1 year of experience in conducting research and authoring peer-reviewed publications.",
    "preferred_qualifications_text": "Experience in machine learning, natural language processing, or related AI areas (e.g., LLMs, AI agents, Reasoning). Hands-on experience with one or more topics: large language model fine-tuning, reinforcement learning, prompt engineering, agent memory architectures, planning and reasoning modules, or multi-agent system design and implementation. Strong written and verbal communication skills. Ability to collaborate effectively in cross-functional, multi-disciplinary teams across research and product groups. Research contributions demonstrated through publications in top venues such as NeurIPS, ICML, ICLR, ACL, EMNLP, NAACL, AAAI, IJCAI, KDD or related conferences. The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,710 - $13,270"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,760 - $14,360"
      }
    ]
  },
  {
    "job_id": "1890855",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States + 5 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890855/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Experiences in building, evaluating and optimizing AI models, experience with Prompt and Context Engineering. Software engineering experience including building and maintaining large-scale web applications. Proficient with high quality Software design, development experience with effective problem solving, and debugging skills. Creative problem-solving & analytical skills to drive keen insights and identification of opportunities combined with a “sense of urgency” to develop solutions. Understanding and knowledge about big data and writing queries with Kusto/KQL. A proven track record of shipping high quality products or solutions Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1894041",
    "title": "Director, Go to Market Management, Azure",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894041/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1894531",
    "title": "Research Intern - Cloud Reliability & Efficiency",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894531/",
    "required_qualifications_text": "Currently enrolled or accepted in a PhD program in Computer Science, Software Engineering, Electrical Engineering, or a related STEM field. At least 1 year of experience in conducting research and authoring peer-reviewed publications.",
    "preferred_qualifications_text": "Experience with distributed systems, cloud infrastructure and software development. Proficient written and verbal communication skills. Able to work in a cross-functional and multi-disciplinary setting across research and product. Published in one of the following venues: OSDI, SOSP, ASPLOS, NSDI, EuroSys, ATC, SoCC, MLSys, ICSE, FSE, WebConf, etc. The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,710 - $13,270"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,760 - $14,360"
      }
    ]
  },
  {
    "job_id": "1892838",
    "title": "Principal Technical Program Manager",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892838/",
    "required_qualifications_text": "Bachelor's Degree AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 3+ years of experience managing cross-functional and/or cross-team projects.",
    "preferred_qualifications_text": ": Proven collaboration and project management skills, combined with a strategic orientation, as well as an aptitude for solving complex problems. Previous experience managing strategic cross-functional initiatives. Ability to collaborate and influence effectively across a broad set of internal and external stakeholders Demonstrated proficiency in verbal and written communication Experience building and deploying solutions on Microsoft platforms (Azure, Power Platform, Fabric) Technical Program Management IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire / transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  }
]