[
  {
    "job_id": "1876728",
    "title": "Sr. Product Marketing Manager - AI at Work Evangelist",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 13, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1876728/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing, Computer Science, Business or related field AND 6+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business or related field AND 8+ years experience in business OR equivalent experience. Demonstrated success in designing and delivering scalable enablement programs. Experience with programmatic prompt testing, evaluation rubrics, and publication workflows. Experience designing and running benchmarking or competitive evaluations with ability to turn results into actionable recommendations for product and GTM efforts Analytical, strategic, and problem-solving skills, with the ability to use data and insights to drive decisions and actions. Proven leadership skills with the ability to influence and drive alignment across teams, while working effectively with diverse teams and stakeholders at all levels of the organization. Customer-centric mindset with the ability to have a deep understanding of customer pain points and needs, and translate into key value propositions and compelling narratives. Experience successfully influencing engineering product roadmaps. Demonstrated written and verbal communication skills Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1891579",
    "title": "Sr. Industry Product Marketing Manager, Media and Entertainment",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 13, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891579/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing, Computer Science, Business or related field AND 6+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business or related field AND 8+ years experience in business OR equivalent experience. 6+ years experience in in product marketing, product strategy or consulting. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1849271",
    "title": "Service Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 13, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1849271/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Computer Science, Information Technology, Mechanical Engineering, Electrical Engineering, Aerospace Engineering, Data Science, Cybersecurity, or related field AND 3+ years technical experience in software engineering, network engineering, service engineering, systems engineering, or industrial controls OR Bachelor's Degree in Computer Science, Information Technology, Mechanical Engineering, Electrical Engineering, Aerospace Engineering, Data Science, Cybersecurity, or related field AND 5+ years technical experience in software engineering, network engineering, service engineering, systems engineering, or industrial controls OR equivalent experience. 1+ year e xperience applying AI/ML techniques to infrastructure or service engineer ing scenarios (e.g., anomaly detection, predictive maintenance, intelligent alerting), AI platform frameworks such as Azure Machine Learning, Copilot Studio on Azure or GitHub Copilot Experience in managing asset lifecycle data, building Power BI reports for operational insights, supporting lab environments and coordinating with facilities teams. Knowledge of Executive Order ( EO ) compliance and secure network designs . Ability to manage vendor relationships and lead cross-team initiatives. Service Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1889548",
    "title": "Principal Machine Learning Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 13, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889548/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C++, C#, Go, Java, or Python OR equivalent experience. 6+ years technical engineering experience designing and delivering highly available, large-scale cloud services and distributed systems. Experience building AI or ML related applications.",
    "preferred_qualifications_text": ": 8+ years of technical engineering experience with coding in languages including, but not limited to, C++, C#, Go, Java, or Python 3 + years of technical engineering experience with machine learning or AI systems Experience building or maintaining evaluation systems, benchmarking tools, or ML model testing frameworks. Strong ML, statistics, and data science experience are a plus Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  }
]