[
  {
    "job_id": "1891815",
    "title": "Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 21, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891815/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline OR equivalent experience Proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python 1+ years of professional experience building production services or APIs in one or more languages (e.g., C#, Java, C/C++, Go, Python) and working with cloud platforms (Azure preferred). 1+ of distributed systems fundamentals (scalability, resilience, consistency), data structures/algorithms, and secure coding practices.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java OR equivalent experience. Software Engineering IC2: The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud Background Check upon hire / transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport.",
    "pay_ranges": []
  },
  {
    "job_id": "1899108",
    "title": "Principal Security Researcher",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 21, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899108/",
    "required_qualifications_text": ": Doctorate in Statistics, Mathematics, Computer Science or related field OR 7+ years experience in software development lifecycle, large-scale computing, modeling, cybersecurity, and/or anomaly detection. 7+ years in applied security research or application security 7+ years leading security initiatives with proven impact on engineering practices 7+ years mentoring and building security knowledge and practice within partner teams",
    "preferred_qualifications_text": ": Doctorate in Statistics, Mathematics, Computer Science or related field OR 8+ years experience in software development lifecycle, large-scale computing, modeling, cybersecurity, and/or anomaly detection. 1+ years experience with generative AI/LLM frameworks for security applications 1+ years experience with regex, Kusto, and/or SQL for log analysis 7+ years experience publishing research outputs or contributing to security tooling Security Research IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1897565",
    "title": "Principal Product Manager - Microsoft Planner",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 21, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897565/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Experience in work management, productivity, or collaboration tools. Track record of driving cultural improvements and inclusive practices. Proven ability to lead complex projects and influence without authority. Analytical skills and experience using data and research to inform decisions. Ability to navigate ambiguity and make high-impact decisions under pressure. Effective communication and executive presence. Product Management IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1899511",
    "title": "Senior Product Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 21, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899511/",
    "required_qualifications_text": ": Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience. Experience with hardware and software-based solutions with a focus on product fundamentals, such as performance, telemetry, and diagnostics. Preferred/Additional Qualifications : Demonstrated knowledge or hands-on experience applying AI technologies to enhance endpoint management, including areas such as predictive analytics, automated remediation, and/or intelligent policy enforcement. The ability to communicate clearly and effectively with diverse audiences, including through all levels of an organization, technical and non-technical. Experience working on an initiative through a full product lifecycle. 5+ years of collaboration and relationship management skills for making change happen in a highly matrixed environment. Product Management IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications and processes offers for these roles on an ongoing basis. #W+DJOBS\nRequired Qualifications :\n• Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience.\n• Experience with hardware and software-based solutions with a focus on product fundamentals, such as performance, telemetry, and diagnostics.\n• OR equivalent experience.\nPreferred/Additional Qualifications :\n• Demonstrated knowledge or hands-on experience applying AI technologies to enhance endpoint management, including areas such as predictive analytics, automated remediation, and/or intelligent policy enforcement.\n• The ability to communicate clearly and effectively with diverse audiences, including through all levels of an organization, technical and non-technical.\n• Experience working on an initiative through a full product lifecycle.\n• 5+ years of collaboration and relationship management skills for making change happen in a highly matrixed environment.\nDemonstrated knowledge or hands-on experience applying AI technologies to enhance endpoint management, including areas such as predictive analytics, automated remediation, and/or intelligent policy enforcement.\nProduct Management IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft will accept applications and processes offers for these roles on an ongoing basis.\n#W+DJOBS",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1859499",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 21, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1859499/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": 5+ years of experience in cloud services or AI systems. Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience building and shipping AI features for world-class production systems. Knowledge of machine learning tools and libraries like PyTorch or TensorFlow or similar Hands on experience in programming languages such C, Java, C++, or equivalent programming languages. Excellent communication skills and ability to collaborate within a multi-disciplinary team. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1897632",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 21, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897632/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of experience as a software engineer/leader designing, implementing, and shipping cloud services or software products. 4+ years OOP (object-oriented) development experience.",
    "preferred_qualifications_text": ": Exposure to COM, WinRT, NT Services, and Windows OS development. Expertise in modern C++ and/or C# .net. Expertise in modern web frameworks like React or Microsoft FAST. Solid problem-solving and end-to-end ownership skills, including live site engineering, telemetry, and collaboration across multiple components and teams. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1884634",
    "title": "Principal Software Engineer/Architect - Azure Core",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 21, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1884634/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C++, C#, Java or Python OR equivalent experience 5+ years of experience in architecting large scale distributed systems. 5+ years operational experience in running a service in one of the large-scale clouds like Microsoft Azure (Azure), or similar. 5+ years experience providing technical leadership, raising the technical bar, maintaining data and results-driven culture while closely working with cross function teams, for the same connected mission. 2+ years of experience problem-solving skills in the space of AI, large datasets, Spark, Ray or other computing technologies.",
    "preferred_qualifications_text": ": 5+ years of hands-on working knowledge of building true cloud-scale services. 2+ years of exposure to the internals of databases, stores 4+ years of exposure to the internals of Spark, Kubernetes, GraphX, Pandas, Structured Streaming etc. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  }
]