[
  {
    "job_id": "1886974",
    "title": "Director, Go-To-Market Management, Azure Developer Audience, Commercial",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1886974/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1885880",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885880/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience 4+ years of hands-on coding experience shipping products across multiple release cycles.",
    "preferred_qualifications_text": ": ​​Master’s degree in Systems, Computer Science. Working knowledge of operating systems concepts (scheduling, caching, memory management). Experience with at-scale distributed systems. Experience with large-scale data analytics and app Proficiency with C#/C++, solid knowledge of SQL. Prior experience in Cloud service offering Design and implementation skills. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1889278",
    "title": "Principal SOC Architect",
    "locations": [
      "Mountain View, California, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889278/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Doctorate in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 5+ years technical engineering experience OR Master's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 8+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 12+ years technical engineering experience OR equivalent experience. 1+ year(s) experience working on or leading projects from beginning-to-end. 5+ years of experience in interaction with Power and Thermal management of SOCs in data center products Silicon Engineering IC5 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations or Export Administration Regulations, the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their US . residency or other protected status (e.g., under 8 U.S.C. 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1889460",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889460/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of experience in a software/automation role. 2+ years of experience working with software engineering teams, hardware engineering teams and data science teams.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Demonstrated experience with Azure DevOps, including infrastructure automation, deployment, and adherence to best practices. Hands-on expertise with Linux image creation and environment management. Proficiency in Python programming. Deep understanding of API-to-API development and architectural design. Experience deploying and automating operations for Kubernetes compute environments. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1889241",
    "title": "Software Engineer II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889241/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Linux or Python OR equivalent experience. 1+ year(s) technical experience in computer networking, systems engineering, or general cloud technologies.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience 1+ year(s) experience working with kernel or userspace networking drivers. 1+ year(s) experience with network virtualization. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1861277",
    "title": "Software Engineer II",
    "locations": [
      "Multiple Locations, Costa Rica + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1861277/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Global collaboration is integral to our work at Microsoft, and proficiency in English is essential for effective communication in this role.",
    "preferred_qualifications_text": ": Excellent skills in design, debugging and problem solving. Passion for customers, product quality and test engineering. Demonstrated experience in shipping high-quality products or services. Familiarity with Azure, web services, multi-tiered client/server distributed applications and cross device, testing.\nRequired Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• Global collaboration is integral to our work at Microsoft, and proficiency in English is essential for effective communication in this role.\n• OR equivalent experience.\nPreferred Qualifications:\n• Excellent skills in design, debugging and problem solving.\n• Passion for customers, product quality and test engineering.\n• Demonstrated experience in shipping high-quality products or services.\n• Familiarity with Azure, web services, multi-tiered client/server distributed applications and cross device, testing.",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1889559",
    "title": "Software Engineer II, Agent Services (CoreAI)",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889559/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2 + years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2 + years of experience designing, building, and operating production-grade software and services at scale, with a proven track record of delivering high-impact solutions.",
    "preferred_qualifications_text": ": Demonstrated expertise in solving complex technical challenges in one or more domains such as distributed systems, AI/ML infrastructure, developer platforms, or cloud services. Experience engaging with customers during integration or deployment phases, with a focus on delivering value and incorporating feedback into product evolution. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1891080",
    "title": "Senior Security Researcher",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891080/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Doctorate in Statistics, Mathematics, Computer Science or related field. OR 6+ years experience in software development lifecycle, large-scale computing, modeling, cybersecurity, and/or anomaly detection. Demonstrated ability to adapt to the evolving landscape of AI and large language models (LLMs), including leveraging these technologies to enhance threat detection, analysis, and response. Experience working with and analyzing large-scale datasets (e.g., billions of events per day). Security Research IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1857570",
    "title": "Senior Security Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1857570/",
    "required_qualifications_text": ": Master's Degree in Statistics, Mathematics, Computer Science, or related field AND 3+ years experience in security or related field OR Bachelor's Degree in Statistics, Mathematics, Computer Science, or related field AND 4+ years experience in security or related field OR equivalent experience. 3+ years of experience in identifying security vulnerabilities, software development lifecycle, large-scale computing, modeling, cyber security, and anomaly detection. 3+ years of experience in a hands-on security role, with demonstrable software engineering skills. 3+ years of demonstrated coding skills in one or more popular languages and platforms - such as C#, Java, C++, JavaScript/Typescript, SQL, assembly, Ruby, Python, GoLang. 3+ years of technical experience with multiple classes of vulnerabilities - such as cross-site scripting, buffer overflows, SQL injection, TOCTOU (Time of Check Time of Use) vulnerabilities, crypt Save ographic weaknesses, insecure direct object references.",
    "preferred_qualifications_text": ": Bachelor's Degree in Statistics, Mathematics, Computer Science. Engineering, or related field AND 8+ years experience in security or related field OR Master's Degree in Statistics, Mathematics, Computer Science, Engineering or related field AND 6+ years experience in security or related field OR equivalent experience. Experience in technical disciplines outside the security space, including general software development, networking, database management, big data and full-stack development. Demonstrated knowledge and understanding of Microsoft Azure or competing cloud services. Ability to pick up new languages, platforms, and frameworks platforms quickly. Ability to communicate about them to technical and non-technical audiences. Penetration Testing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1836776",
    "title": "Software Engineer II - Virtualization and Kernel",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1836776/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ year experience building virtualization, operating system, device drivers, or firmware features. Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with ccoding in C or C++ OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in C or C++. Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1889175",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889175/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ year(s) of team-oriented software development experience. 1+ year(s) experience with Python 1+ year(s) experience in .Net, Rust, or C++ development 1+ year(s) of direct experience working with modern Machine Learning frameworks (Pytorch, Jax, Julia) and deploying models into inference frameworks.",
    "preferred_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 5+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 1+ year(s) experience creating publications (e.g., patents, peer-reviewed academic papers). Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1884240",
    "title": "Software Engineer (AI/ML)",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1884240/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. OR equivalent experience. Experience in a technical role applying machine learning or mathematical optimization techniques to real-world problems. Experience building or integrating solutions using large language models (LLMs) or AI agents.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience working independently and collaboratively within cross-functional teams, with a strong understanding of software engineering fundamentals including data structures, algorithms, testing methodologies, and design patterns Commitment to continuous personal and team development through a growth mindset. Experience applying machine learning principles, including theoretical foundations such as algorithmic behavior, model architectures, optimization techniques, and statistical learning Experience developing cloud-based solutions and implementing Machine Learning Operations (MLOps) strategies for model deployment, monitoring, and governance. Software Engineering IC2 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $84,200 - $165,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $109,000 - $180,400"
      }
    ]
  },
  {
    "job_id": "1885094",
    "title": "Data Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885094/",
    "required_qualifications_text": ": Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 1+ year(s) experience in business analytics, data science, software development, data modeling, or data engineering OR Bachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 2+ years experience in business analytics, data science, software development, data modeling, or data engineering OR equivalent experience. 3+ years with scripting and coding languages with a focus on data engineering, like SQL, KQL, python, Scope, C# (or similar object-oriented languages) and others. 1+ years of experience with building large data processing frameworks using technologies like Azure Data Factory, Azure Data Explorer, PowerBI and/or other public and Microsoft internal tools. 1+ years of experience in analytics to define, monitor, and optimize key performance indicators (KPIs) and connected business metrics that ensure measurable customer success. 1+ years of proven ability to orchestrate and sustain a data-driven rhythm of business, transforming insights into actionable strategies that align with organizational priorities and deliver impactful outcomes.",
    "preferred_qualifications_text": ": A solid quality mindset with the ability to deliver end-to-end data solutions that build partner and customer confidence, ensuring alignment with business objectives and measurable outcomes. Experience with Git, ADO or equivalent Source Control Systems. Experience with data visualization tools and how to effectively communicate Insights to consumers of varying types of audiences. Experience leveraging AI to define and evaluate quality standards Data Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1848308",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1848308/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3+ years of experience/knowledge of cloud computing, enterprise computing products. 2+ years of industry experience coding in C++. Working knowledge of web technologies and browser APIs (e.g., Chromium, Firefox, Safari, Edge).",
    "preferred_qualifications_text": ": Proven experience designing, developing, and testing complex software systems using both managed (C#, JavaScript/TypeScript/React) and native (C/C++) languages, with a strong track record of delivering high-quality solutions. Deep understanding of cloud computing, distributed systems, and secure development practices, with hands-on expertise in remote desktop protocols, browser APIs, and cross-platform compatibility. Solid problem-solving and end-to-end ownership skills, including live site engineering, telemetry, and collaboration across multiple components and teams. Passion for agile development, rapid prototyping, and fostering a culture of learning, inclusion, and customer-centric engineering. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1830570",
    "title": "Senior ML Research Engineer – LLM Quantization & Model Optimization",
    "locations": [
      "Mountain View, California, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1830570/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Experience publishing academic papers as a lead author or essential contributor. Experience participating in a top conference in relevant research domain. Proven track record in developing production-scale software for model compression and performance optimization. Proficient with deep learning frameworks such as PyTorch, TensorFlow, TensorRT, and ONNX Runtime. In-depth understanding of Transformer and LLM architecture, including various model optimization techniques such as quantization, pruning, neural architecture search (NAS), knowledge distillation, sharding/parallelism, KV cache optimization, and FlashAttention. Hands-on experience in setting up large scale evaluation framework for SOTA LLMs, fine tuning of large models. Programming skills in Python, C, and C++. Excellent communication skills and a team-oriented mindset. Hands-on experience implementing and optimizing low-level linear algebra routines and custom BLAS kernels would be a plus. Deep knowledge of mixed-precision arithmetic unit microarchitecture would be a plus. Research Sciences IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1864488",
    "title": "Senior Security Researcher",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1864488/",
    "required_qualifications_text": ": Master's Degree in Statistics, Mathematics, Computer Science or related field OR 5+ years experience in software development lifecycle, large-scale computing, modeling, cybersecurity, and/or anomaly detection. 4+ years threat intelligence experience tracking threat actors and their infrastructure and understanding of network protocols and internet scanning at scale Experience developing signatures in internet scanning service data (Censys, Shodan, etc) to detect threat actor command and control infrastructure Experience working with engineering teams to develop probes for internet wide scanning capabilities",
    "preferred_qualifications_text": ": Doctorate in Statistics, Mathematics, Computer Science or related field OR 6+ years experience in software development lifecycle, large-scale computing, modeling, cybersecurity, and/or anomaly detection. Experience querying large data sets via Kusto Query Language (KQL), python, or other similar query languages. Ability to conduct malware analysis and analyze network traffic associated with advanced attack campaigns Security Research IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1887033",
    "title": "Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887033/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C++, C#, Java, or Python, OR equivalent experience. Academic or professional experience with C#, Java, or another object-oriented programming language.",
    "preferred_qualifications_text": "A proven track record of shipping high quality products or services. Experience building and shipping distributed web services. 1+ years of development experience. Experience with one or more cloud platforms (e.g., Azure, AWS, etc.). Software Engineering IC2 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $84,200 - $165,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $109,000 - $180,400"
      }
    ]
  },
  {
    "job_id": "1839940",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1839940/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 6+ years of experience in full-stack engineering experience in a professional setting. 3+ years technical engineering experience working with large-scale cloud or distributed systems. Security, identity, domain experience Familiarity with Machine Learning and applied AI concepts. 5+ years software development experience in full product cycle: design, development, release, and maintenance. Software Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1879171",
    "title": "Software Engineer II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1879171/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, Rust, C++, or Python OR equivalent experience. 2+ years of experience in low-level systems development Examples include work related to networking, device drivers, or similar foundational technologies 1+ year(s) of technical experience with computer networking Includes familiarity with network protocols, configurations, or infrastructure 1+ year(s) of experience with general cloud technologies May involve working with cloud platforms, services, or deployment models",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, Rust, C++, or Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, Rust, C++, or Python OR equivalent experience. Experience with virtualization technology (Hyper-V, KVM, VMware), microservices, service-oriented architecture, distributed systems, DPDK, CI/CD, and NIC hardware offloads is a plus. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1891708",
    "title": "Software Engineer",
    "locations": [
      "Chicago, Illinois, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891708/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience and familiarity with cloud-native development and DevOps practices (e.g., Git, CI/CD, automated testing) and foundational knowledge of data structures/algorithms, with a willingness to learn Azure services.",
    "preferred_qualifications_text": ": Exposure to Azure infrastructure and services (e.g., compute, storage, networking); interest in Windows on Azure is a plus. Exposure to video game development, particularly tools or automation. Previous exposure to Agile/Scrum development methodologies. Experience or interest in leveraging AI for software development (e.g., GitHub Copilot, Cursor, or similar). Software Engineering IC2 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $84,200 - $165,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $109,000 - $180,400"
      }
    ]
  },
  {
    "job_id": "1888051",
    "title": "Senior Applied Scientist",
    "locations": [
      "Seattle, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1888051/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 3+ years experience conducting research as part of a research program in academic or industry settings.",
    "preferred_qualifications_text": ": 2+ years' experience training and/or finetuning large language models, model compression, distillation to small language models. 3+ years' experience with Python and deep learning libraries Experience in large language/multimodal model training, finetuning and distillation. Demonstrated record of publications in top-tier conferences or journals (ICLR, ACL, EMLP, ICML, CVPR, ICCV, ECCV, NeurIPS, TPAMI, etc.). Experience in creating reusable software libraries and packages. Experience using dataset curation, data generation using prompting state of art LLMs and/or model alignment. Experience with reinforcement learning libraries or formal methods and verification is a plus. Demonstrated ability and passion for incubating new ideas, solving problems, and building working systems. Applied Sciences IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885828",
    "title": "Senior Applied Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885828/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 2+ years of research or product experience in Natural Language Processing. 2+ years of hands-on experience in Deep Learning using PyTorch or similar. 3+ years of software engineering experience in Python or C#.",
    "preferred_qualifications_text": ": Masters degree in Computational Linguistics or Computer Science with a focus on Natural Language Processing. 2+ years experience publishing peer-reviewed papers and presenting at conferences. 3+ years experience conducting research as part of a research program (in academic or industry settings). 3+ years experience developing and deploying live production systems, as part of a product team Applied Sciences IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1835403",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1835403/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience in designing, building and managing distributed systems within a cloud environment, ensuring scalability, reliability, and performance. 2+ years of experience working with stakeholders to derive requirements and effectively delivering results through other Software Development Engineers on the team.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. #Azurecorejobs\nRequired Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• 2+ years of experience in designing, building and managing distributed systems within a cloud environment, ensuring scalability, reliability, and performance.\n• 2+ years of experience working with stakeholders to derive requirements and effectively delivering results through other Software Development Engineers on the team.\n• OR equivalent experience.\nOther Requirements:\n• Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\nPreferred Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.\n#Azurecorejobs",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1890335",
    "title": "Principal Silicon Performance Architect",
    "locations": [
      "Mountain View, California, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890335/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Doctorate in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 5+ years technical engineering experience OR Master's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 8+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 12+ years technical engineering experience OR equivalent experience. 1+ year(s) experience working on or leading projects from beginning-to-end. 3+ years experience in one or more of the following fields Lossless Data compression algorithms (such as Deflate or Zstd) Image/Video compression algorithms Experience in working with AI tools in the day-to-day work Silicon Engineering IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1887991",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887991/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience in designing and implementing modern distributed solutions and cloud systems architecture, including microservices and containers",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with cloud solutions using Azure Services. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1890925",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890925/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1873243",
    "title": "Principal Technical Program Manager",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1873243/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "BS in Computer Science/Computer Engineering/EE or equivalent experience Good program management skills to drive cross-org collaboration and ability to drive teams to deliver results without direct authority. Proven ability to synthesize and communicate solutions to complex technical problems. Exceptional organization and project management skills, e.g., experience with SW/FW agile project management methodology, TFS, DevOps, JIRA or similar Experience in managing complex cross-org, cross-business, cross-disciplinary programs and presenting updates to senior leadership team. Ability to deal with ambiguity, prioritize multiple strategic and tactical options and drive issues to resolution without compromising on quality. Experience with SW development/testing strategy and requirement creation Familiar with the E2E development process of SoC product development Data center HW/SW project experience from inception to go live Ability to deal with ambiguity, prioritize multiple strategic and tactical options, and drive issues to closure with a high bar on quality Technical savvy. Know how to solve the hard problems, and demonstrate ability to work independently Proficient communication skill and interpersonal skill Experience working with software code in one or more languages such as C, C++, C#, Java, JavaScript, Python, etc. Technical Program Management IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1872696",
    "title": "Director, Silicon Design Verification",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1872696/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "1 2 + years of experience in design verification 5+ years experience managing cross-functional / cross-time - zone engineering teams. Verification lead experience for an IP or SS related to CPUs, VPUs, GPUs, Direct Memory Access (DMA) engine, Tensor unit, or similar Experience of working on Artificial Intelligence (AI) / Machine Learning (ML) SoCs Experience in Scripting language such as Python or Perl Hands on experience in Formal property verification Silicon Engineering M5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations or Export Administration Regulations, the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their US. residency or other protected status (e.g., under 8 U.S.C. 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1857949",
    "title": "Senior Software Engineer - Azure Office of the CTO",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 07, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1857949/",
    "required_qualifications_text": ": Bachelor’s Degree in Computer Science or a related technical discipline AND 4+ years of experience in software engineering using languages such as Go or Python, OR equivalent experience. 2+ years of experience building orchestration frameworks in cloud-native environments. 2+ years of experience working with Terraform, CloudFormation or Azure ARM (Azure Resource Manager) templates",
    "preferred_qualifications_text": ": Expertise in Kubernetes, including CRDs (Custom Resources Definition), controllers, and operator patterns. Experience with DevOps automation and build, test and release pipelines. Experience building and maintaining CLI (Command Line Interface) tools. Commitment to fostering an inclusive, collaborative, and respectful culture. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  }
]