[
  {
    "job_id": "1893313",
    "title": "Sr. Principal Project Manager",
    "locations": [
      "New York, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893313/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in related field AND 15+ years' experience in project management OR equivalent experience. Project Management Professional (PMP) and Program Management Professional (PgMP) certification. Agile certification, Scrum Master, Agile Certified Practitioner (PMI-ACP), or Professional Scrum Master One (PSM1) certification. Experience in creating and managing intellectual property (IP). Significant experience working with C-level executives (progress reporting, negotiating budgets, timelines, risks/issues, etc). 15+ years overseeing IT-based projects. Experience with managing Program-level financials. Development of hybrid Project Plans that include both waterfall and agile efforts. Consulting Project Management IC6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $138,200 - $268,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $175,900 - $288,000"
      }
    ]
  },
  {
    "job_id": "1885360",
    "title": "Finance Director",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885360/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": 5+ years work experience in the technology or software industry. 5+ years work experience in matrix-based organization. 5+ years experience in multinationals with multi-product/multi-segment finance roles. 3+ years experience managing direct reports. Master's Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 12+ years of post-graduate financial analysis, accounting, controllership, or finance work experience OR Bachelor's degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 15+ years of post-graduate financial analysis, accounting, controllership, or finance work experience OR equivalent experience. Financial Analysis M6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $277,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $303,600"
      }
    ]
  },
  {
    "job_id": "1897245",
    "title": "Partner Development Manager",
    "locations": [
      "San Francisco, California, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897245/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration, Business Science, or an advanced degree in a Science, Technology, Engineering, and Mathematics (STEM) or a related field AND 10+ years experience in partner management, sales, business development, or partner channel development in the technology industry or related experience OR equivalent experience. Partner Development Management IC5 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role's job duties. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $133,000 - $222,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $170,300 - $239,800"
      }
    ]
  },
  {
    "job_id": "1896984",
    "title": "Senior Security Policy Program Manager - CTJ - TS/SCI",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896984/",
    "required_qualifications_text": ": 4+ years experience in security program or program management or related field OR equivalent experience.",
    "preferred_qualifications_text": ": Bachelor’s degree in business risks, or related field AND 8+ years’ experience in Security Program or Program Management OR equivalent experience. Proven track record as a Physical and Technical Security Policy Officer, preferably within the IC, DoD, or equivalent international bodies. Extensive experience with national security systems policy, SCIF construction, and classified data center operations. Strong understanding of personnel security frameworks and interagency directives. Demonstrated ability to navigate complex government-industry interfaces and influence policy outcomes. Exceptional written and verbal communication skills, with the ability to synthesize technical guidance into strategic recommendations. Working knowledge of ICD705, NISPOM and other standards for the protection of U.S. Government information Confident and skilled in preparing and delivering presentations and briefings to customers, senior leaders and executives Strong work and compliance ethic with the ability to effectively prioritize and execute tasks in a dynamic and high-pressure environment Analytical and process improvement skills to produce data driven insights and associated process change Ability to change plans, goals, actions and priorities in response to an evolving business environment with awareness to operate as a champion for course corrections when necessary Proficient in the use of Microsoft Office products for business #COICareers | #EPCCareers | #DCDCareers Security IC4 - The",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret/SCI Security Clearance . Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Criminal Justice Information Services: This position requires passing a background check conducted through the CJIS criminal justice information system by authorized local, state, and/or federal agencies.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1894676",
    "title": "Sr Finance Manager, CFT Commercial Revenue",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894676/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Masters Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 6+ years of post-graduate financial analysis, accounting, controllership, or finance work experience OR Bachelor's degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 8+ years of post-graduate financial analysis, accounting, controllership or finance work experience OR equivalent experience. 1+ year(s) experience in multinationals with multi-product/multi-segment finance roles. 1+ year(s) work experience in matrix-based organization. 1+ year(s) work experience in the technology or software industry. 1+ year(s) experience applying AI agents in finance-related applications. Financial Analysis IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1874784",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1874784/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of professional software development experience, writing and debugging production-level code. 2+ years of experience providing technical leadership for a feature, area, or product — including driving design decisions, mentoring others, or coordinating cross-functional efforts. Experience developing client applications (e.g., desktop, mobile, or cross-platform apps).",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Proven ability to thrive in ambiguous environments and pivot quickly. Proven success working closely with researchers, designers, and product managers to deliver innovative, user-centered solutions. Experience working with ML models in production environments, especially in areas like semantic search, voice interaction, etc will be a plus. Software Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1898991",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898991/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience in full-stack development, including but not limited to using technologies such as React, TypeScript, Node.js, C#, Azure, and/or Microsoft Graph APIs. Experience partnering across disciplines to design, develop, and ship reliable features using agile methodologies.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Understanding of agent-based architectures and best practices in conversational UX design. Experience with declarative frameworks and prompt engineering. Proficiency in AI/ML, particularly in working with LLMs and assessing prompt quality. Experience building or integrating with Copilot or similar conversational platforms. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1893335",
    "title": "Senior Operations Business Program Manager",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893335/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business, Operations, Finance, or related field AND 8+ years experience in program management, process management, or process improvement OR Bachelor's Degree in Business, Operations, Finance, or related field AND 12+ years experience in program management, process management, or process improvement OR equivalent experience. Ability to thrive and drive clarity in ambiguous situations, with adaptability and growth mindset. Demonstrated ability as a project manager who can prioritize multiple activities to deliver on project scope and schedule. Structured thinking and problem-solving capabilities. Effective analytic skills and ability to substantiate claims with compelling evidence. Written, verbal, and presentation communication skills. Business Program Management IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $116,900 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $148,400 - $222,600"
      }
    ]
  },
  {
    "job_id": "1874727",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1874727/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ years proficient programming experience in one of C, RUST, C++, C# or Java. Drive for delivering high quality implementations and designs while also working on testing and operational aspects of the service as well. Proficient communication and collaboration skills, including cross-group. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1897067",
    "title": "Senior Cloud Solution Architect, Cloud and AI Apps (Bilingual Spanish)",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897067/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science, Information Technology, Engineering, Business, or related field AND 8+ years experience in cloud/infrastructure technologies, information technology (IT) consulting/support, systems administration, network operations, software development/support, technology solutions, practice development, architecture, and/or consultin g OR Master's Degree in Computer Science, Information Technology, Engineering, Business, or related field AND 6+ years experience in cloud/infrastructure technologies, technology solutions, practice development, architecture, and/or consulting OR equivalent experience 4+ years experience working in a customer-facing role (e.g., internal and/or external). 4+ years experience working on technical projects Technical Cloud Certification in any of the following: Azure Developer Associate (AZ-204) Azure AI Engineer Associate (AI-102) GitHub Copilot Certifications DevOps Engineer Expert (AZ-400) Azure Data Scientist Associate (DP-100) Certified Kubernetes Administrator (CKA) Azure Solutions Architect Expert Exam (AZ-305) Cloud Solution Architecture IC4 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role’s job duties.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1883338",
    "title": "Principal Software Engineer - Azure Storage",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1883338/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C++, C#, Java, or Python OR equivalent experience. 8+ years of systems experience in hands-on development of reliable and performant distributed systems.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C++, C#, Java or Python OR Master's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C++, C#, Java or Python OR equivalent experience. Experiences with storage systems in the areas like availability, remote copy, high performance, durability schemes . Knowledge of distributed systems. Software Engineering IC6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1898370",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898370/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Hands on experience with cloud platforms and enterprise-scale services. Familiarity with widely used scientific tools in chemistry, physics and bio sciences. Proficiency in building w eb user experience for scientists or developers. Deep problem-solving skills and a bias for action. Passion for scientific innovation and cross-disciplinary collaboration. Advanced degree (MS/PhD) is a plus. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1898382",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898382/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Technical leadership experience with cloud platforms and enterprise-scale services. Familiarity with widely used scientific tools in chemistry, physics and bio sciences. Proficiency in building w eb user experience for scientists or developers. Deep problem-solving skills and a bias for action. Passion for scientific innovation and cross-disciplinary collaboration. Advanced degree (MS/PhD) is a plus. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1900629",
    "title": "Principal Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1900629/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 15+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1897852",
    "title": "Principal Software Engineer, Immersive Experiences - Microsoft Teams",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897852/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 8+ years of experience developing high performance web applications in modern web technologies including but not limited to, React, Fluent UI, or WebGL. 4+ years of experience as a technical lead. 2+ years of experience incorporating the latest AI models and Computer Vision algorithms in user experiences.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 15+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with applied AI and incorporating LLMs into user experiences. Experience in shipping highly scalable, networked user experiences and performant web applications. Demonstrated communication, collaboration, and problem-solving skills with the ability to deal with ambiguity in a fast-paced environment. Software Engineering IC6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1824215",
    "title": "Senior Software Engineer - Azure Storage",
    "locations": [
      "Multiple Locations, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1824215/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science , or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C or C++ OR equivalent experience. 4+ years of experience in data structures and algorithms with experience in testing, debugging, and analytical skills. 2+ years of experience with multi-threaded programming.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C or C++ OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C or C++ OR equivalent experience. Experience in designing and building large scale distributed systems with experiences in cloud backend development and operations, including performance, reliability, resiliency, and scale-out. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $117,200 - $229,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $153,600 - $250,200"
      }
    ]
  },
  {
    "job_id": "1898175",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898175/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred/Additional Qualifications: Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 27, 2025. #MSFTSecurity #MSCareerEvents25\nRequired/Minimum Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• 4+ years of experience in designing and developing distributed systems\n• OR equivalent experience.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications:\n• Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft will accept applications for the role until October 27, 2025.\n#MSFTSecurity #MSCareerEvents25",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1899120",
    "title": "Software Engineer II, Minecraft Online",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899120/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C++ OR equivalent experience. 2 years of experience building web or mobile user interfaces.",
    "preferred_qualifications_text": ": Experience contributing to a large C++ codebase. Experience working with mobile, console, or PC entertainment. Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1892630",
    "title": "Senior Business Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892630/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 8+ years experience in financial management, business planning, operations management, strategy, project management, human resources, or business-related roles OR Bachelor's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 12+ years experience in financial management, business planning, operations management, strategy, project management, human resources, or business-related roles OR equivalent experience. Business Management IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $116,900 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $148,400 - $222,600"
      }
    ]
  },
  {
    "job_id": "1898122",
    "title": "Senior Software Engineer, Linux Kernel",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898122/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, Linux, C, C++, or Rust OR equivalent experience. 1+ years experience with Linux kernel and its core modules like memory management, process scheduling, networking, storage, and file system. 1+ years experience with v irtualization technologies like KVM, VFIO and QEMU.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, Linux, C, C++, or Rust OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, Linux, C, C++, or Rust OR equivalent experience. 1+ years of experience programming with cloud computing platforms such as Microsoft Azure, Amazon Web Services (AWS), or similar. 1+ years of experience demonstrating technical and collaborative skills, including: Aptitude in designing, developing, debugging, and validating products. Effective problem-solving skills and ability to work independently. Contributions to open-source projects, such as the Linux kernel or Cloud Native Computing Foundation (CNCF). Experience collaborating with external teams (open source, standards, and/or partners). Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1896789",
    "title": "Senior Delivery Contract Manager - Industry Solutions Delivery (ISD)",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896789/",
    "required_qualifications_text": ": Bachelor's Degree in related field AND 3+ years experience in project management OR equivalent experience. Extensive experience managing contracts and related documents at a large-scale corporation, law firm, or government entity.",
    "preferred_qualifications_text": ": Bachelor's Degree in related field AND 8+ years experience in project management OR equivalent experience Project Management Professional (PMP) certification. 4+ years financial management experience. A history working in a complex cross-functional business environment. Track record of building internal and external business and supplier relationships at all levels. Regular interaction with senior stakeholders, internally and externally, within an enterprise scale organization. Consulting experience or MBA qualification (Preferable). Experience working in the US state and local government sector. Consulting Project Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,000 - $193,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $126,100 - $204,000"
      }
    ]
  },
  {
    "job_id": "1897447",
    "title": "Senior Quantum Hardware Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897447/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Doctorate in Electrical Engineering, Materials Science, Physics, or related field AND 3+ years experience in industry or in a research and development environment, could include completion of a post doctoral research position OR Master's Degree in Electrical Engineering , Materials Science, Physics, or related field AND 6+ years experience in industry or in a research and development environment OR Bachelor's Degree in Electrical Engineering , Materials Science, Physics, or related field AND 8+ years experience in industry or in a research and development environment OR equivalent experience. 8 + years of industry experience in semiconductor processing fundamentals (lithography, wet etch, dry etch, chemical and/or mechanical polishing, etc.). Deep experience with statistical Process Control (SPC), or Design of Experiments (DOE) principles. Familiarity with Electronic Design Automation (EDA) tools such as Cadence Virtuoso, Synopsys, Mentor Graphics, or Keysight ADS is highly valuable. Data analysis skills with demonstrated ability to construct clear data-based problem statements and k nowledge of quantum physics, behavior of semiconductors at cryogenic temperatures is desirable. Ability to be flexible and adapt to new situations in a rapidly changing research environment. Familiarity with superconducting circuits . Quantum Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR), the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their U.S. permanent residency or other protected status (e.g., under 8 U.S.C. § 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Ability to leverage AI tools to drive innovation and efficiency (e.g., performance modeling and analysis, research gathering, day to day task automation). Apply AI to accelerate engineering and lab workflows. Design and build AI agents/copilots that assist with experiment setup, log triage, measurement report generation, protocol templating, and knowledge retrieval (e.g., instrument manuals, design docs).",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1892733",
    "title": "Cloud Solution Architect - Infrastructure",
    "locations": [
      "Arlington, Virginia, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892733/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science , Information Technology, Engineering, Business, Liberal Arts, or related field AND 7+ years experience in cloud/infrastructure technologies, information technology (IT) consulting/support, systems administration, network operations, software development/support, technology solutions, practice development, architecture, and/or consulting OR equivalent experience. At least 7 years of hands-on experience in infrastructure architecture, cloud computing, or similar technical roles. Other Require ments: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport .",
    "preferred_qualifications_text": "Deep proficiency in Microsoft Azure infrastructure services—compute, networking, storage, hybrid cloud. Experience with Azure Government, FedRAMP High, and Zero Trust architectures. Familiarity with disconnected, classified, and sovereign environments. Advanced expertise with Microsoft Azure services, architectural patterns, and solution design. Comprehensive understanding of networking, virtualization, identity, security, and regulatory compliance, especially as it pertains to defense industry requirements. Demonstrated success delivering complex infrastructure projects within enterprise or mission-critical environments. Outstanding communication, presentation, and stakeholder engagement abilities. Relevant certifications (e.g., Azure Solutions Architect Expert, CISSP, CCSP) are highly regarded. Prior experience supporting defense sector customers, including systems integrators and mission platforms. Proven ability to deliver secure, scalable, and resilient solutions in high-consequence environments. Background in multi-cloud or hybrid cloud architectures, particularly within the defense sector. Experience with DevOps methodologies, automation, and Infrastructure as Code ( IaC ). Proven ability to lead technical teams and drive influence across organizational boundaries. Exceptional analytical and problem-solving skills. Commitment to ongoing learning and professional development. Preferred Certifications: Azure Solutions Architect Expert – AZ-305 Azure Security Engineer Associate – AZ-500 Azure Network Engineer Associate – AZ-700 Azure Administrator Associate – AZ-104 Azure Fundamentals – AZ-900 Cloud Solution Architecture IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1888073",
    "title": "Principal Engineer Manager - Azure Storage",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1888073/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline AND 6+ years technical engineering experience with coding in languages including, C# OR equivalent experience. 6+ years of hands-on experience with Cloud and large distributed systems architectures. 6+ years of experience in software development with a focus on large distributed systems. 2+ years of experience being a technical lead. Other Qualifications: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years people management experience. Software Engineering M5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1898766",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898766/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java OR equivalent experience. 4+ years of experience with distributed systems and storage. 4+ years of experience with demonstrated problem-solving and coding skills.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java OR equivalent experience. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1899977",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 22, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899977/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#. OR equivalent experience. 6 + years of industry experience with either C , C++ or Rust. 5+ years of system software or operating system development experience.",
    "preferred_qualifications_text": ": 10 + years of software development experience. Experience with networking protocols and architecture. C oding, debugging, testing, and problem-solving skills. U nderstanding of systems software. Design and implementation skills using C, C++ or Rust. Understanding of operating systems Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  }
]