[
  {
    "job_id": "1902426",
    "title": "Senior Manager, Process Excellence",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1902426/",
    "required_qualifications_text": "Bachelor's Degree in Business, Operations, Finance or related field AND 4+ years’ work experience in program management, process management, process improvement OR equivalent experience. 2+ years’ experience with Lean Management Tools: Value Stream Mapping, Business Process Management Professional, Change Management (e.g., Prosci), Six Sigma, and/or Agile certifications.",
    "preferred_qualifications_text": "8+ years’ PMP, experience with process execution and impact management, or related experience (e.g., data analytics.) Proven ability to turn data insights into recommended action, executive communication/presentation experience Certified Information Systems Security Professional (CISSP) certification OR an International Association of Privacy Professionals (IAPP) Privacy Professional certification OR American Institute of Certified Public Accountants (AICPA) qualified auditor. Business Program Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1893340",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893340/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C#, .NET, data technologies, web services, REST APIs, JSON OR equivalent experience. 2+ years experience with the UX development technologies: JavaScript, HTML5, CSS, jQuery, TypeScript and Angular or React 2+ years’ experience in design and implementation of large-scale cloud services. 2+ years’ experience building extensible and maintainable services that last the test of time.",
    "preferred_qualifications_text": "Master's Degree in Computer Science or a related technical field, along with 2+ years of technical engineering experience with coding in languages such as C, C++, C#, Java, JavaScript, or Python; OR Bachelor's Degree in Computer Science or a related technical field, along with 4+ years of technical engineering experience with coding in languages such as C, C++, C#, Java OR equivalent experience. Industry experience with cloud technologies (Azure, AWS, Google). Experience with distributed systems, micro-service architecture, scalability patterns, and high-availability architectures. Experience with REST Based API’s development, messaging patterns (e.g. Service bus, Event Hub, Storage Queues) and cloud storage technologies ( e.g. Cosmos DB) Proficient in problem-solving skills, with a data-driven approach to debugging and performance optimization. Effective communication and collaboration skills, with the ability to lead technical discussions. Passion for customer-focused innovation. Experience in deploying, monitoring, and operating services in the cloud. Ability to learn quickly and self-motivated. Excellent problem-solving, troubleshooting, and organizational skills. Experience with or exposure to Agile and iterative development processes. Familiarity with modern engineering practices such as CI/CD and version control systems like Git Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1893683",
    "title": "Principal Product Manager - Publisher Monetization",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893683/",
    "required_qualifications_text": ": Bachelor's Degree AND 8+ years experience in product/service/program management or software development OR equivalent experience. 2+ years experience working with advertiser, publisher or marketplace ad technology 2+ years of experience taking a product, feature, or initiative to market (e.g., design, addressing market fit, and launch, internal tool/framework) for advertisers or publishers.",
    "preferred_qualifications_text": ": 5+ years of experience in monetization products and technology Ability to work in a fast-paced environment, manage multiple priorities, and adapt to changing requirements and deadlines. Proven ability to collaborate and contribute to a positive, inclusive work environment, fostering knowledge sharing and growth within the team. Product Management IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1899073",
    "title": "Principal Product Manager - MAI Monetization",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899073/",
    "required_qualifications_text": ": Bachelor's Degree AND 10+ years experience in product/service/program management or software development OR equivalent experience. 2+ years experience leading cross functional product teams across advertising, privacy, search, conversational AI, or generative AI. 5+ years experience delivering products that include full Search and/or Advertising technology stack. 5+ years experience with data analytics and experimentation tools with working knowledge of SQL and coding skills (Python, Javascript).",
    "preferred_qualifications_text": ": Bachelor's Degree AND 15+ years experience in product/service/program management or software development OR equivalent experience. 7+ years of experience building Ads products. 5+ years of experience in monetization products and B2B. Ability to work in a fast-paced environment, manage multiple priorities, and adapt to changing requirements and deadlines. Proven ability to collaborate and contribute to a positive, inclusive work environment, fostering knowledge sharing and growth within the team. Product Management IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  }
]