[
  {
    "job_id": "1882690",
    "title": "Senior Software Engineer - Virtualization",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882690/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3+ years of experience with systems engineering such as operating systems, virtualization, kernel development, and driver development.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Rust OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Rust OR equivalent experience. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1891691",
    "title": "Senior Electrical Engineer",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891691/",
    "required_qualifications_text": ": Master's Degree in Electrical Engineering, Computer Engineering, or related field AND 3+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, or related field AND 5+ years technical engineering experience OR equivalent experience. 5+ years of relevant hands-on experience in system (compute, storage, networking, and/or accelerator) level design and/or implementation across the hardware development lifecycle. 5+ years’ experience developing board and system level bring-up and test plans. 5+ years’ experience debugging board and system level issues for Cloud Servers.",
    "preferred_qualifications_text": ": Experience with high volume hardware production in server area. Knowledge about datacenters & operations at scale Experience with highspeed interfaces such as PCIe, DDR, and ethernet. In-depth experience with operating systems (Windows and/or Linux), system firmware (BIOS, BMC), and system security (hardware and software). Proven verbal and written communication and presentation skills. Experience with high-speed and high-power products design. Ability to work across multiple disciplines (hardware, firmware, software, and/or data center infrastructure) to identify risks, drive discussions, detail system tradeoffs, and assess impact. Experience executing hardware validation and functional test plans. E xcellent team player. Electrical Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1894612",
    "title": "Senior Finance Manager - Consumer Finance",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894612/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1894661",
    "title": "Senior Investigator",
    "locations": [
      "Atlanta, Georgia, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894661/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Business , Accounting, Criminal Justice, Law, International Relations or related field AND 8+ years experience in compliance, cyber, finance, data-analytics, investigations, or related field OR equivalent experience. Deep knowledge and experience in behavioral sciences, threat assessment, targeted violence and related physical security/safety risk. Certified Threat Manager (CTM), Professional Certified Investigator (PCI) and/or Certified Protection Professional (CPP) Proficient in the use of technology, computers (hardware, operating systems, networks), and software at a power user level (M365, Outlook, Excel, Word, Powerpoint , Access/SQL, PowerBI , SharePoint, Copilot, etc.). Possess or able to accomplish a US government security clearance. Investigations IC4 - The",
    "other_requirements_text": ": Citizenship& Citizenship Verification:This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1890871",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890871/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years experience writing applications using a web service-related programming language (examples include C#, ASP.net, or ReactJS)",
    "preferred_qualifications_text": ": 3+ years of experience designing, developing, and delivering production-grade APIs and SaaS solutions. Experience in building cloud-native architectures leveraging platforms such as Azure Service Fabric and Azure Kubernetes Service (AKS).\nRequired Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C#, Java, JavaScript, or Python OR equivalent experience.\n• 2+ years experience writing applications using a web service-related programming language (examples include C#, ASP.net, or ReactJS)\n• OR equivalent experience.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications:\n• 3+ years of experience designing, developing, and delivering production-grade APIs and SaaS solutions.\n• Experience in building cloud-native architectures leveraging platforms such as Azure Service Fabric and Azure Kubernetes Service (AKS).",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1832308",
    "title": "Senior Data Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1832308/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science , Math, Software Engineering, Computer Engineering, or related field AND 4 + years experience in business analytics, data science, software development, data modeling or data engineering work OR Master's Degree in Computer Science , Math, Software Engineering, Computer Engineering , or related field AND 3 + year(s) experience in business analytics, data science, software development, or data engineering work OR equivalent experience. 1+ year(s) of experience building generative AI applications. 1+ year (s) of experience fine-tuning language models.",
    "preferred_qualifications_text": ": 2+ years of experience leading the development of advanced model finetuning techniques (e.g., multi-tenant LoRA, instruction tuning, reinforcement learning–based optimization), establishing best practices across teams. 4+ years of technical leadership in designing and scaling Generative AI pipelines (RAG, finetuning, evaluation frameworks), with deep expertise in transformer models and architectures. Data Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1892544",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892544/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of computer science fundamentals and proven algorithm design capability",
    "preferred_qualifications_text": ": Proficiency in object-oriented development, with C# and .Net Framework (preferred) or any other object-oriented programming languages such as Java, C++ or related. Experience in architectural design and large-scale systems Software Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1883491",
    "title": "Security Engineer II - CTJ - Poly",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1883491/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification : This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Penetration Testing IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until November 10th 2025 #MSFTSecurity #microsoftredteam #MSCareerEvents25 #MSFTNBMBAA2025 #SCS #AzureSecurity\nRequired/Minimum Qualifications Bachelor's Degree in Statistics, Mathematics, Computer Science, Or related field AND 2+ years experience in security or related field OR Master's Degree in Statistics, Mathematics, Computer Science, or related field AND 1+ year(s) experience in security or related field OR equivalent experience. Other Requirements\nRequired/Minimum Qualifications\n• Bachelor's Degree in Statistics, Mathematics, Computer Science, Or related field AND 2+ years experience in security or related field\n• OR Master's Degree in Statistics, Mathematics, Computer Science, or related field AND 1+ year(s) experience in security or related field\n• OR equivalent experience.\nOther Requirements\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings\n• The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination.\n• Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n• Citizenship & Citizenship Verification : This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nPenetration Testing IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft will accept applications for the role until November 10th 2025\n#MSFTSecurity #microsoftredteam\n#MSCareerEvents25\n#MSFTNBMBAA2025\n#SCS #AzureSecurity",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1891700",
    "title": "Senior Technical Program Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891700/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Bachelor’s Degree in Engineering, Business, Construction Management, Data Analytics/Science AND 8+ years experience in planning, project management, execution, and analytics across large-scale complex organizations OR equivalent experience. OR equivalent experience. 6+ years experience managing cross-functional and/or cross-team projects. Demonstrates deep subject matter expertise on key functional areas of engineering, procurement, construction, mechanical, electrical, networking, and building automation systems. Expertise working with large-scale data sets and analytics tools (e.g. PowerBI, PowerApps) to derive insights and make process improvements. Comfortable working at the Executive level within a highly matrixed organization. Experience driving execution with hyper-scale cloud engineering groups. Technical program management experience managing scope, schedule, budget, quality, people, risk, and communications. Demonstrates leadership skills and experience working with large, diverse teams. Understanding of business and financial objectives and plans accordingly. Demonstrates technical excellence in learning and applying successful strategies and implementing improvements to engineering methods and quality practices across the data center delivery portfolio. MBA or equivalent advanced degree. Experience managing large scale construction or network infrastructure projects. Understanding of contract language. Technical Program Management IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1881684",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1881684/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years software engineering experience with C#, Java, and/or C++ 4+ years software engineering experience in multi-threaded, asynchronous, and/or systems programming, and object-oriented design fundamentals. 1+ year(s) of experience with cloud-scale applications and live services",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience leading teams/projects that maintain live services. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1893717",
    "title": "Research Intern - ML and Computational Biology for the Immune System",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893717/",
    "required_qualifications_text": "Accepted or currently enrolled in a PhD program in Machine Learning, Statistics, Computer Science, Computational Biology or other related field.",
    "preferred_qualifications_text": "Ability to develop original research agendas demonstrated by strong publication record as a lead author. Skills analyzing large datasets including but not limited to large-scale learning, experimental design, and statistical modeling. Able to collaborate and communicate across disciplines as part of a cross-functional team. Experience working with complex biological datasets. The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,710 - $13,270"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,760 - $14,360"
      }
    ]
  },
  {
    "job_id": "1890326",
    "title": "Research Program Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890326/",
    "required_qualifications_text": ": Bachelor's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 5+ years experience working in product or service design OR Master's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 4+ years experience working in product or service design OR equivalent experience (e.g., demonstrated experience working in product or service design or using design thinking to solve problems). 3+ years of experience in research operations, user research, or related operational roles. Proven track record of building and scaling operational systems and processes. Solid project management skills with ability to manage multiple initiatives simultaneously. Experience with research tools and platforms (e.g., UserTesting, Qualtrics, participant recruitment tools, etc.) Good understanding of research methodologies and the research lifecycle. Experience leveraging data to inform decisions and drive change.",
    "preferred_qualifications_text": ": Master's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 6+ years experience working in product or service design OR Bachelor's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 8+ years experience working in product or service design OR equivalent experience (e.g., demonstrated experience working in product or service design or using design thinking to solve problems). 4+ years experience shipping products, services, or games and/or delivering to customers as a result of an end-to-end design proces. Experience in a high-growth or enterprise technology environment. Background in user experience research or customer insights. Familiarity with legal, procurement, and compliance considerations for research. Experience managing vendor relationships and negotiating contracts. Knowledge management or information architecture experience. Experience scaling research through enablement programs. Strong understanding of trends in AI and automation, particularly as applied to research operations. Experience with emerging AI research tools and techniques. Track record of operating independently, embracing ambiguity, and delivering results in organized manner. Product Design IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1879564",
    "title": "Senior Design Engineer",
    "locations": [
      "Mountain View, California, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1879564/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": CPU or graphics core design. Complex algorithmic designs for AI usages Script development. Silicon Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations or Export Administration Regulations, the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their US. residency or other protected status (e.g., under 8 U.S.C. 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1891430",
    "title": "Software Engineer II - Windows AI",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891430/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years Industry experince coding in one of the following C++, C# and React. 2+ years experience with planning, scheduling and delivery of quality software. 1+ year of experience leveraging AI tools—such as Large Language Models (LLMs), intelligent agents, and related technologies—and contributing to AI-driven software development.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ year(s) technical engineering experience with coding in languages including, but not limited to C++, C#, Java, JavaScript/ React /Typescript, or Python OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to C++, C#, Java, JavaScript/ React /Typescript, or Python OR equivalent experience. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1894041",
    "title": "Director, Go to Market Management, Azure",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894041/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1893716",
    "title": "Principal Software Engineer - Azure Kubernetes Services",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893716/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR equivalent experience. 4+ years of experience working with Kubernetes OR managing distributed systems in production.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR Python OR Master's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR equivalent experience. Software Engineering IC6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1891619",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891619/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 5+ years of experience designing and implementing hyperscale distributed platforms and cloud services. Experience in high-scale service architecture, Azure technologies (Azure Kubernetes Service, Cosmos DB, Blob Storage), and modern cloud patterns.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1876485",
    "title": "Senior Product Designer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1876485/",
    "required_qualifications_text": ": Master's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 4+ years experience working in product or service design OR Bachelor's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 5+ years experience working in product or service design OR equivalent experience. 4+ years experience in a variety of design tools (especially Figma) and processes such as journey mapping and design sprints/workshops. 4+ years hands-on experience creating detailed wireframes (both low and high fidelity), polished design prototypes and other design artifacts in a fast-paced, cutting-edge technology environment.",
    "preferred_qualifications_text": ": Awareness of inclusive design and how it supports Microsoft’s mission. Experience with in the Security domain. Experience designing for Artificial Intelligence. Understanding of Large Language Model (LLM). Comfortable with ambiguity, design tradeoffs and shifting priorities. Creative and holistic problem solver with a sharp eye for details . Creating and applying established design principles and interaction patterns. Experience using design components and pattern libraries. Experience with Security domain. Demonstrated breadth across interaction design, information architecture, usability Excellent interpersonal communication and visual storytelling skills Able to scope and estimate efforts accurately and prioritize workload independently Product Design IC4 - The",
    "other_requirements_text": ": The ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885407",
    "title": "Senior Software Engineer - Azure Kubernetes Service",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885407/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Golang OR Java, JavaScript, or Python OR equivalent experience. 4+ year(s) experience in commercial software development, including building, shipping, and operating reliable, distributed solutions and engaging in site-reliability engineering practices.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Golang OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years experience with workload and container orchestration using Kubernetes or a similar platform. 4+ years experience with container runtimes such as Docker, Rkt, runC, and understanding how they interact with operating system components. 4+ years experience working in Linux environments. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1893726",
    "title": "Senior Software Engineer - Azure Kubernetes Service",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893726/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience. 3+ year(s) of experience in building, shipping and operating reliable, distributed solutions.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ year(s) of experience with building AI solutions using agentic AI tools. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1851505",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1851505/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 6+ years of experience focused on advanced software development and architecture, building commercial-grade, high-availability services. 6+ years of experience driving software platform architecture projects from both a technical and functional perspective. Guiding complex projects from planning through execution and service operations.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, or Rust OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, or Rust OR equivalent experience. 10+ years of experience focused on advanced software development and architecture, building commercial-grade, high-availability services. 10+ years of experience driving software platform architecture projects from both a technical and functional perspective. Guiding complex projects from planning through execution and service operations. Solid communication skills with a growth mindset. Demonstrated commitment to software engineering excellence. Analytical and problem-solving skills, with a history of navigating significant technical challenges, emphasizing a continuous release mindset and service operation in a dynamic environment. Ability to lead in a fast-paced, customer focused, and data-driven environment. A decisive, self-directed, collaborative, and innovative approach to projects. Hands-on competence in LLM infrastructure and paradigms: Agent-to-agent communication protocols and orchestration. Model Context Protocol. Integration of third-party tools, APIs, and data sources into LLM pipelines. Secure execution of LLMs in cloud environments, multi-tenant isolation, throttle control. Software Engineering IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1889385",
    "title": "Senior Product Marketing Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889385/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing, Computer Science, Business OR related field AND 6+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business OR related field AND 8+ years experience in business. Experience in strategy or management consulting, with specific experience in go-to-market strategies for Government, Defense and Intelligence industry technology solutions. Understanding of Microsoft’s cloud and AI solutions business strategy. Master's Degree in Marketing, Computer Science, Business OR related field AND 6+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business OR related field AND 8+ years experience in business OR equivalent experience. Product Marketing IC4 - The",
    "other_requirements_text": "Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1850040",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1850040/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of cloud service experience including, but not limited to Azure, GCP, and AWS. 4+ years of experience in data analysis in systems including, but not limited to security data management, logging, or monitoring solutions. 4+ years of experience building software systems, with a focus on large-scale, distributed platforms and working with high-scale, mission-critical SaaS products, including service operations. Proven ability to guide and mentor engineers, leading their projects to completion. Knowledge of data processing frameworks such as Spark, Hadoop, or similar technologies. Experience with security data management, logging, or monitoring solutions. Effective interpersonal communication and collaboration skills. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1893714",
    "title": "Research Intern - Copilot Tuning",
    "locations": [
      "Redmond, Washington, United States + 4 more locations"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893714/",
    "required_qualifications_text": "Accepted or currently enrolled in a PhD program in Computer Science or related STEM field.",
    "preferred_qualifications_text": "Ability to work in a dynamic, collaborative environment, through effective communication, with a multi-disciplinary team Track record of publications in the field of Artificial Intelligence, Machine Learning, and/or scientific journals Strong interest in real-world applications and impact Demonstrable ability to define an ambitious, original research agenda Experience in Python software development, ideally demonstrated by published software projects (e.g., Github) Experience implementing new AI systems or algorithms and running experiments and analyses to study and evaluate their performance Experience with training or post-training of LLMs, multimodal models, diffusion models, reasoning models, computer use agents, or building other related architectures or AI systems Willingness to embrace knowledge outside your field of research interest The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,710 - $13,270"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,760 - $14,360"
      }
    ]
  },
  {
    "job_id": "1890778",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890778/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C or C++ OR equivalent experience. 4+ years of experience in data structures and algorithms with experience in testing, debugging, and analytical skills. 2+ years of experience with multi-threaded programming.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C or C++ OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C or C++ OR equivalent experience. Experience in designing and building large scale distributed systems focusing on performance, reliability, resiliency, and scale-out. Experience in designing and maintaining high throughput, low latency object storage solutions. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $117,200 - $229,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $153,600 - $250,200"
      }
    ]
  },
  {
    "job_id": "1893683",
    "title": "Principal Product Manager - Publisher Monetization",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893683/",
    "required_qualifications_text": ": Bachelor's Degree AND 8+ years experience in product/service/program management or software development OR equivalent experience. 2+ years experience working with advertiser, publisher or marketplace ad technology 2+ years of experience taking a product, feature, or initiative to market (e.g., design, addressing market fit, and launch, internal tool/framework) for advertisers or publishers.",
    "preferred_qualifications_text": ": 5+ years of experience in monetization products and technology Ability to work in a fast-paced environment, manage multiple priorities, and adapt to changing requirements and deadlines. Proven ability to collaborate and contribute to a positive, inclusive work environment, fostering knowledge sharing and growth within the team. Product Management IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1891732",
    "title": "Senior Product Marketing Manager",
    "locations": [
      "Mountain View, California, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891732/",
    "required_qualifications_text": ": Master's Degree in in Marketing, Computer Science, Business or related field AND 3+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business or related field AND 5+ years experience in business OR equivalent experience. 3+ years of experience in Product Marketing, Product Management, or similar roles, leading cross-organizational teams and working with Engineering partners. 3+ years of experience in applying different customer listening approaches to inform and influence product development. 3+ years of experience in product positioning and value proposition, with experience in leading differentiated value propositions and translating complex features into compelling narratives.",
    "preferred_qualifications_text": ": Master's Degree in Marketing, Computer Science, Business or related field AND 6+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business or related field AND 8+ years experience in business OR equivalent experience. Experience in Advertising, Monetization & Publisher Ecosystems: Committed understanding of the digital advertising landscape—across agency, publisher, or brand perspectives. Experience with publisher platforms and monetization strategies is especially valuable. Familiarity with alternative models such as subscriptions is a plus. Strategic Agility & Adaptability: Demonstrated ability to navigate ambiguity, iterate on new concepts, and respond effectively to changing priorities. Brings a growth mindset, curiosity, and a proactive approach to exploring new ideas and business models. Cross-Functional Collaboration & Influence: Experience working across teams to build alignment, drive shared outcomes, and resolve complex issues. Skilled at fostering solid partnerships and communicating effectively with diverse stakeholders. Analytical & Data-Driven Decision Making: Solid problem-solving skills grounded in data. Able to identify trends, generate hypotheses, and test solutions to inform strategy and scale impact. Go-to-Market Innovation & Category Development: Experience launching disruptive products and driving demand for new or emerging product categories. Skilled in crafting go-to-market strategies that shape market perception and accelerate adoption. AI & Emerging Technology Familiarity: Exposure to generative AI products—professionally or as a power user. Understanding of AI agents and their potential in marketing and advertising scenarios. Awareness of the evolving AI landscape and its implications for monetization. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1891875",
    "title": "Director Business Strategy, SMB CloudAscent",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891875/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration or related field AND 5+ years of marketing, strategy, sales, sales leadership, program management, project management, business planning, consulting, banking, finance, economics, and/or partner organization experience OR Bachelor's Degree in Business, Finance, Economics, Computer Science, or related field AND 7+ years of marketing, strategy, sales, sales leadership, program management, project management, business planning, consulting, finance, economics, and/or partner organization experience OR equivalent experience. Sales Strategy Enablement IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1892522",
    "title": "Onboarding Program Manager",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892522/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "10+ years of program management experience, confident partnering with Senior Leadership and subject matter experts. 7+ years demonstrated experience in leading complex projects from start to delivery, with a broad array of skills to ensure high-value, end-user focused outcomes. Deep understanding of SME&C and MCAPS roles and business priorities. Experience designing and validating learning programs, including curriculum frameworks and skills assessments. Resilient, with a Growth Mindset, able to navigate a fast-changing environment and iterate quickly on potential solutions. Excellent oral, written, and interpersonal communication skills – known as a great communicator with the ability to synthesize the complex. Relevant Bachelor’s degree or experience commensurate with job expectations for this position is required. Integrated Learning IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $116,900 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $148,400 - $222,600"
      }
    ]
  },
  {
    "job_id": "1891087",
    "title": "Product Leader",
    "locations": [
      "Mountain View, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891087/",
    "required_qualifications_text": ": Bachelor's Degree AND 10+ years experience in product/service/program management or software development OR equivalent experience. 3+ years people management experience. 3+ years of automated bidding experience in ad-tech 5+ years of experience delivering products at platform scale (e.g., advertising, cloud, consumer platforms, or enterprise SaaS). 5+ years of working with experimentation, optimization, or machine learning systems.",
    "preferred_qualifications_text": ": Bachelor's Degree AND 15+ years experience in product/service/program management or software development OR equivalent experience. 5+ years people management experience. Track record of driving measurable business outcomes through product strategy. Experience in digital advertising (search, performance marketing, or programmatic). Ability to influence across executive, technical, and customer audiences. Solid analytical skills; data-driven decision maker. Passion for helping advertisers and partners succeed through AI-powered tools. Product Management M6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1894343",
    "title": "Data Center Inventory & Asset Technician",
    "locations": [
      "Cheyenne, Wyoming, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894343/",
    "required_qualifications_text": "High School Diploma AND 6 months experience or an internship in inventory management, retail, warehouse management, or a related field OR equivalent experience. Ability to work 12 hours shifts, including shift assignments during non-standard business hours that may include evening, weekends, and/or holidays. As indicated, in the job description, this role has a travel requirement of up to 25% which means you may be required to travel, from time to time, as part of this role. Background Check Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship Verification: This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport.",
    "preferred_qualifications_text": ": 1+ year(s) experience in warehouse/supply chain in an information technology (IT) environment, IT, and/or logistics, operating heavy-load movement equipment (e.g., forklift, pallet jacks, chassis lifts) for a large corporation OR equivalent experience. Materials Handling ATR-B - The",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1894659",
    "title": "Principal Applied Science Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894659/",
    "required_qualifications_text": "Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 8+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 5+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 3+ years of people management experience. 1 + years of experience with generative AI OR LLM / ML algorithms",
    "preferred_qualifications_text": ": Experience with MLOps Workflows, including CI/CD, monitoring, and retraining pipelines. Familiarity with modern LLMOps frameworks (e.g., LangChain , PromptFlow ) 5 + years of experience publishing in peer-reviewed venues or filing patents Experience presenting at conferences or industry events 5 + years of experience conducting research in academic or industry settings 3 + year of experience developing and deploying live production systems 3 + years of experience working with Generative AI models and ML stacks Applied Sciences M6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1880784",
    "title": "AI Lease Delivery Program Manager",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1880784/",
    "required_qualifications_text": ": Bachelor's Degree AND 4+ years experience in datacenter engineering, datacenter technical program management or datacenter development OR equivalent experience. 2+ years of experience managing cross-functional and/or cross-team projects. Background Check Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Bachelor's Degree AND 8+ years experience engineering, product/technical program management, data analysis, or product development OR equivalent experience. 6+ years of experience managing cross-functional and/or cross-team projects. 1+ year(s) of experience reading and/or writing code (e.g., sample documentation, product demos). 8+ years related experience in Construction, Project Management, Architecture, or related field. 3+ years experience working on data center projects. Technical Program Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1890855",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States + 5 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890855/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Experiences in building, evaluating and optimizing AI models, experience with Prompt and Context Engineering. Software engineering experience including building and maintaining large-scale web applications. Proficient with high quality Software design, development experience with effective problem solving, and debugging skills. Creative problem-solving & analytical skills to drive keen insights and identification of opportunities combined with a “sense of urgency” to develop solutions. Understanding and knowledge about big data and writing queries with Kusto/KQL. A proven track record of shipping high quality products or solutions Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1894633",
    "title": "Data Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894633/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 3+ years experience in business analytics, data science, software development, data modeling, or data engineering OR Bachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 5+ years experience in business analytics, data science, software development, data modeling, or data engineering OR equivalent experience. 1+ year(s) experience with data governance, data compliance and/or data security. Experience in developing tools and data pipelines processing very large volume data by using Apache Spark and Python or similar tools. Experience in data visualization tools like Power BI. Data Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1891083",
    "title": "Principal Hardware Engineer",
    "locations": [
      "Redmond, Washington, United States + 7 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891083/",
    "required_qualifications_text": ": Master's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, OR related field AND 7+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, OR related field AND 8+ years technical engineering experience OR equivalent experience. 5+ years of experience of technical leadership as a platform or software architect or validation architect or a lead debug engineer or equivalent industry experience leadership position. Deep understanding of modern server or datacenter architectures or System on Chip features like virtualization technologies or major architectural blocks like Memory Controllers or Central Processing Units or Storage or Networking solutions for Cloud or Datacenter infrastructures Experience leading technical deep dives into datacenter software solutions used in at scale environments or datacenter infrastructure and data systems, cloud native operating systems, or virtualization technologies.",
    "preferred_qualifications_text": ": Master's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, OR related field AND 7+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, OR related field AND 8+ years technical engineering experience OR equivalent experience. Platform or system level debug and validation experience Data analytical skills- Knowing how to use large scale data and analytical tools. Excellent communication skills using various forms of media. Able to plan work, and work to a plan adapting as necessary in a rapidly evolving Environment. Individual effectiveness skills such as discipline, time management, decision making, planning, and organizing work, summarizing results through technical reports Self-driven, self-motivated individual must be able work independently as well as collaboratively in a team environment and across the team of engineers. Hardware Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1892843",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892843/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Breadth of knowledge across industries and solution areas, with a focus across data services on Microsoft platforms (SQL Database, COSMOS, Databricks, Fabric, Synapse, Purview Data Governance) Proven track record with successful delivery and execution of specific cloud projects/programs. Business acumen and effective communication skills with executive audiences. Commitment to the growth mindset exemplified by continued learning and demonstrated willingness to stay abreast of cloud advancements, including relevant cloud trends across the competitive landscape. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1894487",
    "title": "Principal Business Manager - Datacenter Operations",
    "locations": [
      "Redmond, Washington, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894487/",
    "required_qualifications_text": ": Bachelor's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 8+ years’ experience in business management, business planning, operations management, strategy, project management, or business-related roles OR equivalent experience. 8+ years of experience in leadership positions, demonstrating the ability to work closely with senior leadership and promote collaboration among cross-functional teams . 8+ years business or program management experience working in a production, mission-critical 24/7 environment such as Data Center or other Critical Environments . Background Check Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Master's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 12+ years experience in financial management , business planning, operations management, strategy, project management, or business-related roles OR Bachelor's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 15+ years experience in financial management , business planning, operations management, strategy, project management, or business-related roles OR equivalent experience. B usiness acumen and u nderstan ding of the data center i nd ustry . E xecutive presence and proven ability to influence technical peers and senior leaders. Industry P roject management, data an alytics and organization skills. Effectiveness driving complex multi-stakeholder planning processes, driving cross-team programs to desired results. Experience collaborating across diverse groups t o drive clarity and effectiveness in rhythm of business and delivering projects on time. Proactiveness and a positive outlook and approach to change management. B usiness acumen and agility to ramp quickly across our diverse business and offerings. Effectiveness driving complex multi-stakeholder planning processes, driving cross-team programs to desired results. Ability to synthesize complex ideas into easy-to-understand concepts for communications. Demonstrated capability in verbal and written communications skills across a geographically dispersed audience. People management experience a plus, as the role is likely to grow as the organization grows. Business Management IC6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $277,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $303,600"
      }
    ]
  },
  {
    "job_id": "1894793",
    "title": "Research Intern - Computer Vision Algorithms",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894793/",
    "required_qualifications_text": "Currently enrolled in a PhD program in Mathematics, Computer Science, or a related STEM field.",
    "preferred_qualifications_text": "Demonstrated knowledge of probability theory and statistics at the advanced graduate level, in particular sampling and Bayesian methods. Proficient in Python or C++. Demonstrated ability to develop original an research agenda. Drive to publish the work in high-quality academic venues. The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,710 - $13,270"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,760 - $14,360"
      }
    ]
  },
  {
    "job_id": "1892939",
    "title": "Assistant General Counsel, Compliance & Ethics",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892939/",
    "required_qualifications_text": "Juris Doctor Degree or international equivalent degree AND 9+ years experience as a practicing attorney in regulatory compliance, privacy/security, sanctions/export/trade, or adjacent fields OR equivalent experience. Active license to practice law in a jurisdiction and capable of meeting admission requirements in relevant jurisdiction. Experience in translating regulatory requirements into governance and control testing programs and experience implementing governance and risk management processes to manage organizational risk. Experience with AI tools and their application to compliance processes and the ability to map controls to regulatory and business requirements in engineering and technical domains. Legal Counsel IC6 - The typical base pay range for this role across the U.S. is USD $160,700 - $284,400 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $207,700 - $311,500 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 17, 2025. #CELA\nRequired Qualifications\n• Juris Doctor Degree or international equivalent degree AND 9+ years experience as a practicing attorney in regulatory compliance, privacy/security, sanctions/export/trade, or adjacent fields OR equivalent experience.\n• Active license to practice law in a jurisdiction and capable of meeting admission requirements in relevant jurisdiction.\n• Experience in translating regulatory requirements into governance and control testing programs and experience implementing governance and risk management processes to manage organizational risk.\n• Experience with AI tools and their application to compliance processes and the ability to map controls to regulatory and business requirements in engineering and technical domains.\n• OR equivalent experience.\nLegal Counsel IC6 - The typical base pay range for this role across the U.S. is USD $160,700 - $284,400 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $207,700 - $311,500 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 17, 2025.\n#CELA",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $160,700 - $284,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $207,700 - $311,500"
      }
    ]
  },
  {
    "job_id": "1893707",
    "title": "Research Intern - Azure Research – Systems",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893707/",
    "required_qualifications_text": "(i) Currently enrolled in a master’s, or PhD program in Computer Science or related STEM field, OR (ii) Currently enrolled in a bachelor’s program in Computer Science or related STEM field and have at least 1 year of experience in conducting research, evidenced by a peer-reviewed publication (as a co-author).",
    "preferred_qualifications_text": "Demonstrated ability to develop original research agendas. Ablilty to collaborate effectively with other researchers and product development teams. Proficient interpersonal skills, cross-group, and cross-culture collaboration. Ability to think unconventionally to derive creative and innovative solutions. Applied Sciences IC2 - The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $5,610 - $11,010"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $7,270 - $12,030"
      },
      {
        "region": "U.S.",
        "range": "USD $6,710 - $13,270"
      }
    ]
  },
  {
    "job_id": "1892500",
    "title": "Senior Product Manager - AI",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892500/",
    "required_qualifications_text": ": Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience. 3+ years experience taking a user-facing product, feature, or experience to market (e.g., design, addressing product market fit, and launch, internal tool/framework). 4+ years experience improving product metrics for a product, feature, or experience in a market (e.g., growing customer base, expanding customer usage, avoiding customer churn).",
    "preferred_qualifications_text": ": Experience shipping AI-powered products or agents in production environments Deep understanding of LLMs, prompt engineering, RAG, grounding, and responsible AI principles. Experience designing conversational UX and multi-turn dialogue systems. Product Management IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885224",
    "title": "Software Engineer II",
    "locations": [
      "Mexico City, México, Mexico"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885224/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Exposure to Microsoft Azure or other cloud platforms (GCP, AWS). Familiarity with AI/ML fundamentals , tools (like Azure ML, OpenAI), or data analytics workflows. Understanding of version control systems (e.g., Git) and DevOps and CI/CD practices. Cloud Native Architecture, with solid understanding of cost management, Scalability and observability. Curiosity, collaboration mindset, and a passion for solving real-world customer problems.\nRequired/Minimum Qualifications\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• Programming skills in one or more languages: C#, Java, Python, JavaScript, C++.\n• 2+ years of experience with any of the following: SQL Server, Synapse, Azure Data Lake, Azure Data Factory, Databricks or similar technologies.\n• Business level fluency to read, write and speak English and Spanish.\n• OR equivalent experience.\nAdditional or Preferred Qualifications\n• Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• Exposure to Microsoft Azure or other cloud platforms (GCP, AWS).\n• Familiarity with AI/ML fundamentals , tools (like Azure ML, OpenAI), or data analytics workflows.\n• Understanding of version control systems (e.g., Git) and DevOps and CI/CD practices.\n• Cloud Native Architecture, with solid understanding of cost management, Scalability and observability.\n• Curiosity, collaboration mindset, and a passion for solving real-world customer problems.\n• OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1891419",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891419/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 8 years of experience in system software development with a proven track record of delivering complex system-level software. Experience working with SoC platforms, PCIe, or other hardware interfaces. Exposure to secure coding practices and system-level security concepts. Familiarity with CI/CD pipelines and automated testing frameworks. Contributions to open-source or internal platform libraries and tools. Proficient communication and leadership skills. Experience influencing architecture and long-term technical strategy. Track record of driving engineering excellence and innovation. Hands-on experience in Embedded Linux Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1893698",
    "title": "Account Manager - Microsoft Advertising",
    "locations": [
      "New York, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893698/",
    "required_qualifications_text": ": Master of Business Administration (MBA) Degree in Sales, Marketing, or related field and 2+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR Bachelor's Degree in Sales, Marketing, or related field and 4+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR 6+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) or equivalent experience. 1+ year of experience managing hands-on search advertising campaigns and other performance-based digital marketing campaigns.",
    "preferred_qualifications_text": ": Master of Business Administration (MBA) Degree in Sales, Marketing, or related field and 4+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR Bachelor's Degree in Sales, Marketing, or related field AND 5+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR 8+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR equivalent experience. 2+ years of experience managing hands-on search advertising campaigns and other performance-based digital marketing campaigns. 2+ years of experience in online media or Search Engine Marketing Sales and Service experience. Advertising Client Success IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $85,100 - $169,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $112,000 - $185,300"
      }
    ]
  },
  {
    "job_id": "1894531",
    "title": "Research Intern - Cloud Reliability & Efficiency",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894531/",
    "required_qualifications_text": "Currently enrolled or accepted in a PhD program in Computer Science, Software Engineering, Electrical Engineering, or a related STEM field. At least 1 year of experience in conducting research and authoring peer-reviewed publications.",
    "preferred_qualifications_text": "Experience with distributed systems, cloud infrastructure and software development. Proficient written and verbal communication skills. Able to work in a cross-functional and multi-disciplinary setting across research and product. Published in one of the following venues: OSDI, SOSP, ASPLOS, NSDI, EuroSys, ATC, SoCC, MLSys, ICSE, FSE, WebConf, etc. The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,710 - $13,270"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,760 - $14,360"
      }
    ]
  },
  {
    "job_id": "1883038",
    "title": "General LAB Support Hardware Engineer",
    "locations": [
      "Mountain View, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1883038/",
    "required_qualifications_text": "Master's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, or related field AND 3+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, or related field AND 5+ years technical engineering experience OR equivalent experience. 5+ years of experience in Technical operations related to Server System architecture that includes server functionality, network requirements and management, mechanical and electrical specification application, and software & firmware application in engineering labs or datacenter environments and/or data center operations.",
    "preferred_qualifications_text": "Experience with Rack and stack of servers and kit to cabinets. Physical installation and/or removal of equipment within the Data Center or Intermediary Data Facilities. Experience Liquid loop preparing and assembly Background with system level qualification, validation, I/O interconnect, PCIE high speed data switches. Solve and support projects (OU creation / Group Policy / MECM / Image builds / Maintenance Automation / Monitoring Automation, Debug and Solutions. Experience with VM manipulation and PowerShell scripting Experience with lab test equipment setups for signal measurement using oscilloscopes and the capability to read and interpret schematic diagrams. Good written and verbal communication & organization skills. Ability to work well independently and on a team. A collaborative spirit and a growth mindset. Customer and results oriented with attention to security, quality, safety, and details. Motivated to continuously learn and improve existing solutions. Hardware Engineering IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1890581",
    "title": "Partner Manager",
    "locations": [
      "New York, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890581/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master of Business Administration (MBA) Degree in Sales, Marketing, or related field AND 5+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR Bachelor's Degree in Sales, Marketing, or related field AND 7+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR 10+ years relevant work experience (e.g., sales, advertising, or marketing with a focus on digital advertising) OR equivalent experience. 4+ years’ experience in digital media sales/service with a focus on agencies. Understanding of the Agency buying landscape and media operations Experience in nurturing AdTech and data-driven partnerships alongside media activation. Experience with Demand side platform (DSPs) and/or Publisher side buying tools Advertising Client Success IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1892818",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892818/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python Or equivalent experience. 2 years of experience in designing and building scalable distributed full stack systems and cloud-native applications (AWS, Azure, or GCP). 2 years of experience working in agile, fast-paced environments, navigating ambiguity and facilitating impactful outcomes. 2 years of experience with modern frameworks and tools for APIs, microservices, and front-end development.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3 years leading or contributing to cross-functional engineering projects, with strong communication and collaboration skills across teams and stakeholders. 1+ years of applied AI/ML experience, such as building models, leveraging AI services, or applying automation. Experience with containerization and orchestration (Docker, Kubernetes), CI/CD pipelines, and DevOps practices. Knowledge of modern database systems (SQL, NoSQL, caching, streaming). Familiarity with modern front-end frameworks (React, Angular, or similar). Demonstrated ability to handle ambiguity, drive clarity, and prioritize effectively. Solid understanding of data structures, algorithms, and system design. Ability to independently drive projects from concept to delivery. Excellent communication skills and a collaborative mindset. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1878058",
    "title": "Principal Software Engineer - Azure Kubernetes Service",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1878058/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, Go, C#, Rust, or C/C++ OR equivalent experience. 4+ year(s) experience building, shipping, and operating reliable distributed solutions ( Demonstrated ability to design and maintain scalable systems across diverse environments) 4+ years of experience working with Kubernetes and Linux 2+ year(s) experience applying site-reliability engineering practices ( Ability to leverage artificial intelligence (AI) tools to enhance coding efficiency and system reliability) Other Qualifications: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, Go, C#, Rust, or C/C++ OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, Go, C#, Rust, or C/C++ OR equivalent experience. Software Engineering IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1889803",
    "title": "Senior Firmware Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889803/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with working from early concept of Architecture, designing, and delivering on new technologies across the entire platform. Experience working with multiple teams on Root cause analysis, troubleshooting, and debugging skills resulting into solving complex Hardware/Firmware interface issues. Experience with Platform initialization, Board support package integration, low level drivers for peripherals such as PCIe, I2C, eMMC, SPI, USB, UARTs as well as Memory Management, Scheduling, Interrupts and multi-threading.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. In-depth knowledge of hardware and firmware interfaces: OpenBMC , DMTF MCTP, Redfish, PLDM, SPDM, RAS, UEFI, Virtualization/SRIOV Experience working with High performance computing, GPU and AI accelerator integration into Data center Experience with Implementation of Hardware/Firmware Security primitives Experience with Windows and Linux Operating systems and kernel and application level. Passionate about coaching team members and helping them grow. Hands on experience in programming in Python and C/C++ Hands on experience in programming in Python and C/C++ Excellent problem-solving and analytical skills. Self-motivated and able to work independently with minimal supervision. Strong communication and collaboration skills, with the ability to work effectively in cross-functional teams. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1890935",
    "title": "Principal Engineer, Front-End Computer-Aided Design Software",
    "locations": [
      "Raleigh, North Carolina, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890935/",
    "required_qualifications_text": ": Doctorate in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 3+ years technical engineering experience OR Master's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 6+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 8+ years technical engineering experience OR equivalent experience. 3 years of advanced experience with common programming paradigms, including Object-Oriented and Functional programming. 3 years of leadership experience with a proven track record of leading small teams and influencing stakeholders. 3 years of experience writing software using industry-standard languages such as Python, TCL, Perl, and C/C++ (Python preferred). 3 years of experience defining software architecture for complex systems.",
    "preferred_qualifications_text": ": Doctorate in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 5+ years technical engineering experience OR Master's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 8+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 12+ years technical engineering experience OR equivalent experience. 1+ year(s) experience working on or leading projects from beginning-to-end. 5 years of experience in Software development. Understanding of software design patterns . Well -rounded and familiar with silicon design Tools, Flows and Methodologies. Experience with continuous integration systems. Expertise in Computer Architecture, as well as CPU/SoC design principles. Expertise in Azure environments, Azure Security and DevOps concepts Expertise to own, maintain and drive complex Software projects independently. Expertise in Software Development Best practices . Exposure to Design and Verification execution and flows/infra structure that is used Silicon Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1894578",
    "title": "Principal Data Scientist",
    "locations": [
      "New York, United States + 6 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894578/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 8+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 10+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 12+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. Enjoy travel and are comfortable with travel up to 25% Data Science IC4 - The",
    "other_requirements_text": "This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid U.S. passport. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1865066",
    "title": "Group Product Manager - CoreAI Infrastructure",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1865066/",
    "required_qualifications_text": ": Bachelor's Degree AND 8+ years experience in product/program management or software development OR equivalent experience. 1+ year(s) people management experience. 8+ years of experience designing and shipping complex products for developers, machine learning professionals, or similar 3+ years of experience with distributed platform ecosystem (multi-tenant / real-time processing, batch computing etc.) Proven experience in technical program management, preferably in AI infrastructure or cloud services. Experience with GPU fleet management, scheduling systems, and API lifecycle.",
    "preferred_qualifications_text": ": Experience creating solutions using Azure, AWS, or Google Cloud Experience writing Python, particularly for machine learning Experience with machine learning platforms Effective at driving complex multi-stakeholder processes and cross-team programs Ability to build effective relationships, influence and collaborate at all organizational levels Effective verbal and written communications skills for a global audience Proven business acumen, analytical and detail oriented Excellent communication and stakeholder management skills. Ability to navigate ambiguity and drive clarity across complex, cross-functional initiatives. Product Management M5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1889456",
    "title": "Applied Scientist - Copilot Pages and Notebooks",
    "locations": [
      "Cambridge, Massachusetts, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889456/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience. 2+ years experience in machine learning, deep learning, natural language processing, computer vision, and/or statistics. 2+ years experience in Python and familiarity with coding in multiple languages.",
    "preferred_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 5+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 2+ years experience creating publications (e.g., patents, libraries, peer-reviewed academic papers). Experience presenting at conferences or other events in the outside research/industry community as an invited speaker. 2+ years experience conducting research as part of a research program (in academic or industry settings). 1+ year(s) experience developing and deploying live production systems, as part of a product team. Applied Sciences IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1873839",
    "title": "Data Center Technician - CTJ - Poly",
    "locations": [
      "Fauquier County, Virginia, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1873839/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Associate's degree in Computer Science or related field and/or equivalent work experience AND 5+ years experience supporting IT equipment or related technology OR equivalent experience. 2+ years experience working in a production, mission-critical 24x7x365 datacenter environment. Applicable certifications: ASICS/Inventory Control, CompTIA (A+, Server+, Network+), Basic Structure Cabling (BSC), Data Center Foundation Certification (DCFC), Microsoft Certified Professional (MCP), Vendor-Specific Network Certifications. Data Center Technicians ATR-D - The",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Additional/",
    "pay_ranges": []
  },
  {
    "job_id": "1891458",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891458/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to TypeScript, C#, Java, JavaScript, or Python. OR equivalent experience. Experience in web development (front-end and/or back-end).",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, TypeScript, C#, Java, JavaScript, or Python. OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to TypeScript, C#, Java, JavaScript, or Python OR equivalent experience. Experience in web development, including JavaScript/TypeScript and web frameworks. Experience working on distributed systems and/or high-performance systems. Experience working with Large Language Models (LLM) APIs & integrations. Experience collaborating closely with customer teams. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1892838",
    "title": "Principal Technical Program Manager",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892838/",
    "required_qualifications_text": "Bachelor's Degree AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 3+ years of experience managing cross-functional and/or cross-team projects.",
    "preferred_qualifications_text": ": Proven collaboration and project management skills, combined with a strategic orientation, as well as an aptitude for solving complex problems. Previous experience managing strategic cross-functional initiatives. Ability to collaborate and influence effectively across a broad set of internal and external stakeholders Demonstrated proficiency in verbal and written communication Experience building and deploying solutions on Microsoft platforms (Azure, Power Platform, Fabric) Technical Program Management IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire / transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1894562",
    "title": "Digital Win Room Deal Strategist - Americas",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894562/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in a related field. 5+ years managing projects, including planning, managing timelines, and tracking progress, and/or change management experience. 5+ years experience working with sales organizations. 5+ years experience with proposals and sales pursuits. 5+ years of sales experience supporting cloud solutions for customers, and deep understanding of account planning and execution 5+ years experience with solid understanding of the sales process and organizations 5+ years of commercial business experience. Familiarity with Microsoft-specific processes and Sales frameworks (e.g., MCEM), with the ability to navigate and apply them effectively in dynamic environments. Demonstrated success leading virtual teams; experience in people management is welcomed. Skilled in executive-level communication (both verbal and written), with a track record of partnering with senior leadership and translating complex business scenarios into actionable insights. Adept at guiding cross-functional teams—including account, services, sales, and area leadership—through opportunity development, solution planning, offer creation, and growth acceleration. Proficient in leveraging data and insights to inform decisions and drive meaningful outcomes. Known for cultivating trusted relationships with senior leaders and contributing to the advancement of strategic initiatives. Sales Excellence IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1889378",
    "title": "Sourcing and Category Manager",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889378/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Proven cross-functional team facilitation experience preferred. Experience working successfully with international businesses and understanding the intricacies and nuances of various cultures and countries. Analytical and strategic problem-solving capabilities in finance and business subjects. Proficient communication and presentation skills. Sourcing and Category Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1892032",
    "title": "Principal Software Engineer - Azure Core",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892032/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ year(s) experience bootstrapping and managing data center (DC) infrastructure , including device inventory, diagnosis, and repairs. Bare-metal provisioning using Preboot Execution Environment (PXE), iPXE, Redfish, Open Baseboard Management Controller (OpenBMC), Intelligent Platform Management Interface (IPMI), and Simple Network Management Protocol (SNMP). Networking and security expertise in high-performance networking technologies such as NVIDIA Collective Communications Library (NCCL), InfiniBand Extensions for Scalable High-Performance Computing (IMEX), Remote Direct Memory Access (RDMA) over InfiniBand or RDMA over Converged Ethernet version 2 (RoCEv2), and Extended Berkeley Packet Filter (eBPF). Driver and firmware lifecycle management, including Graphics Processing Unit (GPU) diagnostics. 1+ year(s) experience with storage and acceleration technologies for Artificial Intelligence (AI) workloads, including distributed storage systems for multi-exabyte AI workloads, high-throughput data pipelines, preprocessing, and dataset versioning. Data Processing Unit (DPU) acceleration. Linux and GPU internals expertise for performance optimization and troubleshooting. Kernel-level performance tuning, including Non-Uniform Memory Access (NUMA) awareness, Interrupt Request (IRQ) balancing, and control group (cgroup) tuning for GPUs.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ year(s) experience with Artificial Intelligence (AI) and Machine Learning (ML) job scheduling and orchestration at scale, using technologies such as Simple Linux Utility for Resource Management (SLURM), Ray, and Kueue. Model training optimization for performance and scalability. 1+ year(s) experience improving model serving and inference efficiency, ensuring low latency and high throughput for production workloads. Software Engineering IC6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1836149",
    "title": "Surface Category Manger",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1836149/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "4+ years category management, product management, marketing strategy, business planning, product planning, or related work experience AND Bachelor's Degree in Business, Marketing, Communications, Economics, Public Relations, Engineering, or related field OR equivalent experience. Consumer Electronics/IT ecosystem experience with a focus on devices and services sales across consumer segments Experience with Portfolio LifeCycle Management to drive Launch, Sustain Momentum and effectively EOL products. Category Management IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $85,100 - $169,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $112,000 - $185,300"
      }
    ]
  },
  {
    "job_id": "1885462",
    "title": "Back-End Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885462/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. OR equivalent experience. 2+ years of experience designing, building, and operating scalable, highly available cloud services or distributed systems on platforms such as Azure, AWS, GCP, or comparable cloud environments, with production ownership and CI/CD pipeline integration.​ 2+ years of experience building systems with emphasis on reliability, durability, and operational efficiency, including experience with live site operations, incident response, and performance 2+ years of experience programming in modern back-end languages such as C#, Java, Go, or Python.​",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with API development frameworks such as OData, GraphQL, gRPC. Experience with designing, building, or maintaining large-scale telemetry pipelines for cloud services or APIs Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1891556",
    "title": "Head of Affiliate Marketing, Minecraft",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891556/",
    "required_qualifications_text": ": Bachelor's Degree in Business, Marketing, Business Development, Business Management, Communications, or related field AND 5+ years sales, marketing, or business development experience OR equivalent experience. 5+ years of experience in affiliate marketing setting strategy and driving implementation for affiliate programs. 3+ years of experience collaborating directly with influencers, engaging with a diverse range of audiences from grassroots to celebrities or similar groups. Experience working with executive leadership.",
    "preferred_qualifications_text": ": Master's Degree in Business Administration, or related field AND 4+ years in Affiliate Marketing OR Bachelor's Degree in Business, Marketing, Business Development, Business Management, Communications, or related field AND 6+ years in Affiliate Marketing OR equivalent experience. Knowledge of Minecraft; and understanding of the Minecraft community and franchise. Experience working with global brands and practical experience creating both global and regional strategies. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1894599",
    "title": "Research Intern - Precision Health Innovation Market Analyst",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894599/",
    "required_qualifications_text": "Currently pursuing a PhD in Business Administration, Strategic Management, Economics, or a related field. At least one additional quarter/semester of school remaining following the completion of the internship.",
    "preferred_qualifications_text": "Bachelor’s Degree in Business, Economics, Pharmacy, Biology/Biotechnology, Biomedical Sciences, Health Sciences, or related field. Experience in marketing, strategy, business planning, management consulting, finance, and/or economics. Experience in Clinical Development in Life Sciences. The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $5,610 - $11,010"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $7,270 - $12,030"
      }
    ]
  },
  {
    "job_id": "1832306",
    "title": "Data Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1832306/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 2+ years experience in business analytics, data science, software development, data modeling or data engineering work OR Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 1+ year(s) experience in business analytics, data science, software development, or data engineering work OR equivalent experience. 1+ year (s) of experience building generative AI applications.",
    "preferred_qualifications_text": ": 2+ years of experience contributing to the design and implementation of model finetuning pipelines (e.g., LoRA, domain/task-specific adaptation) for customer and product scenarios. 2+ years of applying transformer architectures and reinforcement learning techniques to improve finetuned models for reasoning, search, and generation tasks. 2+ years contributing to research publications (e.g., patents, libraries, or academic papers) and beginning to share work externally through conferences or industry events. Deep expertise in designing and scaling Generative AI pipelines (e.g., RAG systems, domain/task-specific finetuning ) Data Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1894536",
    "title": "Solution Area Specialist - AI Business Process",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894536/",
    "required_qualifications_text": "2+ years of experience in technology-related sales or account management AND a Bachelor's Degree in Computer Science, Information Technology, Business Administration, Information Security, or related field OR equivalent experience 2+ years of experience selling AI Business Process applications to enterprise customers 2+ years of experience forecasting, developing demand and building pipeline, and leading/orchestrating complex, matrixed teams.",
    "preferred_qualifications_text": "Bachelor's Degree in Computer Science, Information Technology, Business Administration, Information Security, or related field AND 8+ years experience in technology-related sales or account management OR a Master's Degree in Business Administration (i.e., MBA), Information Technology, Information Security, or related field AND 6+ years experience in technology-related sales or account management OR equivalent experience 4+ years solution or services sales experience Experience with selling CRM and/or ERP applications including Marketing Automation, Sales Automation, Relationship Sales, Customer Service, Field Service, Finance, Supply Chain Management and Commerce and an understanding of how they translate into business impact and value Broad understanding of commercial cloud offerings, ideally including Microsoft’s cloud platform, as well as competitors and related ecosystems. Industry expertise in any of the following: Financial Services, Healthcare, Retail, Manufacturing & Mobility, High-Tech, Automotive, Oil/Gas/Energy, Professional Services, Telco/Media/Gaming, and/or SLED. Solution Area Specialists IC3 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role’s job duties.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $87,000 - $148,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $113,400 - $164,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $107,600 - $187,500"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $145,600 - $205,600"
      }
    ]
  },
  {
    "job_id": "1888070",
    "title": "Senior Product Marketing Manager – AI Customer User Experience (UX)",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1888070/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing , Computer Science, Business or related field AND 6+ years experience in business OR Bachelor's Degree in Marketing , Computer Science, Business or related field AND 8+ years experience in business OR equivalent experience. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1891536",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891536/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years experience writing applications using a web service-related programming language (examples include C#, ASP.net, or ReactJS)",
    "preferred_qualifications_text": ": 3+ years of experience designing, developing, and delivering production-grade APIs and SaaS solutions. Experience in building cloud-native architectures leveraging platforms such as Azure Service Fabric and Azure Kubernetes Service (AKS).\nRequired Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C#, Java, JavaScript, or Python OR equivalent experience.\n• 2+ years experience writing applications using a web service-related programming language (examples include C#, ASP.net, or ReactJS)\n• OR equivalent experience.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications:\n• 3+ years of experience designing, developing, and delivering production-grade APIs and SaaS solutions.\n• Experience in building cloud-native architectures leveraging platforms such as Azure Service Fabric and Azure Kubernetes Service (AKS).",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1892824",
    "title": "Principal Data Scientist",
    "locations": [
      "Mountain View, California, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892824/",
    "required_qualifications_text": ": Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 7+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 10+ years data science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. Experience in SQL-like query languages. Experience in design & problem-solving skills with one or more programming languages, such as Python, Java, C# or C++.",
    "preferred_qualifications_text": ": Familiarity with online A/B experimentation. Familiarity with large-scale online products, dealing with online instrumentation. Experience with large datasets and interest in consumer online search behaviors. Ability to work independently, influence others, and solid communication and collaboration skills. Data Science IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1875977",
    "title": "Software Engineer II - CTJ - Poly",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1875977/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Preferred/Additional Qualifications: 4+ years of experience with PowerShell, C#, Python, Go or C++. Experience working on large-scale distributed services with on-call responsibilities. Ability to build and influence broadly towards common goals and priorities. Ownership of end-to-end project lifecycle with solid project management skills. Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 19, 2025 #Silver\nRequired/Minimum Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination.\n• Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n• Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nPreferred/Additional Qualifications:\n• 4+ years of experience with PowerShell, C#, Python, Go or C++.\n• Experience working on large-scale distributed services with on-call responsibilities.\n• Ability to build and influence broadly towards common goals and priorities.\n• Ownership of end-to-end project lifecycle with solid project management skills.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 19, 2025\n#Silver",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1891772",
    "title": "Executive Business Administrator - Global SMB",
    "locations": [
      "New York, United States + 5 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891772/",
    "required_qualifications_text": "5+ years Administrative, Business Support, or customer service experience in an environment with an emphasis on scheduling meetings/events, travel management, and administration work for executive/ upper-level management. Proven expertise in managing complex calendars, including scheduling meetings, coordinating events, and resolving conflicts across multiple time zones and stakeholders Ability to come into the office if needed for events/meetings, specifics to be agreed upon with your manager . Fluent in English and Spanish",
    "preferred_qualifications_text": "Bachelor's Degree in relevant field (e.g., Business Administration, Human Resources [HR], Marketing, Communications, Psychology, Sociology) OR equivalent experience. 2+ years' experience reviewing and managing administrative budgets (e.g., for events, morale, travel, training). Experience managing sensitive and/or confidential information with discretion, professionalism and integrity. Experience in collaborating with cross-functional teams, including Executives, Executive Business Administrators, and key business partners. Prior Microsoft experience preferred. Business Support ATR-D - The",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1878975",
    "title": "Account Executive - Digital Natives",
    "locations": [
      "San Francisco, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1878975/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration AND 6+ years experience working in an industry (e.g., B2B SaaS, Startups, Venture) , driving digital transformation, or other relevant work experience (e.g., consulting, technology) OR Bachelor's Degree in Business, Technology, or related field AND 8+ years experience working in an industry (e.g., B2B SaaS, Startups, Venture) , driving digital transformation, or other relevant work experience (e.g., consulting, technology) OR equivalent experience. 3+ years of technology-related sales or account management experience (e.g., B2B SaaS, Startups, Venture) Account Management IC4 - The",
    "other_requirements_text": ": Microsoft is unable to sponsor a work visa for this role due to the nature of the role’s job duties. Additional/",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $107,600 - $187,500"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $145,600 - $205,600"
      }
    ]
  },
  {
    "job_id": "1893344",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893344/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Broad experience and track record of working across teams to deliver shared solutions to complex problems. Experience designing, implementing, and shipping cloud services or software products.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master’s Degree in computer science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. OR equivalent experience. Have hands-on experience with ASP.NET, Docker containers, and deploying applications using Kubernetes, particularly Azure Kubernetes Service (AKS). Passion for and ability to quickly understand emerging technologies. Effective communication and collaboration skills. Self-motivated, proactive, and results-oriented. Ability to quickly ramp up, understand complex problems, and create solutions across many products. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1891629",
    "title": "Software Engineer II-Xbox-Front-End",
    "locations": [
      "Multiple Locations, Chile + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891629/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience shipping cross-platform applications using React.js and Typescript Technical knowledge of challenges specific to the gaming space, including: o Responsive UX design across various device form factors. o Navigational input methods such as gamepad, touch, and mouse/keyboard. #XBOXLATAMJOBS #XBOX\nRequired:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• Hands-on experience as a Front-End Engineer developing modern applications using React and TypeScript.\n• Solid understanding of asynchronous programming and state management in frontend applications.\n• Experience integrating cloud services and working with deployment pipelines (Azure preferred).\n• A solid interest in delivering compelling end-user experiences for a gaming audience, with an understanding of their unique needs.\nPreferred qualifications:\n• Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• Experience shipping cross-platform applications using React.js and Typescript\n• Technical knowledge of challenges specific to the gaming space, including:\no Responsive UX design across various device form factors.\no Navigational input methods such as gamepad, touch, and mouse/keyboard.\n#XBOXLATAMJOBS #XBOX",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1879866",
    "title": "Product Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1879866/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Product Management IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 17, 2025. #azdat #azuredata ​ ​ #azuredata #datawarehousing #analytics ​\nRequired /Minimum Qualifications\n• Bachelor’s Degree AND 2+ years experience in product/service/project/program management or software development OR equivalent experience.\n• 1+ years experience in customer and market analysis using both quantitative and qualitative methods.\n• OR equivalent experience.\n​\nPreferred/Additional Qualifications\n• ​ ​ Bachelor's Degree AND 7+ years of experience in product/service/project/program management or software development OR equivalent experience. ​\n• Demonstrated knowledge of product led growth\n• Experience using customer telementry data to drive product decisions.\n• Experience working a product management team that has weekly release cycles.\n• OR equivalent experience. ​\nOther Requirements\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\n• This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nProduct Management IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft will accept applications for the role until October 17, 2025.\n#azdat\n#azuredata\n​ ​ #azuredata #datawarehousing #analytics ​",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1882818",
    "title": "Incident Response Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882818/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, Information Technology (IT), or related field AND 1+ years of technical support, technical consulting experience, or information technology experience OR 3+ years of technical support, technical consulting experience, or information technology experience OR equivalent experience. Minimum 2+ years Security Incident Response experience with recent operational security experience (SOC, Malware Analysis, IDS/IPS Analysis, threat analytics, windows server, and endpoint security, etc.) Minimum 1+ years of experience in Network Security Administration, and/or Systems Administration with experience in Windows Server, Windows Client, and Active Directory Administration Minimum 1+ years customer facing experience Experience supporting large and complex geographically distributed enterprise environments with 1000+ users OR equivalent experience",
    "preferred_qualifications_text": ": Cloud experience with any of the major cloud providers, including cloud security, networking, and migration of multi-cloud or hybrid deployments Automation (PowerShell and/or Python, or a similar language, can be a beginner to intermediate level). Experience in Azure Identity management and troubleshooting Preferred Bachelor’s degree or higher in a technical field, or relevant work experience Preferred IT Industry certifications (Microsoft Certifications On-Prem or Cloud, SANS GCIH, CISSP, CEH, Amazon AWS, etc.) Technical Support Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and / or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire / transfer and every two years thereafter. This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $68,300 - $137,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $93,200 - $151,200"
      }
    ]
  },
  {
    "job_id": "1844313",
    "title": "Azure Advanced Cloud Engineer 2 – Customer Focus",
    "locations": [
      "Redmond, Washington, United States + 7 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1844313/",
    "required_qualifications_text": ": Bachelor's Degree Engineering, Computer Science, Information Technology (IT), Data Analytics/Science, Artificial Intelligence (AI), or related field AND 2+ years experience in technology industry, cloud, technical support, and/or customer experience engineering OR equivalent experience. 2+ years of demonstrated experience supporting and troubleshooting enterprise level, mission-critical applications and infrastructure resolving complex issues/situations and driving technical resolution across cross-functional organizations. 1+ years of Experience with being on-call and driving mitigation for mission critical incidents.",
    "preferred_qualifications_text": ": Technical Skills: Demonstrated hands-on experience with expertise in one or more of the following Cloud technologies: Core IaaS: Compute (Windows/Linux), Storage, Networking, Kubernetes, High Availability Data Platform and Bigdata: Azure SQL DB, Cosmos DB, PostgreSQL on Azure, Azure Data Bricks, Azure Data Factory, AI/ML Azure PaaS Services: App Services, Azure Functions, Redis Cache, and Event Hub. Monitoring technologies: Azure Monitor, Log Analytics, Grafana, Datadog, Confluent and similar technologies. Communication skills: ability to empathize with customers and convey confidence. Able to explain highly technical issues to varied audiences. Able to prioritize and advocate customer’s needs to the proper channels. Take ownership and work towards a resolution. Customer Obsession: Passion for customers and focus on delivering the right customer experience. Growth Mindset: Openness and ability to learn new skills and technologies in a fast-paced environment. Customer Experience Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1894586",
    "title": "Solution Area Specialist - Workforce AI",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894586/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science, Information Technology, Business Administration, Information Security, or related field AND 2+ years of experience in technology-related sales or account management OR equivalent experience. 2+ years of experience forecasting, developing demand and building pipeline, and leading/orchestrating complex, matrixed teams. 1+ year of experience with Generative and Agentic AI",
    "preferred_qualifications_text": "Master's Degree in Business Administration (i.e., MBA), Information Technology, Information Security, or related field AND 6+ years experience in technology-related sales or account management OR Bachelor's Degree in Computer Science, Information Technology, Business Administration, Information Security, or related field AND 8+ years experience in technology-related sales or account management OR equivalent experience. 4+ years solution or services sales experience. Experience with Microsoft Copilot and/or Generative AI Technologie s Familiarity with AI/ML concepts and Copilot architecture Experience building AI Agents Strong communication and customer engagement skills Solution Area Specialists IC3 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role’s job duties.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $87,000 - $148,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $113,400 - $164,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $107,600 - $187,500"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $145,600 - $205,600"
      }
    ]
  },
  {
    "job_id": "1894642",
    "title": "Senior Investigator",
    "locations": [
      "Mountain View, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894642/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Business, Accounting, Criminal Justice, Law, International Relations or related field AND 8+ years experience in compliance, cyber, finance, data-analytics, investigations, or related field OR equivalent experience. Deep knowledge and experience in behavioral sciences, threat assessment, targeted violence and related physical security/safety risk. Certified Threat Manager (CTM), Professional Certified Investigator (PCI) and/or Certified Protection Professional (CPP) Proficient in the use of technology, computers (hardware, operating systems, networks), and software at a power user level (M365, Outlook, Excel, Word, Powerpoint, Access/SQL, PowerBI, SharePoint, Copilot, etc.). Possess or able to accomplish a US government security clearance. Investigations IC4 - The",
    "other_requirements_text": ": Citizenship& Citizenship Verification:This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1894505",
    "title": "Research Intern - AI Agents & Reasoning",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894505/",
    "required_qualifications_text": "Currently enrolled or accepted in a PhD program in Computer Science, Software Engineering, Electrical Engineering, or a related STEM field. At least 1 year of experience in conducting research and authoring peer-reviewed publications.",
    "preferred_qualifications_text": "Experience in machine learning, natural language processing, or related AI areas (e.g., LLMs, AI agents, Reasoning). Hands-on experience with one or more topics: large language model fine-tuning, reinforcement learning, prompt engineering, agent memory architectures, planning and reasoning modules, or multi-agent system design and implementation. Strong written and verbal communication skills. Ability to collaborate effectively in cross-functional, multi-disciplinary teams across research and product groups. Research contributions demonstrated through publications in top venues such as NeurIPS, ICML, ICLR, ACL, EMNLP, NAACL, AAAI, IJCAI, KDD or related conferences. The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,710 - $13,270"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,760 - $14,360"
      }
    ]
  },
  {
    "job_id": "1887734",
    "title": "Regional Datacenter Business Operations Program Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887734/",
    "required_qualifications_text": ": High School Qualification or equivalent AND 3+ years experience supporting IT equipment or related technology or delivering server and network deployment projects in large-scale environments OR equivalent experience. 3+ years equivalent experience providing business support in a 24x7x365 production environment. 3+ years experience in the development of tools and apps utilizing Power Apps, Power BI, Power Automate, Azure DevOps, SharePoint, Dynamics OR equivalent experience. Background Check Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": "Bachelor's or Technical College Degree in Computer Science, Math, Telecommunications, Electrical/Mechanical Engineering, Supply Chain Management or related field AND 8+ years experience in critical environment infrastructures (e.g., UPS, Generator, AHU), or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling) OR High School Qualification or equivalent AND 10+ years experience in critical environment infrastructures (e.g., UPS, Generator, AHU), or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling) OR equivalent experience. Applicable certifications: APICS/Inventory Control, CompTIA, Microsoft, Network Certifications, CCNA Certifications, ITIL v3 Foundation, Microsoft Operations Framework (MOF) Certifications. 6+ years of relevant finance, planning or analysis work experiences with a strong analytical foundation. Knowledge or background supporting AI PowerPoint, Excel, PBI and tools skills Data Center Operations Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $102,600 - $202,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,500 - $225,800"
      }
    ]
  },
  {
    "job_id": "1890338",
    "title": "Senior Product Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890338/",
    "required_qualifications_text": ": Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience. 5+ years of product management experience, overseeing successful product launches by effectively meeting market demands and business objectives. Key skills include strategic planning, cross-functional collaboration, and data-driven product lifecycle management. 2+ years of experience designing and delivering Cloud and SaaS products.",
    "preferred_qualifications_text": ": 3+ years experience developing cross-platform frameworks compatible with Windows, macOS, iOS, Android, and Linux. Proven experience in operating systems, software, and similarly complex technical fields. Proactive approach to ambiguity with an agile mindset. #W+DJOBS #WindowsCloud #Windows365 #CloudPC\nRequired Qualifications:\n• Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience.\n• 5+ years of product management experience, overseeing successful product launches by effectively meeting market demands and business objectives. Key skills include strategic planning, cross-functional collaboration, and data-driven product lifecycle management.\n• 2+ years of experience designing and delivering Cloud and SaaS products.\n• OR equivalent experience.\nOther Requirements :\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications :\n• 3+ years experience developing cross-platform frameworks compatible with Windows, macOS, iOS, Android, and Linux.\n• Proven experience in operating systems, software, and similarly complex technical fields.\n• Proactive approach to ambiguity with an agile mindset.\n#W+DJOBS\n#WindowsCloud\n#Windows365\n#CloudPC",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1888066",
    "title": "Senior Product Marketing Manager - AI Campaign & Customer Orchestration",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1888066/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing , Computer Science, Business or related field AND 6+ years experience in business OR Bachelor's Degree in Marketing , Computer Science, Business or related field AND 8+ years experience in business OR equivalent experience. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1882316",
    "title": "Senior Designer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882316/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "(PQs) Master's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 4+ years experience working in product or service design OR Bachelor's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 5+ years experience working in product or service design OR equivalent experience (e.g., demonstrated experience working in product or service design or using design thinking to solve problems). 6+ years experience shipping products, services, or games and/or delivering to customers as a result of an end-to-end design process Enjoy travel and are comfortable with travel up to 25% Product Design IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1886996",
    "title": "Chief of Staff",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 10, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1886996/",
    "required_qualifications_text": ": Bachelor's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 8+ years experience in financial management , business planning, operations management, strategy, project management, human resources, or business-related roles OR equivalent experience. 1+ year(s) experience leveraging operational and project management expertise to lead complex initiatives and deliver measurable process improvements. 1+ year(s) experience applying analytical skills to interpret data and deliver actionable insights, while effectively influencing stakeholders, building strong relationships, and upholding the highest standards of integrity and professionalism.",
    "preferred_qualifications_text": ": Bachelor's Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 10+ years experience in financial management, business planning, operations management, strategy, project management, human resources, or business-related roles OR Master’s Degree in relevant field (e.g., Liberal Arts, Business Administration, Management, Computer Science) AND 7+ years experience in financial management, business planning, operations management, strategy, project management, human resources, or business-related roles. OR equivalent experience. Experience as a Chief of Staff or Group Program Manager (GPM) within a software engineering organization. 1+ year(s) experience influencing, motivating, negotiating, collaborating, and partnering with stakeholders across all levels of authority and leadership Demonstrated ability to build trusted relationships and drive alignment in complex organizational structures. 1+ year(s) experience operating in fast-paced, highly matrixed, and ambiguous business environments Competent analytical, financial, and communication skills with the ability to influence teams without direct management authority. Business Management IC6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $277,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $303,600"
      }
    ]
  }
]