[
  {
    "job_id": "1897187",
    "title": "Senior Privacy Manager",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897187/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Juris Doctor (JD) Degree AND 7+ years experience in privacy, data protection, or compliance, with a focus on advertising technology or marketing, or related field AND 8+ years experience in privacy, data protection, or compliance, with a focus on advertising technology or marketing OR Bachelor's Degree in Science, Business, Engineering, or related field AND 12+ years experience in privacy, data protection, or compliance, with a focus on advertising technology or marketing OR equivalent experience. Relevant Privacy Certification from International Association of Privacy Professionals [IAPP]. Experience working with or within ad tech platforms, publishers, or agencies. Experience in the digital advertising ecosystem, including first-party and third-party data flows, real-time bidding (RTB), and identity frameworks. Compliance IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $116,900 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $148,400 - $222,600"
      }
    ]
  },
  {
    "job_id": "1894225",
    "title": "Strategic Account Technology Strategist",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894225/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Computer Science, Information Technology, Engineering, Business or related field AND 14+ years technical consulting, technical consultative selling, practice building, or related technical/sales/industry experience OR equivalent experience. 7+ years experience in digital transformation or using technology to drive customer business outcomes. 4+ years experience in business consulting, consultative selling, or change management. 5+ years experience leading technical, support, and/or partner teams. Strategic Account Technology IC5 - The",
    "other_requirements_text": "This position is not eligible for visa sponsorship. Candidates must have authorization to work in the United States that does not now or in the future require employer sponsorship. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1893696",
    "title": "Business Program Manager-Programs",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893696/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business, Operations, Finance, or related field AND 6+ years experience in program management, process management, or process improvement OR Bachelor's Degree in Business, Operations, Finance, or related field AND 8+ years experience in program management, process management, or process improvement OR equivalent experience. Proven track record in complex program management, change management, and delivering business value. In-depth understanding of Microsoft's strategy, products, services, and culture Strong analytical, creative problem solver with entrepreneurial approach. Thrives in ambiguity, excels in prioritization Confident, influential, builds strong relationships with senior managers Skilled in cross-group collaboration, exceptional negotiation, communication, and conflict-resolution abilities and experience in process optimization and understanding desired business outcomes Strong command of the personal computer ( PC) business and Microsoft’s partner ecosystem, with deep insight into operational and strategic processes. Proven success leading initiatives across the PC business, delivering measurable impact through program execution. Extensive experience collaborating with OEMs and device partners, driving alignment and execution across global engagements. Expertise in Windows business operations, with hands-on knowledge of product lifecycles, technical programs, and business priorities. Business Program Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1889041",
    "title": "Senior Finance Manager - AI Business Solutions Revenue Planning Team",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889041/",
    "required_qualifications_text": "Master's Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 2+ years experience in financial analysis, accounting, controllership or finance, or related field OR Bachelor's Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 4+ years experience in financial analysis, accounting, controllership or finance, or related field. OR equivalent experience. 2+ years of experience in Microsoft Excel and the ability to synthesize insights from large datasets.",
    "preferred_qualifications_text": "Masters Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 6+ years of post-graduate financial analysis, accounting, controllership, or finance work experience OR Bachelor's degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 8+ years of post-graduate financial analysis, accounting, controllership or finance work experience OR equivalent experience. Analytical and critical thinking skills with proven expertise in financial modeling. Ability to synthesize complex data and scenarios into actionable insights and compelling business cases. Detail-oriented with the ability to zoom out and drive big-picture strategy when needed. Self-motivated, adaptable to ambiguity, skilled at prioritization across multiple concurrent workstreams. Confident communicator who tailors messaging to diverse audiences, including leadership. Financial Analysis IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1893898",
    "title": "Principal Platform Architect",
    "locations": [
      "Redmond, Washington, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893898/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Server PCBA design experience including schematic, layout, routing, power, and signal integrity Experience deploying systems at scale as part of a cloud service provider or hyper-scale company Demonstrated expertise in balancing challenging electrical designs with complex mechanical and thermal tradeoffs of system design Knowledge of leading processor/memory technologies and industry standards, such as DC-MHS Demonstrated expertise with high speed signaling and interconnects including PCIe/CXL Hardware Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1891076",
    "title": "Software Engineer II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891076/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. At least one year experience with distributed systems or cloud services.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience in distributed systems and database internals. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1886872",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1886872/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred/Additional Qualifications: Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 20, 2025. #MSFTSecurity #MSCareerEvents25\nRequired/Minimum Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• 4+ years of experience in designing and developing distributed systems\n• OR equivalent experience.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications:\n• Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• OR Bachelor's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 20, 2025.\n#MSFTSecurity #MSCareerEvents25",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1860294",
    "title": "Senior Product Designer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1860294/",
    "required_qualifications_text": ": Master's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 4+ years experience working in product or service design OR Bachelor's Degree in Industrial Design, Product Design, Human Computer Interaction, User Experience, Interaction Design, or related field AND 5+ years experience working in product or service design OR equivalent experience. 4+ years experience in a variety of design tools (especially Figma) and processes such as journey mapping and design sprints/workshops. 4+ years hands-on experience creating detailed wireframes (both low and high fidelity), polished design prototypes and other design artifacts in a fast-paced, cutting-edge technology environment.",
    "preferred_qualifications_text": ": Awareness of inclusive design and how it supports Microsoft’s mission. Comfortable with ambiguity, design tradeoffs and shifting priorities. Creative and holistic problem solver with a sharp eye for details . Creating and applying established design principles and interaction patterns. Experience using design components and pattern libraries. Demonstrated breadth across interaction design, information architecture, usability Excellent interpersonal communication and visual storytelling skills Able to scope and estimate efforts accurately and prioritize workload independently Experience with in the Security domain. Experience designing for Artificial Intelligence. Understanding of Large Language Model (LLM). Product Design IC4 - The",
    "other_requirements_text": ": The ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1894557",
    "title": "Cloud Solution Architect Manager - AI Business Process",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894557/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1893435",
    "title": "Software Engineer - Azure Messaging -CTJ - TS/SCI",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893435/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC3 - The",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Candidates must have an active TS/SCI and be willing to upgrade to TS/SCI (with polygraph). This role will require candidates to maintain the TS/SCI (with polygraph) clearance. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1843939",
    "title": "Senior Software Engineer - Azure Kubernetes Service (AKS)",
    "locations": [
      "Multiple Locations, United States + 7 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1843939/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, Go or Bash OR equivalent experience. 2+ years of experience with at least 2 of the following: Linux or similar Unix-like environments used on servers containers, Kubernetes, or other Cloud Native technologies Azure or other cloud management technologies",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, Go or Bash OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, Go or Bash OR equivalent experience. 1+ year(s) of experience with Continuous Integration/Continuous Deployment (CI/CD) tools and processes, such as Azure DevOps, GitHub, or GitLab 1+ year(s) of experience collaborating on, building, and maintaining medium to large-scale software programs actively developed by multiple engineers Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1892756",
    "title": "Senior Data Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892756/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 8+ years experience in business analytics, data science, software development, data modeling or data engineering work OR Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 6+ years of business analytics, data science, software development, data modeling or data engineering work experience OR equivalent experience. 2+ years of experience managing execution through vendor teams. Previous experience in digital media, marketing, adobe suite of products, web analytics, or any in-house Microsoft data platforms is a plus. Demonstrated ability to work independently across organization partnering with technical and non-technical audience, comfortable making tough decisions based on qualitative and quantitative inputs. Data Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $117,200 - $229,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $153,600 - $250,200"
      }
    ]
  },
  {
    "job_id": "1891781",
    "title": "Senior Business Planner",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891781/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "8+ years product management, strategy consulting, finance, business/corporate development, or related experience AND Bachelor's Degree in Engineering/Computer Science, Economics, Business, or related field OR 6+ years product management, strategy consulting, finance, business/corporate development, or related experience AND Master's Degree in Business Administration (MBA), or related field OR equivalent experience. Effective structuring and framing skills. Proven ability to create and articulate a strategy, influence others, and drive planning. Demonstrated strategic thinking, analytical and problem-solving skills Strategic communication and collaboration skills and adaptability. Proven experience in storytelling and executive level presentations. Passion for technology and dynamic work environment. Excited about delivering significant business impact. Business Planning IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1896830",
    "title": "Principal Product Manager",
    "locations": [
      "Mountain View, California, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896830/",
    "required_qualifications_text": ": Bachelor's Degree AND 10+ years experience in product/service/program management or software development OR equivalent experience. 2+ years experience leading cross functional product teams across advertising, privacy, search, conversational AI, or generative AI 5+ years experience delivering products that include full Search and/or Advertising technology stack 5+ years experience with data analytics and experimentation tools with working knowledge of SQL and coding skills (Python, Javascript).",
    "preferred_qualifications_text": ": 7+ years of experience building Ads products 5+ years of experience in monetization products and B2B Ability to work in a fast-paced environment, manage multiple priorities, and adapt to changing requirements and deadlines. Proven ability to collaborate and contribute to a positive, inclusive work environment, fostering knowledge sharing and growth within the team. Product Management IC6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1896308",
    "title": "Digital Solution Area Specialists-AI Workforce",
    "locations": [
      "Fargo, North Dakota, United States + 7 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896308/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Information Technology, Business Administration, or related field AND 4+ years of technology-related sales or account management experience OR 5+ years of technology-related sales or account management experience. 2+ years of solution sales or consulting services sales experience Digital Solution Area Specialists IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1889406",
    "title": "Account Executive",
    "locations": [
      "New York, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889406/",
    "required_qualifications_text": ": Bachelor's Degree in Sales, Marketing, or related field AND 8+ years experience in sales, advertising, or marketing with a focus on programmatic advertising OR Master's Degree in Business Administration in Sales, Marketing, or related field AND 5+ years experience in sales, advertising, or marketing with a focus on programmatic advertising OR 9+ years experience in sales, advertising, or marketing with a focus on programmatic advertising OR equivalent experience. Experience in online media, digital advertising, or Search Engine Marketing Sales and Service experience.",
    "preferred_qualifications_text": ": Bachelor's Degree in Sales, Marketing, or related field AND 12+ years experience in sales, advertising, or marketing with a focus on programmatic advertising OR Master's Degree in Business Administration in Sales, Marketing, or related field AND 10+ years experience in sales, advertising, or marketing with a focus on programmatic advertising OR equivalent experience. Experience making recommendations to mid- to senior- level executives. Advertising Account Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $107,600 - $187,500"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $145,600 - $205,600"
      }
    ]
  },
  {
    "job_id": "1861639",
    "title": "Program Manager, Carbon Strategy",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1861639/",
    "required_qualifications_text": ": Master's Degree AND 3+ years' work experience in environmental sustainability, carbon strategy, environmental policy, Corporate Social Responsibility (CSR), Philanthropies, Corporate Affairs, Government Affairs, or related area OR Bachelor's Degree AND 4+ years' work experience in environmental sustainability, carbon strategy, environmental policy, Corporate Social Responsibility (CSR), Philanthropies, Corporate Affairs, Government Affairs, or related area OR equivalent experience. 3+ years' experience managing a corporate social responsibility (CSR) or related program.",
    "preferred_qualifications_text": ": Master's Degree AND 6+ years' work experience in environmental sustainability, carbon strategy, environmental policy, Corporate Social Responsibility (CSR), Philanthropies, Corporate Affairs, Government Affairs, or related area OR Bachelor's Degree AND 8+ years' work experience in environmental sustainability, carbon strategy, environmental policy, Corporate Social Responsibility (CSR), Philanthropies, Corporate Affairs, Government Affairs, or related area OR equivalent experience. 3+ years of experience in carbon strategy and/or environmental policy. 3 + years' experience leading decarbonization initiatives across complex organizations. 3 + years' experience in carbon accounting, and market-based mechanisms. Knowledge of book & claim systems and embodied carbon frameworks. Corporate Social Responsibility IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $85,300 - $171,500"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $111,300 - $187,100"
      }
    ]
  },
  {
    "job_id": "1897180",
    "title": "Senior Product Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897180/",
    "required_qualifications_text": ": Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience. 2+ years of experience with customer success programs and enterprise account management. 2+ years experience taking a product, feature, or experience to market (e.g., design, addressing product market fit, and launch, internal tool/framework).",
    "preferred_qualifications_text": ": Detailed understanding of AI-driven products. Familiarity with Microsoft 365 ecosystem and M365 Copilot capabilities. Knowledge of data analytics and feedback loops for product improvement. Product Management IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1891775",
    "title": "Consulting Program Manager - CTJ - Top Secret",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891775/",
    "required_qualifications_text": "Bachelor's Degree in related field AND 3+ years' experience in project management OR equivalent experience 3+ years of experience leading customer engagements at the senior project or program manager level 3+ years of demonstrated experience in a business development OR Program Management capacity supporting the federal government",
    "preferred_qualifications_text": "Bachelor's Degree in related field AND 5+ years’ experience in project management OR equivalent experience Project Management Professional (PMP) certification or PMI Program Management Professional (PgMP) 5+ years business development and customer relationship management experience in the Department of Defense Agile certification, Scrum Master, Agile Certified Practitioner (PMI-ACP), or Professional Scrum Master One (PSM1) certification Other Requirements: The successful candidate must have an active U.S. Government Top Secret Security Clearance. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate clearance and/or customer screening requirements may result in employment action up to and including termination. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Consulting Project Management IC4 - The",
    "other_requirements_text": ": The successful candidate must have an active U.S. Government Top Secret Security Clearance. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate clearance and/or customer screening requirements may result in employment action up to and including termination. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Consulting Project Management IC4 - The typical base pay range for this role across the U.S. is USD $100,000 - $193,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $126,100 - $204,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 19, 2025 .\nRequired Qualifications\n• Bachelor's Degree in related field AND 3+ years' experience in project management OR equivalent experience\n• 3+ years of experience leading customer engagements at the senior project or program manager level\n• 3+ years of demonstrated experience in a business development OR Program Management capacity supporting the federal government",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,000 - $193,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $126,100 - $204,000"
      }
    ]
  },
  {
    "job_id": "1887596",
    "title": "Principal Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887596/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages - .Net or Python OR Bachelor's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages .Net or Python OR equivalent experience. Software Engineering IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1894201",
    "title": "Security Customer Experience Engineer II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894201/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Engineering, Computer Science, Information Technology (IT), Data Analytics/Science, Artificial Intelligence (AI), or related field AND 5+ years experience in technology industry, cloud, technical support, and/or customer experience engineering OR equivalent experience. 4+ year experience directly engaging and managing customer relationships in consultative or account management-oriented roles 5+ years of hands-on experience with Microsoft Security and Compliance technologies such as Information Protection, Endpoint Data Loss Prevention, eDiscovery, Data Lifecycle Management, Insider Risk Management, Sensitive Information Types and/or Security Copilot, Exchange, Office 365, Sentinel, or Microsoft Defender. Customer Experience Engineering IC3 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1893439",
    "title": "Senior Program Manager (Life Sciences Discovery)",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893439/",
    "required_qualifications_text": ": Bachelor's Degree in Biology, Bioinformatics, Chemistry, Computer Science (with life sciences focus) or related field AND 4+ years of hands-on R&D experience in life sciences or pharma with understanding of the end-to-end scientific research process – from literature review and hypothesis formulation to experimentation and data analysis – particularly in biology or pharmaceutical contexts. OR equivalent experience. 2+ years of experience managing complex, multi-stakeholder projects or programs, with proficient organizational skills to coordinate customer engagements, partner integrations, and internal development schedules, and a proven ability to solve problems, take initiative, and drive projects to successful completion. 3+ years of experience applying AI/ML or data analytics to scientific problems, with familiarity in modern AI approaches such as large language models, knowledge graphs, lab automation, and simulations, and the ability to clearly explain technical concepts, including multi-agent systems, model training, and cloud computing (Azure services, HPC) in the context of scientific research. Demonstrated entrepreneurial mindset, ownership, organization, system-level thinking to drive new products and iterate rapidly in ambiguous environments; adept at collaborating with customers and cross-disciplinary teams to bridge scientists and engineers, with competent communication skills for leading training sessions, presenting technical concepts to non-experts, and influencing decision-makers. Experience building partnerships or managing vendor relationships in the biotech/pharma R&D ecosystem, with a background in facilitating collaboration between technology teams and scientific stakeholders, such as in technology consulting for pharma or serving as a liaison between IT and R&D labs.",
    "preferred_qualifications_text": ": Agentic AI & Workflows: Experience with AI agents or dynamic workflow orchestration in any context (e.g. robotic process automation, autonomous lab systems, or multi-agent simulations). Cloud and Platform Skills: Hands-on experience with cloud-based data or ML platforms (Azure preferred). Familiarity with deploying or managing scientific applications on Azure (Azure ML, Azure Batch or HPC, cognitive services) and knowledge of Azure data security/compliance for life sciences (e.g. handling of PHI/PII data). Life Sciences Computing: Knowledge of common computational biology or chemistry tools (for example: molecular modeling software, bioinformatics pipelines, LIMS, ELN systems, etc.). Ability to assess and integrate such tools’ APIs or models into larger platforms. Publications/Patents: Track record of publications in relevant scientific or technical journals, or patents in AI for life sciences, demonstrating thought leadership in applying innovative technology to research. T echnical Program Management IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1894419",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894419/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Proficient problem-solving skills and ability to thrive in ambiguous environments, with a commitment to continuous learning and delivering customer impact through engineering. Effective communication skills and ability to work collaboratively in a fast-paced, distributed team environment. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1829807",
    "title": "Senior Product Marketing Manager, Security for AI",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1829807/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Marketing, Computer Science, Business or related field AND 8+ years experience in business OR Master's Degree in Marketing, Computer Science, Business or related field AND 6+ years experience in business OR equivalent experience. 6+ years experience in product marketing or product management. 5+ years of experience creating marketing content for various audiences, including technical breakout sessions and executive keynotes. Ability to proactively and quickly learn new and emerging technologies and ability to explain key end-user scenarios and create product demos with compelling stories. Curiosity to understand the nuances of the solution, identify key competitive differentiators and be able to simplify the messaging for the customers, partners, and sales teams. Effective cross-group collaboration and stakeholder management skills across matrix fast paced organizations. Analytical skills and a demonstrated ability to use data to build and present business cases to key stakeholders. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1885158",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885158/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience designing, developing reliable engineering systems, and/or infrastructure.",
    "preferred_qualifications_text": ": Preferred demonstrated experience with Azure technologies (or other cloud computing platforms) and distributed database systems. Drive to improve performance, availability and supportability of services. Drive to increase efficiencies through automation. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1896289",
    "title": "Senior Software Engineer - Chaos Engineering",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896289/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3+ years of software design and development experience with backend services.",
    "preferred_qualifications_text": ": Cloud and services experience; Azure cloud experience is a plus. Experience writing services and micro-services on middle- or back-end tier. Experience with networking layer optimization and tuning, deploying and maintaining large scale cluster products, defining and testing performance characteristics of backend solutions Analytical skills with systematic and structured approach to software design. Experience building reliable and well-tested code. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1889063",
    "title": "Senior Finance Manager - AI Business Solutions Revenue Planning",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889063/",
    "required_qualifications_text": "Master's Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 2+ years experience in financial analysis, accounting, controllership or finance, or related field OR Bachelor's Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 4+ years experience in financial analysis, accounting, controllership or finance, or related field. OR equivalent experience. 2+ years of experience in Microsoft Excel and the ability to synthesize insights from large datasets.",
    "preferred_qualifications_text": "Masters Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 6+ years of post-graduate financial analysis, accounting, controllership, or finance work experience OR Bachelor's degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 8+ years of post-graduate financial analysis, accounting, controllership or finance work experience OR equivalent experience. Analytical and critical thinking skills with proven expertise in financial modeling. Analytical and critical thinking skills with proven expertise in financial modeling. Ability to synthesize complex data and scenarios into actionable insights and compelling business cases. Detail-oriented with the ability to zoom out and drive big-picture strategy when needed. Self-motivated, adaptable to ambiguity, skilled at prioritization across multiple concurrent workstreams. Confident communicator who tailors messaging to diverse audiences, including leadership. Financial Analysis IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1893037",
    "title": "Senior Human Resources Business Partner",
    "locations": [
      "San Jose, San José, Costa Rica + 3 more locations"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 15, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893037/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": []
  }
]