[
  {
    "job_id": "1896909",
    "title": "Sr. Treasury Manager - Cash Operations",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 24, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896909/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Finance, Accounting, or Business AND 8+ years experience with background in treasury, finance, banking, or accounting OR Master's Degree in Business Administration (MBA) or Science in Finance (MSF) AND 5+ years experience with background in treasury, finance, banking, or accounting OR equivalent experience. Professional Treasury Certification (e.g. Chartered Financial Analyst [CFA], Certified Treasury Professional [CTP], Financial Risk Manager [FRM]). 5+ years experience in Treasury or a related field within a corporate environment. 5+ years experience proven ability to communicate effectively across teams and influence outcomes through cross-functional collaboration. 5+ years of demonstrating comfort with adopting new tools and systems, with a curiosity and drive to explore emerging technologies, including AI solutions. 5+ years experience building business partnerships and collaborating effectively across organizational boundaries to achieve shared goals. 5+ years experience driving process improvements and independently leading cross-functional projects from initiation through successful delivery. Treasury IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1889387",
    "title": "Gaming Content and Studios Finance Lead",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 24, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889387/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 8+ years of post-graduate financial analysis, accounting, controllership, or finance work experience OR Bachelor's degree in Business Administration, Accounting, Finance, Economics, Data Science or related field AND 12+ years of post-graduate financial analysis, accounting, controllership, or finance work experience OR equivalent experience. 3+ years experience in multinationals with multi-product/multi-segment finance roles. 3+ years work experience in matrix-based organization. 3+ years work experience in the technology or software industry. Gaming or Entertainment industry experience, which may include management consulting, investment banking, financial strategy or related areas. Extraordinary ability to distill complex information into clear, compelling narratives. Background in FP&A (Financial Planning & Analysis) and finance process optimization. Self-starter with an owner’s mindset, thriving in fast-paced, interconnected environments. Skilled at translating data and ambiguous findings into forward-looking forecasts and actionable plans. Effective collaborator and influencer in dynamic business partner situations. Financial Analysis IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $116,900 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $148,400 - $222,600"
      }
    ]
  },
  {
    "job_id": "1902225",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 24, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1902225/",
    "required_qualifications_text": ": ​ Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience in full-stack web development, including proficiency in modern front-end frameworks (e.g., React) and backend technologies (e.g., .NET).",
    "preferred_qualifications_text": ": Experience using React and other modern web client development practices, frameworks, and tools. Experience using agile methodologies. High enthusiasm, integrity, ingenuity, results-orientation, self-motivation, and resourcefulness in a fast-paced competitive environment. Have a deep desire to work collaboratively, solve problems with groups, find win/win solutions, and celebrate successes. Experience with SQL or other database systems. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1897682",
    "title": "Senior Design Lead - Social & Creative",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 24, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897682/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree or Certificate in Design, Human Computer Interaction, Visual Communications or related art field AND 12+ years experience in art design or a related art field working on computer games or entertainment OR equivalent experience. 6+ years experience using related software and packages (e.g., Maya, 3DS Max, Photoshop/Adobe suite, Mental Ray, Substance Designer/Painter/Zbrush, SideFX Houdini, After Effects, Unity, Softimage). 6+ years experience shipping 2+ multiple projects or products end to end. 6+ years experience integrating campaign data, audience insights, and performance signals into creative operations 3+ years experience fluency in AI tools for design, content generation, and workflow optimization. 6+ years experience building scalable design systems across digital and experiential platforms. 6+ years experience stakeholder management and cross-functional collaboration skills. Art IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1897755",
    "title": "Visual Designer- Social Graphics",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 24, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897755/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree or Certificate in Design, Fine Arts, Human Computer Interaction, Visual Communications or related art field AND 5+ years experience in art design or a related art field working on computer games or entertainment OR equivalent experience. 2+ years experience using related software and packages (e.g., Maya, 3DS Max, Photoshop/Adobe suite, Mental Ray, Substance Designer/Painter/Zbrush, SideFX Houdini, After Effects, Unity, Softimage) OR equivalent software packages. 2+ years experience years experience shipping 1 project or product end to end. 2+ years experience creating content for social platforms (e.g., Instagram, LinkedIn, TikTok, YouTube). 2+ years experience with AI tools for image generation, layout, or content creation—or a strong desire to learn and apply them. Art IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1897692",
    "title": "Senior Manager - Social & Creative",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 24, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897692/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree or Certificate in Design, Fine Arts, Human Computer Interaction, Visual Communications or related art field AND 15+ years experience in art design or a related art field working on computer games or entertainment OR equivalent experience. 8+ years people management experience (e.g., serving as a Lead Artist, Art Manager Creative Director, etc.). 12+ years experience using related software and packages (e.g., Maya, 3DS Max, Photoshop/Adobe suite, Mental Ray, Substance Designer/Painter/Zbrush, SideFX Houdini, After Effects, Unity, Softimage). 12+ years experience shipping 2+ multiple projects or products end to end. 12+ years experience integrating campaign data, audience insights, and performance signals into creative operations 12+ years experience with modular storytelling and scalable content systems Proficiency with production and collaboration tools (Asana, Airtable, Figma, Adobe Creative Suite, M365) 12+ years experience in business to business or enterprise marketing preferred Communication, organizational, and stakeholder management skills 12+ years experience in motion design systems and animation principles as applied to branding and product storytelling. 12+ years experience navigating large, matrixed organizations and driving clarity in complex environments. 12+ years experience relationship-building skills with stakeholders and peers. 12+ years experience conceptual thinking and ability to distill ideas into compelling creative. Art M6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $331,200"
      }
    ]
  },
  {
    "job_id": "1858420",
    "title": "Senior Program Manager, Travel and Card",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 24, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1858420/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business, Operations, Finance, or related field AND 6+ years experience in program management, process management, or process improvement OR Bachelor's Degree in Business, Operations, Finance, or related field AND 8+ years experience in program management, process management, or process improvement OR equivalent experience. 7+ years of relevant work experience in Operations, preferably in a large size international organization. Process excellence experience in Shared Service Center/Outsourcing environment. Strategic and tactical skills, project management experience and demonstrated ability to implement change Comfortable working with ambiguity and adept at using data to influence business decision making. Ability to communicate effectively with all levels within an organization, as well as establish trust quickly and create win-win situations. Ability to travel minimally, preferably both domestic and international. Business Program Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  }
]