[
  {
    "job_id": "1841923",
    "title": "Senior Software Engineer - Azure Storage",
    "locations": [
      "Multiple Locations, United States + 6 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1841923/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, Python, or Rust OR equivalent experience 4+ years of software development experience building scalable, distributed services with C++ 3+ years of experience in designing, analyzing, and troubleshooting large-scale distributed systems",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, Python or Rust OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, Python or Rust OR equivalent experience. Proficent systems-level coding skills in C, C++ or Rust Demonstrated experience in one or more of the following domains: High-performance distributed storage or databases Hardware acceleration, SIMD (Single Instruction, Multiple Data), and advanced instruction sets to optimize compute and I/O paths Kernel-mode or user-mode networking stacks (Transmission Control Protocol (TCP), Quick UDP (spell out....) Internet Connections (QUIC), RDMA) Low-latency Input/Output (IO), lock-free or wait-free algorithms, fine-grained performance tuning Proven ability to debug complex issues in production environments and drive them to resolution Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1891799",
    "title": "Senior Product Manager - PowerPoint Agent",
    "locations": [
      "Mountain View, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891799/",
    "required_qualifications_text": ": Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience. 5+ years collaborating across cross-functional teams and managing stakeholders to deliver customer-driven decisions. 5+ years of data driven product development and decision making with experience defining success and metrics throughout the feature development lifecycle 5+ years of developing features based on interaction design principles and user research, translating insights into effective, practical design solutions.",
    "preferred_qualifications_text": ": Proven track record of successfully launching AI or machine learning features or products, with specialized expertise in large language models or conversational agents. Strong understanding of AI technologies, including natural language processing, generative AI, and computer vision. Expertise in communication, analytical, and organizational skills, along with extensive experience with Microsoft PowerPoint or similar presentation software. Exceptional eye for layout, typography, and visual storytelling; able to turn complex information into beautiful, engaging slides and documents. A thorough understanding of usability testing techniques, which drive an iterative design process, will significantly enhance the user's experience.\nRequired Qualifications:\n• Bachelor's Degree AND 5+ years experience in product/service/program management or software development OR equivalent experience.\n• 5+ years collaborating across cross-functional teams and managing stakeholders to deliver customer-driven decisions.\n• 5+ years of data driven product development and decision making with experience defining success and metrics throughout the feature development lifecycle\n• 5+ years of developing features based on interaction design principles and user research, translating insights into effective, practical design solutions.\n• OR equivalent experience.\nOther Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred Qualifications: Proven track record of successfully launching AI or machine learning features or products, with specialized expertise in large language models or conversational agents. Strong understanding of AI technologies, including natural language processing, generative AI, and computer vision. Expertise in communication, analytical, and organizational skills, along with extensive experience with Microsoft PowerPoint or similar presentation software. Exceptional eye for layout, typography, and visual storytelling; able to turn complex information into beautiful, engaging slides and documents. A thorough understanding of usability testing techniques, which drive an iterative design process, will significantly enhance the user's experience.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications:\n• Proven track record of successfully launching AI or machine learning features or products, with specialized expertise in large language models or conversational agents. Strong understanding of AI technologies, including natural language processing, generative AI, and computer vision.\n• Expertise in communication, analytical, and organizational skills, along with extensive experience with Microsoft PowerPoint or similar presentation software.\n• Exceptional eye for layout, typography, and visual storytelling; able to turn complex information into beautiful, engaging slides and documents.\n• A thorough understanding of usability testing techniques, which drive an iterative design process, will significantly enhance the user's experience.",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1876096",
    "title": "Senior Software Engineer - Azure Databricks",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1876096/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science , or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C#, C++, JavaScript, React, or Python OR equivalent experience. 5+ years of Azure development experience.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, React, or Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1893619",
    "title": "Principal Software Engineer - Azure Blob Storage",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893619/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 6+ years experience in designing and developing products and services in large scale distributed systems. 6+ years of experience in cloud backend development and operation, including performance, reliability, resilience, and scale-out. Other Qualifications: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience designing and implementing distributed storage systems. Experience developing scalable and high-performance Application Programming Interface (API) services. Experience in understanding data pipelines, access patterns, and frameworks for Artificial Intelligence (AI) systems. Software Engineering IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1894843",
    "title": "Research Intern - Artificial Intelligence",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894843/",
    "required_qualifications_text": "Currently enrolled in a Master or Ph.D. program in Computer Science, Electrical Engineering, Mathematics or a related field.",
    "preferred_qualifications_text": "Ability to work independently and collaboratively in a dynamic and vibrant research environment. Willingness to embrace knowledge/technique outside your field of research. Solid programming skill, including prototyping, implementation and optimization. Experience in LLM pre-training, post-training and inference (like Megatron framework). Experience in world model, multimodality and AI4Code. Reinforcement Learning experiences and frameworks (like VeRL, rLLM) Proven publication track such as CVPR, ACL, ICML, ICCV, ECCV, NeurIPS, ICLR, RSS etc. Applied Sciences IC2 :",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $5,460 -$10,680"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $7,040 -$11,640"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,550 -$12,880"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,480 - $13,"
      }
    ]
  },
  {
    "job_id": "1887590",
    "title": "Technical Program Manager- AI Programmatic Metrics & Measurment",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887590/",
    "required_qualifications_text": ": Bachelor’s Degree AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 2+ years experience managing cross-functional and/or cross-team projects Minimum of 2 years of experience in AI Programmatic Metrics and Measurement, including hands-on work with data-driven performance analysis and optimization",
    "preferred_qualifications_text": ": Bachelor’s Degree AND 8+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 6+ years experience managing cross-functional and/or cross-team projects. 1+ year(s) experience reading and/or writing code (e.g., sample documentation, product demos). 2+ years experience with Customer Success processes including reactive support or offering design and enablement. 3+ years experience managing and delivering data products, business intelligence and providing data analysis to leaders/team members. Technical Program Management IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1892401",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892401/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Typescript or Python OR equivalent experience. 1+ years of experience in front-end development using modern JavaScript frameworks and libraries such as React Angular, Redux, and Mobx, with a focus on building interactive user interfaces. Experience in prompt engineering, working with LLMs and building AI-powered software.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Typescript or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python, Typescript OR equivalent experience. 1+ years experience with git and GitHub copilot for source control and development. 1+ years experience with visual studio and visual studio code IDEs. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1893607",
    "title": "Senior Software Engineer - Azure Blob Storage",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893607/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience. 4+ years of experience in programming for developing products and services in systems and backend, including d esigning and building large-scale distributed systems and b uilding quality products and scalable distributed services. 4+ years of experience in cloud backend development and operations, including p erformance optimization, reliability, resilience, and scale-out capabilities.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience building distributed systems and large-scale storage, including: Multi-threaded and parallel programming. Cloud or on-premises environments for scalability and reliability. Experience in software engineering practices, including: Coding with a solid foundation in data structures and algorithms. Relevant testing, debugging, and analytical skills. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1858698",
    "title": "Principal Applied Scientist",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1858698/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 6+ years of experience in development/deployment of machine learning algorithms. At least 1 year of experience managing or mentoring technical contributors. Strong verbal and written communication skills, with the ability to explain complex ideas clearly to technical and non-technical audiences.",
    "preferred_qualifications_text": ": Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 9+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. Experience contributing code to production systems or shipped products. Hands-on experience building and maintaining production-grade ML pipelines. Domain specific experience in Audio Digital Signal Processing is a plus. Applied Sciences IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1893642",
    "title": "Principal Software Engineer - Azure Blob Storage",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893642/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 6+ years experience in designing and developing products and services in large scale distributed systems. 6+ years of experience in cloud backend development and operation, including performance, reliability, resilience, and scale-out. Other Qualifications: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience designing and implementing distributed storage systems. Experience developing scalable and high-performance Application Programming Interface (API) services. Experience in understanding data pipelines, access patterns, and frameworks for Artificial Intelligence (AI) systems. Software Engineering IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1889252",
    "title": "Principal Applied Scientist",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889252/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 8+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 5+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 6+ years of industry experience on applied AI/ML for web scale products.",
    "preferred_qualifications_text": ": Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 12+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 8+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 8+ years of industry experience on applied AI/ML for web scale products. Having publications at top AI/ML conferences (e.g., KDD, SIGIR, NIPS, ICML, ICLR, RecSys, ACL, CIKM, CVPR, ICCV, etc.). Demonstrated capability to grow the business through the innovation of ML algorithms. Experience in Software Engineering and familiar with ML Infra. Applied Sciences IC6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1846775",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1846775/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Technical fundamentals in distributed systems, databases, or cloud-native architecture",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python or equivalent experience. Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1874851",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 11, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1874851/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years development experience, especially in Windows internals, kernel-mode, and/or low-level Operating Systems. Experience designing, building, and optimizing Large-Scale Distributed Systems. Ability to lead and influence cross-team projects, drive architectural decisions, and advocate for best practices across the organization.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 5+ years developing OS software (Windows, Linux, macOS, or similar) with a focus on security, including threat modeling and secure coding. Proven track record integrating AI/ML models into production systems, including agentic architectures, LLMs, and adaptive workflows. Software Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  }
]