[
  {
    "job_id": "1879561",
    "title": "Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1879561/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C++, Rust, C#, Go, Java, or Python, OR equivalent experience. Academic and/or professional experience with cloud infrastructure, including: Networking and security fundamentals. Containerization technologies (e.g. Docker and/or Kubernetes). Cloud platforms (e.g., Azure, AWS, and/or GCP).",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C#, Go, Java, or Python, OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C#, Go, Java, or Python OR equivalent experience. Software Engineering IC2 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $84,200 - $165,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $109,000 - $180,400"
      }
    ]
  },
  {
    "job_id": "1864981",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1864981/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ years of experience designing, developing, or maintaining secure software systems, with applied knowledge of authentication, data protection, access control, and secure coding practices",
    "preferred_qualifications_text": ": Proficiency coding in C# Experience with Service Fabric Distributed systems experience Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1885322",
    "title": "Senior Security Operations Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885322/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred/Additional Qualifications Master's Degree or Doctorate in Statistics, Mathematics, Computer Science or related field OR 7+ years of experience in software development lifecycle, large-scale computing, modeling, cyber security, and anomaly detection. CISSP CISA CISM SANS GCIA GCIH OSCP Security+ Security Operations Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 17, 2025. #azdat #azuredata #secOps #securityengineering #securitytooling #devops #database #security #cybersecurity\nRequired /Minimum Qualifications\n• Bachelor's Degree in Statistics, Mathematics, Computer Science or related field OR 5+ years of experience in software development lifecycle, large-scale computing, access control, modeling, cyber security, anomaly detection, Security Operations Center (SOC) detection, threat analytics, security incident and event management (SIEM), information technology (IT), and operations incident response.\n• 5+ years of experience in distributed systems.\n• 3+ years of experience with software tools including (Security tools or Access Control or Vulnerability Management or Anomaly Detection).\n• Hands on experience with coding in (C, C#, C++, Java, or Python)\nOther Requirements\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\n• This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications\n• Master's Degree or Doctorate in Statistics, Mathematics, Computer Science or related field OR 7+ years of experience in software development lifecycle, large-scale computing, modeling, cyber security, and anomaly detection.\n• CISSP CISA CISM SANS GCIA GCIH OSCP Security+\nSecurity Operations Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft will accept applications for the role until October 17, 2025.\n#azdat #azuredata #secOps #securityengineering #securitytooling #devops #database #security #cybersecurity",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1887944",
    "title": "Senior Software Engineer - OneDrive & SharePoint AI",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887944/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with Large Language Models (LLMs), orchestrators, embedding models, and vector databases. Experience designing cloud-scale services and server/service management features.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Pytho OR equivalent experience. Proven track record of delivering projects that include multiple components. Experience mentoring and coaching peers and early-in-career engineers. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885294",
    "title": "Data Scientist II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 04, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885294/",
    "required_qualifications_text": ": Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 1+ year(s) data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) or consulting experience OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 2+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. 2+ years of experience in data science, analytics, or related areas. 2+ years of experience in applied machine learning, statistical modeling, and experimentation .",
    "preferred_qualifications_text": ": Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 1+ year(s) data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. Proficiency in Python for data analysis and model development. Experience with SQL and working with large datasets. Data Science IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  }
]