[
  {
    "job_id": "1885190",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885190/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years as a software engineer shipping high quality software to customers at scale.",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preffered Qualifications: Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Media streaming experience - specifically real-time streaming of audio and video. Demonstrated ability to rapidly acquire and implement knowledge in new technologies and programming languages. Experience building and deploying cloud-native applications, microservices, and RESTful API design. Experience with AI concepts - theoretical and practical knowledge of LLMs, prompt engineering, Retrieval Augmented Generation (RAG) pipelines and agent orchestration frameworks. Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 11th, 2025. #Teams #Immersive #AI\nRequired Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• 2+ years as a software engineer shipping high quality software to customers at scale.\n• OR equivalent experience.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreffered Qualifications:\nMaster's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Media streaming experience - specifically real-time streaming of audio and video. Demonstrated ability to rapidly acquire and implement knowledge in new technologies and programming languages. Experience building and deploying cloud-native applications, microservices, and RESTful API design. Experience with AI concepts - theoretical and practical knowledge of LLMs, prompt engineering, Retrieval Augmented Generation (RAG) pipelines and agent orchestration frameworks. Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 11th, 2025.\n• Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• Media streaming experience - specifically real-time streaming of audio and video.\n• Demonstrated ability to rapidly acquire and implement knowledge in new technologies and programming languages.\n• Experience building and deploying cloud-native applications, microservices, and RESTful API design.\n• Experience with AI concepts - theoretical and practical knowledge of LLMs, prompt engineering, Retrieval Augmented Generation (RAG) pipelines and agent orchestration frameworks.\n• OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 11th, 2025.\n#Teams #Immersive #AI",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1885242",
    "title": "Software Engineer",
    "locations": [
      "Multiple Locations, Mexico"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885242/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1828770",
    "title": "Senior Applied Scientist-Word",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1828770/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 3+ years of research or product experience in NLP. 3+ years of hands-on experience in Deep Learning using PyTorch or similar. 3+ years of software engineering experience in Python or C#.",
    "preferred_qualifications_text": ": Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 3+ years experience creating publications (e.g., patents, libraries, peer-reviewed academic papers). Experience presenting at conferences or other events in the outside research/industry community as an invited speaker. 3+ years experience conducting research as part of a research program (in academic or industry settings). 1+ year(s) experience developing and deploying live production systems, as part of a product team. 1+ year(s) experience developing and deploying products or systems at multiple points in the product cycle from ideation to shipping. PhD degree in Computational Linguistics or Computer Science with a focus on NLP. Fluency with recent NLP & LLM advancement as well as a driven passion for discovering the next generation of technology. Experience conducting applied research and publishing papers. Experience working in collaborative multiple team environment and ship production features in a fast-paced environment. Effective communication, collaboration, and problem-solving skills and a customer-centric mindset. Applied Sciences IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1882925",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882925/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": 2+ years of Proficient in various languages, especially web-based technologies like JavaScript, TypeScript, React, and C# Backend technologies: Proficient in backend technologies and cloud-based architectures to build large-scale distributed systems and AI/ML experience Experience in AI/ML is a plus 2+ years of experience designing, developing, or maintaining secure software systems, with applied knowledge of authentication, data protection, access control, and secure coding practices Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1881098",
    "title": "Senior Data Scientist",
    "locations": [
      "Redmond, Washington, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1881098/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 7+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. Have a track record of innovative thinking and problem-solving skills using Big Data. Have the ability to deliver on ambiguous projects with incomplete data. Professional experience with large-scale computing systems like Hadoop, MapReduce, and/or similar systems. Enjoy travel and are comfortable with travel up to 25% Data Science IC4 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role's job duties. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885319",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885319/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience. 2+ years of experience with distributed systems or networking.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ years experience with generative AI models (e.g., LLMs, diffusion models) and frameworks such as OpenAI, Hugging Face Transformers, LangChain, or Semantic Kernel. 1+ years experience with agentic AI architectures, including planning, memory, tool use, and orchestration. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1879167",
    "title": "Emulation Engineer II",
    "locations": [
      "Santa Clara, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1879167/",
    "required_qualifications_text": ": Master's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 1+ year(s) technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 2+ years technical engineering experience OR equivalent experience. 2+ years of experience in Application Specific integrated circuit (ASIC)/ System on Chip (SoC) emulation verification with System Verilog (SV)/Universal Verification Methodology (UVM) environments using any Standard Emulator (Palladium, Protium) 2+ years experience with Python or Perl scripting, including developing systems from scratch Other Qualifications: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Experience with emulation flows using tools such as Palladium, Protium, Zebu, or Veloce Familiarity with SpeedBridges and Virtual Transactors Ability to write and debug RTL test cases for feature-specific scenarios Background with Jenkins CI systems, software development practices, and Git Exposure to FPGA platforms such as Xilinx UltraScale+ and Vivado toolchains Communication and teamwork skills, with interest in taking on a variety of challenges Silicon Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1845391",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1845391/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Proven ability to plan, schedule and deliver high quality software. Experience working in collaborative teams and cross-group efforts. Solid data engineering and ML experience with large language models. Hands-on experience in Embedded Linux based Server Manageability 3 + years of industry experience with common ML engineering programming languages and platforms, such as Python , ML Stack, Synapse. Familiarity and understanding of hardware and firmware in Server Manageability domain : OpenBMC , DMTF MCTP, Redfish, PLDM, SPDM and RAS F amiliar with e2e machine learning development cycle, from model measurements / training/ evaluation to optimization/deployment, etc . Experience working with large language models / multi-billion parameter models, focusing on their efficient training and online inference Experiences in one of these training frameworks: Pytorch , Tensorflow , etc., and LLM is a plus. Experience in big data mining, familiar with Hadoop/Spark is a plus . High tolerance to ambiguity and ability to make progress when situations are in flux. Self-motivated and able to work independently with minimal supervision Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1887864",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887864/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years software engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3+ years' experience with C/C++/C#",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience in building highly available highly scalable microservice architecture Experience in working with orchestration platforms like K8 and Service Fabric Ability to work independently and successfully deliver on KPIs Cross-team collaboration skills and the desire to collaborate in a team of researchers and developers Strong communication skills (both written and oral) Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1886612",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1886612/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 15+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with K8s cluster creation, management, and optimization. Expert level knowledge around security and compliance experience for K8s. Experience with networking in K8s for inter, intra, and external pod-to-pod, control, and data plane communications. Experience with Security Configuration and Compliance: Configure, update, and maintain security tools used for endpoint security, log collection and reporting, vulnerability, and compliance scanning. Hardening and compliance with best practices, benchmarks, and remediate vulnerabilities as reported by security. Software Engineering IC6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1887383",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887383/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of sound understanding of Computer Science fundamentals including Algorithms, Data Structures, Object Oriented Design, System Design. 2+ years of problem solving and design skills, with demonstrated passion for security, quality, performance, and engineering excellence.",
    "preferred_qualifications_text": ": Experience with Microsoft Azure cloud platform, especially Azure DevOps, App Insights, Key Vault, Storage accounts, etc… Prior experience with shipping services over multiple release cycles. Experience with container technologies, including Docker and Kubernetes. Experience in implementing and integrating open-source tools at-scale with a focus environment management Knowledge and passion for Kanban or Agile development practices, including continuous integration, test-driven development. Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Powershell, or Python Possess a sound understanding of Computer Science fundamentals including Algorithms, Data Structures, Object Oriented Design, System Design Great problem solving and design skills, with demonstrated passion for security, quality, performance, and engineering excellence. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local [or INSERT applicable country] government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1879679",
    "title": "Senior Research Data Scientist – LLM Memory & Agents – Microsoft Research",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1879679/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Computer Science or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) Doctorate in Computer Science or related field AND 1+ year(s) data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. Experience with Python. Experience with Large Language Models (LLMs).",
    "preferred_qualifications_text": "Experience with small / large language models. Experience deploying research through to production. Experience in graph machine learning. Experience with manifold learning. Experience with cloud technologies such as Azure or AWS. Experience with full-stack development. Foundational knowledge in computer science. Ability to learn, analyze and solve hard problems Effective in team collaboration and communication within diverse teams. Experience in C#, Java, Rust, JavaScript/TypeScript. Data Science IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1850124",
    "title": "Principal Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1850124/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Rust OR Python OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Rust or Python OR equivalent experience. 1+ year(s) of experience applying AI/ML techniques (LLMs, anomaly detection, reinforcement learning) to systems or networking domains is strongly preferred. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1858070",
    "title": "Member of Technical Staff - Principal Data Platform Architect",
    "locations": [
      "New York, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1858070/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science , Math, Software Engineering, Computer Engineering, or related field AND 8+ years' experience in software development, data modeling or data engineering work OR Master's Degree in Computer Science , Math, Software Engineering, Computer Engineering, or related field AND 6+ year (s) experience in software development, or data engineering work OR equivalent experience. 5+ years of hands exp erience in build ing from ground up large-scale data processing platforms with more than 100 data pipelines. 5+ years experience building data pipelines using Scala, Python ( PySpark ), and SQL, with deep understanding of big data technologies including Apache Hadoop ecosystem, Spark, Kafka Stream/Flink, columnar and vector databases, semantic search, RDBMS, and key-value stores. 5+ years of experience designing and deploying scalable services on public cloud platforms such as Azure, AWS, and GCP. 2+ years of hands-on experience architecting distributed systems at scale, with comprehensive systems knowledge spanning bare-metal infrastructure, containerization, and networking",
    "preferred_qualifications_text": ": 10+ years technical engineering experience building data platforms that handle large volumes of data in both batch and real time. Coding in languages including, but not limited to, Scala, Python, C#, Java, Spark, & SQL . Ability to identify, analyze, and resolve complex technical issues, ensuring optimal performance, scalability, and user experience. Dedication to writing clean, maintainable, and well-documented code with a focus on application quality, performance, and security. Demonstrated interpersonal skills and ability to work closely with cross-functional teams, including product managers, designers, and other engineers. Ability to clearly communicate complex technical concepts to both technical and non-technical stakeholders. Passion for learning new technologies and staying up to date with industry trends, best practices, and emerging technologies in web development and AI. Ability to work in a fast-paced environment, manage multiple priorities, and adapt to changing requirements and deadlines. Proven ability to collaborate and contribute to a positive, inclusive work environment, fostering knowledge sharing and growth within the team. Data Engineering IC6 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1882720",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882720/",
    "required_qualifications_text": "(RQs) Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, OR equivalent experience. 3+ years of experience in software engineering practices, coding and solid foundation in data structures and algorithms, with problem solving, debugging and analytical skills. 2+ years’ experience in design and implementation of large-scale cloud services.",
    "preferred_qualifications_text": "Master's Degree in Computer Science or a related technical field, along with 4+ years of technical engineering experience with coding in languages such as C, C++, C#, Java, JavaScript, or Python; OR Bachelor's Degree in Computer Science or a related technical field, along with 6+ years of technical engineering experience with coding in languages such as C, C++, C#, Java OR equivalent experience. Industry experience with cloud technologies (Azure, AWS, Google). Experience with distributed systems, micro-service architecture, scalability patterns, and high-availability architecture. Experience with AI/ML technologies, especially LLMs and prompt engineering. Experience with Pub/Sub systems and streaming ingestion systems. Proven experience in driving large strategic and complex or ambiguous projects that span organizations. Proficient in problem-solving skills, with a data-driven approach to debugging and performance optimization. Experience in deploying, monitoring, and operating services in the cloud. Excellent problem-solving, troubleshooting, and organizational skills. Experience with or exposure to Agile and iterative development processes. Familiarity with modern engineering practices such as CI/CD and version control systems like Git. Other Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. #C+E #SPSJobs Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. #C+E #SPSJobs Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 20, 2025\nRequired Qualifications (RQs)\n• Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, OR equivalent experience.\n• OR equivalent experience.\n• 3+ years of experience in software engineering practices, coding and solid foundation in data structures and algorithms, with problem solving, debugging and analytical skills.\n• 2+ years’ experience in design and implementation of large-scale cloud services.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1858561",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1858561/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 6+ years of software engineering experience building and releasing web services Show experience in driving large strategic and complex or ambiguous projects that span organizations. Strong design, implementation, and testing skills. Demonstrated ability to write reliable, low defect, unit tested code. Ability to work and communicate effectively across disciplines and teams. Ability to motivate, mentor, and develop other engineers and provide technical leadership. Passion for delivering customer impact and value. Software Engineering IC4 - The",
    "other_requirements_text": ": This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1883681",
    "title": "Senior Software Engineer - Azure Kubernetes Service",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1883681/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience. 3+ year(s) of experience in building, shipping and operating reliable, distributed solutions.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ year(s) of experience with building AI solutions using agentic AI tools. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1881285",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1881285/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 7+ years of experience in software engineering practices, coding, and foundational knowledge in data structures and algorithms, with problem solving, debugging and analytical skills. 3+ years’ experience in design and implementation of large-scale cloud services. Additionally, 4+ years of experience designing, developing, or maintaining secure software systems , with applied knowledge of authentication , data protection , access control , and secure coding practices. Other Qualifications: Microsoft Cloud Background Check : Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Demonstrated ability to work effectively both within a team and cross-group to drive identification and resolution of issues to ship under tight deadlines. Hands-on knowledge of debugging and scripting. Software Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885171",
    "title": "SOFTWARE ENGINEER II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885171/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": 3-5 years' experience in software industry. Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1827204",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1827204/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience designing, developing reliable engineering systems, and/or infrastructure.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1880555",
    "title": "IP Verification Engineer II",
    "locations": [
      "Austin, Texas, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1880555/",
    "required_qualifications_text": ": Master's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 1+ year(s) technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Computer Science, or related field AND 2+ years technical engineering experience OR equivalent experience. 1 + years of pre-silicon subsystem or IP verification experience.",
    "preferred_qualifications_text": ": Understanding of cache coherency and/or fabric interconnect architectures and microarchitectures Demonstrated experience in verifying designs that utilize Coherent Hub Interface (CHI), Advanced Microcontroller Bus Architecture (AMBA) protocols, or other fabric protocols Experience with verification for a full product cycle from definition to silicon, including writing test plans, developing tests, debugging failures and coverage signoff Experience creating, maintaining , or integrating test benches, checkers and stimulus using Universal Verification Methodology (UVM), System Verilog Test Bench (SVTB), and optionally Python based post-processing checking Aptitude for writing scripts/software with industry standard languages like Python Experience applying generative AI to day-to-day tasks Silicon Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1882289",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882289/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience 3+ years experience developing software for Windows or Linux OS internals, including kernel-level components and system services 3+ years of cloud service experience including, but not limited to Azure, GCP, and AWS 3+ years familiarity with cloud platforms such as Azure, AWS, or GCP.",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred Requirements Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3+ years of experience building software systems, with a focus on large-scale, distributed platforms. 3+ years experience working with high-scale, mission-critical SaaS products, including service operations. Proven ability to guide and mentor engineers, leading their projects to completion. Knowledge of data processing frameworks such as Spark, Hadoop, or similar technologies. Experience with security data management, logging, or monitoring solutions. 1+ years experience applying AI models or agentic flows in production systems. Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications and processes offers for these roles until October 10, 2025. #MSFTSecurity, #RepMAP, #MicrosoftFraudPrevention\nRequired Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience\n• 3+ years experience developing software for Windows or Linux OS internals, including kernel-level components and system services\n• 3+ years of cloud service experience including, but not limited to Azure, GCP, and AWS 3+ years familiarity with cloud platforms such as Azure, AWS, or GCP.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Requirements\n• Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• 3+ years of experience building software systems, with a focus on large-scale, distributed platforms.\n• 3+ years experience working with high-scale, mission-critical SaaS products, including service operations.\n• Proven ability to guide and mentor engineers, leading their projects to completion.\n• Knowledge of data processing frameworks such as Spark, Hadoop, or similar technologies.\n• Experience with security data management, logging, or monitoring solutions.\n• 1+ years experience applying AI models or agentic flows in production systems.\n• OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft will accept applications and processes offers for these roles until October 10, 2025.\n#MSFTSecurity, #RepMAP, #MicrosoftFraudPrevention",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885354",
    "title": "Principal Software Engineer - Azure Kubernetes Services",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885354/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR equivalent experience. 4+ years of experience working with Kubernetes OR managing distributed systems in production.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR Python OR Master's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR equivalent experience. Software Engineering IC6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  },
  {
    "job_id": "1886916",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1886916/",
    "required_qualifications_text": ": Bachelor's degree in computer science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ years of experience building cloud native distributed applications.",
    "preferred_qualifications_text": ": Experience building cloud native distributed applications Experience with NoSQL databases Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1885157",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885157/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: • This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred/Additional Qualifications Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. in-depth knowledge of distributed systems design principles, scalability patterns, and high-availability architectures Experience with cloud platforms (Azure, AWS, GCP) Problem-solving skills, with a data-driven approach to debugging and performance optimization Effective communication and collaboration skills, with experience working in agile teams and leading technical discussions Drive technical roadmap and vision for services, aligning with Azure Data's overall strategy Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 21, 2025. #Fabric\nRequired/Minimum Qualifications\n• Bachelor's degree in computer science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• 4+ years experience in distributed systems design principles, scalability patterns, and high-availability architectures\n• OR equivalent experience.\nOther Requirements Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: • This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications\n• Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• in-depth knowledge of distributed systems design principles, scalability patterns, and high-availability architectures\n• Experience with cloud platforms (Azure, AWS, GCP)\n• Problem-solving skills, with a data-driven approach to debugging and performance optimization\n• Effective communication and collaboration skills, with experience working in agile teams and leading technical discussions\n• Drive technical roadmap and vision for services, aligning with Azure Data's overall strategy\n• OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft will accept applications for the role until October 21, 2025.\n#Fabric",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1881102",
    "title": "Principal Data Scientist",
    "locations": [
      "Redmond, Washington, United States + 4 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1881102/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 8+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 10+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 12+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. Professional experience with large-scale computing systems like Hadoop, MapReduce, and/or similar systems. Enjoy travel and are comfortable with travel up to 25% Data Science IC5 - The",
    "other_requirements_text": "Microsoft is unable to sponsor a work visa for this role due to the nature of the role's job duties. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1885844",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885844/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.. 3+ years of experience in software engineering practices, coding and solid foundation in data structures and algorithms, with problem solving, debugging and analytical skills. 2+ years’ experience in design and implementation of large-scale cloud services.",
    "preferred_qualifications_text": "Master's Degree in Computer Science or a related technical field, along with 4+ years of technical engineering experience with coding in languages such as C, C++, C#, Java, JavaScript, or Python; OR Bachelor's Degree in Computer Science or a related technical field, along with 6+ years of technical engineering experience with coding in languages such as C, C++, C#, Java, JavaScript, or Python; OR equivalent experience. Industry experience with cloud technologies (Azure, AWS, Google). Experience with distributed systems, micro-service architecture, scalability patterns, and high-availability architectures. Experience with Pub/Sub systems and streaming ingestion systems. Proven experience in driving large strategic and complex or ambiguous projects that span organizations. Proficient in problem-solving skills, with a data-driven approach to debugging and performance optimization. Effective communication and collaboration skills, with the ability to lead technical discussions. Passion for customer-focused innovation. Experience in deploying, monitoring, and operating services in the cloud. Ability to learn quickly and self-motivated. Excellent problem-solving, troubleshooting, and organizational skills. Experience with or exposure to Agile and iterative development processes. Familiarity with modern engineering practices such as CI/CD and version control systems like Git. Other Requirements Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Software Engineering IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until SOctober 21, 2025.\nRequired Qualifications\n• Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience..\n• 3+ years of experience in software engineering practices, coding and solid foundation in data structures and algorithms, with problem solving, debugging and analytical skills.\n• 2+ years’ experience in design and implementation of large-scale cloud services.\n• OR equivalent experience..",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1882713",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882713/",
    "required_qualifications_text": "(RQs) Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, OR equivalent experience. 3+ years of experience in software engineering practices, coding and solid foundation in data structures and algorithms, with problem solving, debugging and analytical skills. 2+ years’ experience in design and implementation of large-scale cloud services.",
    "preferred_qualifications_text": "Master's Degree in Computer Science or a related technical field, along with 4+ years of technical engineering experience with coding in languages such as C, C++, C#, Java, JavaScript, or Python; OR Bachelor's Degree in Computer Science or a related technical field, along with 6+ years of technical engineering experience with coding in languages such as C, C++, C#, Java OR equivalent experience. Industry experience with cloud technologies (Azure, AWS, Google). Experience in AI, building AI agents, AI solutions and services, familiar with AI technology. Experience with distributed systems, micro-service architecture, scalability patterns, and high-availability architectures. Experience with Pub/Sub systems and streaming ingestion systems. Proven experience in driving large strategic and complex or ambiguous projects that span organizations. Proficient in problem-solving skills, with a data-driven approach to debugging and performance optimization Experience in deploying, monitoring, and operating services in the cloud. Experience with or exposure to Agile and iterative development processes. Familiarity with modern engineering practices such as CI/CD and version control systems like Git. Oher Qualifications: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Software Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1890576",
    "title": "Software Engineer II - CoreAI",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890576/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred/Additional Qualifications: Bachelor's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python 3+ years of experience delivering solutions of infrastructure as a platform 2+ years of experience with increasing the development and delivery velocity of complex codebases 2+ years of experience with delivering security in the cloud Experience successfully contributing to engineering teams to successfully deliver code into large engineering projects Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft posts positions for a minimum of 5 days, with applications accepted on an ongoing basis until the position is filled. #CoreAI #aiplatform\nRequired/Minimum Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• 2+ years of experience delivering solutions of infrastructure as a platform\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.\nOR equivalent experience.\n2+ years of experience delivering solutions of infrastructure as a platform\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred/Additional Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• 3+ years of experience delivering solutions of infrastructure as a platform\n• 2+ years of experience with increasing the development and delivery velocity of complex codebases\n• 2+ years of experience with delivering security in the cloud\n• Experience successfully contributing to engineering teams to successfully deliver code into large engineering projects\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft posts positions for a minimum of 5 days, with applications accepted on an ongoing basis until the position is filled.\n#CoreAI\n#aiplatform",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1887815",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887815/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of experience with icloud services.",
    "preferred_qualifications_text": ": Experience working in large-scale enterprise environments. Experience building or operating observability platforms (monitoring, logging, tracing) and applying AI/ML to anomaly detection or root cause analysis. Eagerness to learn about building reliable and performant systems. Experience with designing and implement automated solutions that reduce manual effort. Familiarity with cloud platforms (Azure/AWS/GCP) and microservices architectures. Knowledge of AI/ML concepts and practical experience integrating AI-driven features into engineering workflows is highly desired. Understanding of distributed systems and microservices architecture. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1838309",
    "title": "Senior Security Researcher",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 06, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1838309/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Doctorate in Statistics, Mathematics, Computer Science or related field OR 6+ years experience in software development lifecycle, large-scale computing, modeling, cybersecurity, and/or anomaly detection. Yara, RegEx, or comparable rule-writing experience Insatiable curiosity to learn about attacker patterns and behaviors, with a drive to build innovative detections and protections. Understand the cyber kill chain, especially attack scenarios originating from email or web sites. Understand email headers, email/web security protocols, and related analysis tools. Experience responding to customer escalations and reporting investigative findings. Programming / software development lifecycle experience Experience with sandbox technologies and malware analysis Experience working through ambiguity to drive innovations in detections, monitoring, and internal team processes. Solid understanding of attacker tradecraft associated with email and web-based threats. Broad, general, familiarity with the threat landscape affecting our customers. Experience building automated reports, alerting, workflows, and/or business intelligence solutions (PowerBI). Ability to use data to “tell a story” and influence decision-making. Experience creating, using, or contributing to the development and validation of machine learning models. Security Research IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  }
]