[
  {
    "job_id": "1875896",
    "title": "Software Engineer II - CTJ - Poly",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "None",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1875896/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Preferred/Additional Qualifications: Experience in development in the Kubernetes ecosystem Experience in building large scale cloud services, distributed systems, or operating systems Experience with improving service operations or engineering fundamentals. Experience building and shipping production software or services. Experience developing applications hosted on top of Azure, AWS, or other similar cloud platforms Experience problem solving and debugging skills Proficient collaboration skills. Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 20, 2025. #Silver\nRequired/Minimum Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination.\n• Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n• Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nPreferred/Additional Qualifications:\n• Experience in development in the Kubernetes ecosystem\n• Experience in building large scale cloud services, distributed systems, or operating systems\n• Experience with improving service operations or engineering fundamentals.\n• Experience building and shipping production software or services.\n• Experience developing applications hosted on top of Azure, AWS, or other similar cloud platforms\n• Experience problem solving and debugging skills\n• Proficient collaboration skills.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $100,600 - $199,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $131,400 - $215,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 20, 2025.\n#Silver",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1889043",
    "title": "UX Researcher 2",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889043/",
    "required_qualifications_text": ": Master's Degree in Human-Computer Interaction, Human Factors Engineering, Computer Science, Technical Communications, Information Science, Information Architecture, User Experience Design, Behavioral Science, Social Sciences, or related field AND 1+ year(s) User Experience Research experience OR Bachelor's Degree in Human-Computer Interaction, Human Factors Engineering, Computer Science, Technical Communications, Information Science, Information Architecture, User Experience Design, Behavioral Science, Social Sciences, or related field AND 2+ years User Experience Research experience OR equivalent experience. 1+ years of research and design work experience, with theoretical and practical knowledge of both qualitative (e.g., ethnography), and quantitative (e.g., data analytics), research methodologies, and statistics.",
    "preferred_qualifications_text": ": Ability to help teams develop and drive progress on key metrics as well as have experience in creating research plans. Effective interpersonal skills. Ability to communicate with, and persuade, varied audiences and argue for results (both orally and in writing). Awareness of inclusive design and how it supports Microsoft’s mission. Experience with Security domain. Familiar with agile or lean methodologies. Experience with OpenAI/ChatGPT. Understanding of Large Language Model (LLM) Experience, understanding, and knowledge of Artificial Intelligence. Experience with content design and developing human understanable terminology. UX Research IC3 - The",
    "other_requirements_text": ": The ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1893339",
    "title": "Technical Program Manager II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893339/",
    "required_qualifications_text": ": Bachelor's Degree AND 2+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 2+ years experience managing cross-functional and/or cross-team projects. 2+ years experience managing technical projects consumer or commercial at scale device. Experience managing multiple projects in parallel with conflicting resources and similar timeline. Project planning (Agile and Waterfall) & tracking of feature development and validation. Experience with roadmap definition. Working knowledge of market/competing research along with customer needs. IHV/Partner management. Working knowledge of supply chain/sourcing. Versed with the latest trends in AI. Experience with bug triage.",
    "preferred_qualifications_text": ": Bachelor's Degree AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. USB driver stack in Windows OS. EE Power state/transition. Factory manufacturing and testing. USB Certification/Compliance/Regulation. Excited about Surface product. Ability to operate without guidance and excellent written communication and presentation skills. Experience dealing with hard deadlines and driving creative solutions to meet the target. Able to work remotely with the team. Technical Program Management IC3 - The",
    "other_requirements_text": ": USB, TBT Connectivity and protocols. Experience with SoC (x86 and/or ARM).",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1893672",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893672/",
    "required_qualifications_text": ": Bachelor’s degree in Computer Science or related technical field AND 2+ years of engineering experience coding in languages such as C, C++, C#, Java, JavaScript, or Python OR equivalent experience 1+ years of experience in prompt engineering, working with LLMs and building AI-powered software solutions 1+ years of experience in front-end development using modern JavaScript frameworks and libraries such as React and TypeScript, with a focus on building AI-driven, interactive user interfaces.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1893689",
    "title": "AI Business Solution Offer Strategy",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893689/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing, Computer Science, Business or related field AND 6+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business or related field AND 8+ years experience in business OR equivalent experience. Analytical Skills: Strong quantitative and analytical capabilities, with a proven ability to interpret data, conduct financial and market analysis, and translate insights into business decisions. Technical expertise is a plus. Leadership & Communication: Exceptional communication and leadership skills, with a track record of influencing senior stakeholders and driving cross-functional initiatives within a matrixed organization. Program Management: Demonstrated success in leading complex projects or programs to completion, ideally in fast-paced or high-growth environments. Adaptability: Comfortable with ambiguity and biased toward experimentation and action. Cross-Functional Influence: Proven ability to lead across functions and craft compelling narratives that drive alignment and impact. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1848089",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1848089/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java or Python OR equivalent experience. At least one year of backend or SDK development experience",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java or Python o OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python o OR equivalent experience. At least one year of API design or SDK contract experience At least one year of Distributed systems experience Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1891107",
    "title": "Technical Solutions Manager - D365 Platform Owner",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891107/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1893606",
    "title": "Sr Product Marketing Manager - Outbound Compete Content",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1893606/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing, Computer Science, Business or related field AND 6+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business or related field AND 8+ years experience in business OR equivalent experience. Demonstrates effective communication, presentation, and storytelling skills, with the ability to tailor the content and the delivery to different audiences and formats. Capacity and comfort to learn new areas and shift priorities as business evolves. Organized, and relentlessly focus on actionability of the insights, and scaling the reach of the insights for others to take action . Self-motivated, results-oriented, and customer-focused, with a growth mindset and a passion for learning and innovation. Experience working in a dynamic environment, across a wide variety of stakeholders and disciplines, earning trust and collaborating with Engineering, Business Planning, Finance, and Marketing partners. Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1892536",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892536/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR equivalent experience. 2+ years of experience in development of cloud native L3 (network layer) to L7 (application layer) network traffic management techniques. 2+ years of experience with Kubernetes development.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Golang or Rust OR equivalent experience. Experience developing and maintaining network products in a cloud environment, ensuring reliability and scalability. Trackable record of building and maintaining Kubernetes Layer 3 through Layer 7 (L3–L7) network stack, including Container Network Interface (CNI), service mesh, and related technologies. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1896412",
    "title": "Senior Software Engineer - CTJ - Poly",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896412/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Preferred/Additional Qualifications: 4+ years of experience with PowerShell, C#, or C++. Experience working on large-scale distributed services with on-call responsibilities. Ability to build and influence broadly towards common goals and priorities. Ownership of end-to-end project lifecycle with solid project management skills. Knowledge of common networking protocols and architectures; cloud networking is a plus Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 20, 2025. #Silver\nRequired/Minimum Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination.\n• Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n• Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nPreferred/Additional Qualifications:\n• 4+ years of experience with PowerShell, C#, or C++.\n• Experience working on large-scale distributed services with on-call responsibilities.\n• Ability to build and influence broadly towards common goals and priorities.\n• Ownership of end-to-end project lifecycle with solid project management skills.\n• Knowledge of common networking protocols and architectures; cloud networking is a plus\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 20, 2025.\n#Silver",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1894650",
    "title": "Senior Software Engineer - CTJ - Poly",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "None",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894650/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Preferred/Additional Qualifications: Experience with cross team collaboration and has the skills to maintain harmony while driving results. Possess technical curiosity and openness to new ideas and technologies. Resiliency to thrive in fast-paced environments while keeping the team motivated and engaged. Demonstrated experience balancing hard work with a fun, inclusive team culture. Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October, 20, 2025. #Silver\nRequired/Minimum Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• The successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and/or customer screening requirements may result in employment action up to and including termination.\n• Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n• Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nPreferred/Additional Qualifications:\n• Experience with cross team collaboration and has the skills to maintain harmony while driving results.\n• Possess technical curiosity and openness to new ideas and technologies.\n• Resiliency to thrive in fast-paced environments while keeping the team motivated and engaged.\n• Demonstrated experience balancing hard work with a fun, inclusive team culture.\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $119,800 - $234,700 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $158,400 - $258,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October, 20, 2025.\n#Silver",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1890384",
    "title": "Critical Environment Program Manager",
    "locations": [
      "Chicago, Illinois, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890384/",
    "required_qualifications_text": ": High School Qualification or equivalent AND 3+ years’ experience supporting IT equipment or related technology or delivering server and network deployment projects in large-scale environments OR equivalent experience. 3+ years’ experience in Critical Environment infrastructures (e.g., UPS, Generator, AHU) or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling).",
    "preferred_qualifications_text": ": Bachelor's or Technical College Degree in Computer Science, Math, Telecommunications, Electrical/Mechanical Engineering, Supply Chain Management or related field AND 8+ years’ experience in critical environment infrastructures (e.g., UPS, Generator, AHU), or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling) OR High School Qualification or equivalent AND 10+ years’ experience in critical environment infrastructures (e.g., UPS, Generator, AHU), or working in physical IT infrastructures (e.g., Servers, SANs, Networking, Capacity, DC Rack/Enclosures, structured cabling) OR equivalent experience. Applicable certifications: APICS/Inventory Control, CompTIA, Microsoft, Network Certifications, PMP, ITIL, CDCP. 1+ years' experience working with the operation of building cooling, electrical, mechanical, and life safety systems. 1+ years' experience with Electrical Power Monitoring Systems (EPMS), Branch Circuit Monitoring (BCM), and Building Automation Systems (BAS). 2+ years' experience with project management or relevant certification/training in project management. 2+ years' experience working on large-scale projects. Data Center Operations Management IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $102,600 - $202,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,500 - $225,800"
      }
    ]
  },
  {
    "job_id": "1889054",
    "title": "Business Program Manager-Licensing",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889054/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business, Operations, Finance, or related field AND 6+ years experience in program management, process management, or process improvement OR Bachelor's Degree in Business, Operations, Finance, or related field AND 8+ years experience in program management, process management, or process improvement OR equivalent experience. 8+ years of experience managing complex licensing terms and leading change initiatives, with a focus on delivering business outcomes across cross-functional teams and partner ecosystems. 8+ years of experience applying analytical thinking and creative problem-solving in dynamic environments, with demonstrated ability to prioritize and adapt to evolving business needs. 8+ years of experience collaborating across teams and functions, including negotiation, communication, conflict resolution, and process optimization to support strategic goals. 8+ years of experience working within the server device business and Microsoft’s partner ecosystem, with insight into operational and strategic processes that support global engagements. 8+ years of experience supporting Windows server business operations, including product lifecycle management, technical program execution, and alignment with business priorities. Business Program Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1896534",
    "title": "Senior Program Manager - Microsoft Certified Trainer (MCT)",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 14, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896534/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Experience applying AI and data insights to enhance learning programs, community engagement, or operational efficiency. Experience driving innovation at scale in global learning or technical ecosystems. Experience in community strategy and growth, fostering collaboration, advocacy, and long-term engagement. Knowledge of Microsoft learning products, certification strategy, and partner ecosystem (or similar large-scale credentialing environments). Experience in leading organizational change within dynamic, matrixed environments. Curiosity and adaptability to translate emerging technology trends into practical program advancements. Integrated Learning IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $116,900 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $148,400 - $222,600"
      }
    ]
  }
]