[
  {
    "job_id": "1898881",
    "title": "Principal Data Science Manager",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 13, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898881/",
    "required_qualifications_text": ": Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 7+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 10+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. 5+ years experience in data science modeling, statistics, analytics, business intelligence, or data-driven business strategy. 3+ years people-management experience.",
    "preferred_qualifications_text": ": Previous product analytics, web analytics and or content analytics experience. Interpersonal communication and ability to leverage the data to tell a story. Demonstrated stakeholder management ability including effective prioritization, clear and concise communication, and delivery of actionable data-driven insights. Knowledge on big data processing from raw events to metrics and insights (PySpark/Scala). Knowledge of Content ecosystem, Ads and online shopping metrics. Data Science M5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  }
]