[
  {
    "job_id": "1881943",
    "title": "Senior Learning Solutions Design Architect",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1881943/",
    "required_qualifications_text": "Master's Degree in Psychology, Education, Marketing, English, Communication, or related field AND 3+ years experience in instructional design, experience design, education OR Bachelor's Degree in Psychology, Education, Marketing, English, Communication, or related field AND 4+ years experience in instructional design, experience design, education OR Associate's Degree in Business Administration, Technical Writing, Paralegal, or related field AND 6+ years experience in instructional design, experience design, education OR equivalent experience. 2+ years experience designing and delivering scalable, performance-driven skilling solutions aligned to business outcomes across matrixed or enterprise environments.",
    "preferred_qualifications_text": "Doctoral Degree in Psychology, Education, or related field AND 3+ years experience in instructional design, experience design, education OR Master's Degree in Psychology, Education, Marketing, English, Communication, or related field AND 6+ years experience in instructional design, experience design, education OR Bachelor's Degree in Psychology, Education, Marketing, English, Communication, or related field AND 8+ years experience in instructional design, experience design, education OR equivalent experience. Instructional Design IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1897773",
    "title": "Senior Technical Social Copywriter",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897773/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "5+ years demonstrated growth in writing or content design AND a certification, degree, or training in English, Writing, Human-centered Design, Literature, or related field OR equivalent experience. 3+ years project leadership experience. 2+ years experience in a related content domain/area. 4+ years of experience collaborating with technical employees or subject matter experts. 4+ years of experience of social media platforms, trends, and audience engagement strategies. 4+ years of experience storytelling, writing, and presentation skills. Experience weaving wit, humor, and brevity into complex conversations on social. Ability to manage multiple projects and stakeholders in a fast-paced environment. High attention to detail, coupled with strategic and creative thinking. Writing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1897710",
    "title": "Creative Art Lead, Social",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897710/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree or Certificate in Design, Human Computer Interaction, Visual Communications or related art field AND 12+ years experience in art design or a related art field working on computer games or entertainment OR equivalent experience. 6+ years experience using related software and packages (e.g., Maya, 3DS Max, Photoshop/Adobe suite, Mental Ray, Substance Designer/Painter/Zbrush, SideFX Houdini, After Effects, Unity, Softimage). 2+ years of experience in social creative, content marketing, or visual storytelling OR equivalent experience. Experience and understanding of commercial audiences and B2B (business-to-business) social storytelling. Art IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1822119",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1822119/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience designing and delivering scalable, product ion-grade s ervices, APIs, or developer platforms. Technical fundamentals in distributed systems, concurrency, cloud-native architecture, or database internals.",
    "preferred_qualifications_text": ": Passion for building outstanding developer experiences and empathy for developer workflows. Experience with database systems (PostgreSQL or others), indexing, or AI/ML-driven data access patterns. Familiarity with cloud platforms (Azure, AWS, GCP) and open-source communities. Commitment to continuous learning, innovation, and building an inclusive, high-performing engineering culture. Growth mindset and a desire to contribute, learn, and collaborate in a fast-paced environment. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $98,300 - $193,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $127,200 - $208,800"
      }
    ]
  },
  {
    "job_id": "1900976",
    "title": "Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1900976/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR), the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their U.S. permanent residency or other protected status (e.g., under 8 U.S.C. § 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Apply AI to accelerate engineering while developing shipping & prototype code. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. P ref e rred Q ualifications : Master's Degree or higher in Computer Science or related field. Experience with systems development such as compiler design or operating systems. Effective problem-solving skills, with a solid understanding of software development and testing practices Self-motivated with an ability to succeed in a team-oriented, fast-paced environment. Experience with project tracking and source control. Quantum Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $84,200 - $165,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $109,000 - $180,400 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until October 27, 2025. #Quantum #QuantumCareers #MDQCareers\nRequi red Q u alifica tions :\n• Bachelor's Degree in Computer Science, Software Engineering, Mathematics, Physics, Physical Sciences, or related field OR equivalent experience.\n• 1 + years of experience in software engineering , with coding fluency in C++ , C # or Java (Object Oriented languages).\n• Experience administering and deve loping on Windows.\n• Demonstrated ability to identify problem area s , drive issues to closure and ensure solid root cause understanding.\n• Ability to engage in technical deep dives into software architectures, designs, and implementations, and to collaboratively troubleshoot issues.\n• OR equivalent experience.\nOther Requirements:\n• Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR), the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their U.S. permanent residency or other protected status (e.g., under 8 U.S.C. § 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable.\n• Apply AI to accelerate engineering while developing shipping & prototype code.\n• Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n• Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR), the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their U.S. permanent residency or other protected status (e.g., under 8 U.S.C. § 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable.\nCitizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR), the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their U.S. permanent residency or other protected status (e.g., under 8 U.S.C. § 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable.\nP ref e rred Q ualifications :\n• Master's Degree or higher in Computer Science or related field.\n• Experience with systems development such as compiler design or operating systems.\n• Effective problem-solving skills, with a solid understanding of software development and testing practices\n• Self-motivated with an ability to succeed in a team-oriented, fast-paced environment.\n• Experience with project tracking and source control.\nQuantum Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $84,200 - $165,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $109,000 - $180,400 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\nMicrosoft will accept applications for the role until October 27, 2025.\n#Quantum #QuantumCareers #MDQCareers",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $84,200 - $165,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $109,000 - $180,400"
      }
    ]
  },
  {
    "job_id": "1899172",
    "title": "Principal Global CryoLab Support Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899172/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Doctorate Degree in Mechanical Engineering, Cryogenics, Physics, or related field AND 5 + years experience in industry or in a research and development environment OR Master's Degree in Mechanical Engineering, Cryogenics, Physics, or related field AND 8 + years experience in industry or in a research and development environment OR Bachelor's in Mechanical Engineering, Cryogenics, Physics, or related field + 12 years experience in industry or in a research and development environment OR equivalent experience. Proficient in interpreting system schematics, cryogenic layouts, and technical documentation. Demonstrated problem-solving capabilities with a history of effective troubleshooting in complex lab environments. Understanding of electrical debugging and qualification tests for wiring and amplifiers. Experience with DC, RF, and time-domain test equipment. Knowledge of cryogenic automation, remote monitoring, or system control scripting. Experience managing equipment lifecycle, spare parts, and logistical coordination for supporting geographically distributed labs. Background in multi-site technical operations or global lab infrastructure teams. Effective in communication and coordination across engineering, facilities, and vendor teams. Quantum Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR), the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their U.S. permanent residency or other protected status (e.g., under 8 U.S.C. § 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Ability to work in an “AI-first” environment using modern AI tools to accelerate discovery through hardware development. Ability to leverage AI tools to drive innovation and efficiency (e.g., performance modeling and analysis, research gathering, day to day task automation). Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1897670",
    "title": "Senior Quantum Engineer",
    "locations": [
      "Santa Barbara, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897670/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "3+ years of industry experience in chip or circuit board design and layout like mixed-signal integrated circuits, high-speed RF/digital circuits or equivalent experience. Experience with integrated circuit (IC) or application specific IC design, physical design, physical verification, register transfer level (RTL) to graphic data system (GDS) flow. Experience with industry-standard integrated circuit design tools, e.g. Cadence, Altium, and RF, mixed-signal and integrated-circuit simulation tools, e.g. Ansys, Sigrity, Comsol. Experience with industrial semiconductor device design and fabrication processes and tools like process design kits and electronic design automation. Experience with coding in programming languages such as Python and collaborative code development environments (e.g., Git, GitHub). Knowledge of quantum computing principles and hands-on experience with quantum computing hardware, such as superconducting qubits or spin qubits. Quantum Engineering IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations or Export Administration Regulations, the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their U.S. permanent residency or other protected status (e.g., under 8 U.S.C. 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Ability to work in an “AI-first” environment using modern AI tools to accelerate discovery through both hardware and software development. Ability to design and build AI agents/copilots that assist with experiment setup, log triage, measurement report generation, protocol templating, and knowledge retrieval (e.g. instrument manuals, design docs). Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1897828",
    "title": "Business Analyst – Healthcare",
    "locations": [
      "Atlanta, Georgia, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897828/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $68,300 - $137,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $93,200 - $151,200"
      }
    ]
  },
  {
    "job_id": "1899727",
    "title": "Executive Business Administrator",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899727/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Previous experience working at Microsoft, leveraging knowledge of its culture, processes, and tools to drive impact and deliver results. 3+ years administrative, business support, or customer service experience in an environment with an emphasis on scheduling meetings/events, travel management, and basic administration work. Bachelor's Degree in relevant field (e.g., Business Administration, Human Resources [HR], Marketing, Communications, Psychology, Sociology) OR equivalent experience. 1+ years experience serving as mentor to others. 1+ years' experience reviewing and managing administrative budgets (e.g., for events, morale, travel, training). Business Support ATR-C - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1899069",
    "title": "China Threat Context Analyst",
    "locations": [
      "New York City, New York, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899069/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Finance, Mathematics, Analytics, Engineering, Computer Science, Marketing, Business, Economics or related field OR equivalent experience. Proficiency in reading and listening in Mandarin Chinese.",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under U.S. export control regulations, potentially under the International Traffic in Arms Regulations or the Export Administration Regulations. As a condition of employment, the successful candidate will be required to provide proof of citizenship, for assessment of eligibility to access the export-controlled information. To meet this legal requirement, citizenship will be verified via a valid passport. This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Cloud Screening: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred Experience: Experience living and/or working in the East Asia region. Reading and listening proficiency in additional language skills are a plus, particularly for languages in Asia (e.g., Korean, Japanese, Taiwanese, Cantonese, Filipino, Vietnamese, Malay, Indonesian). 2+ years of experience tracking Chinese threat capabilities, infrastructure, and operational techniques and East Asia geopolitical issues. 2+ years producing actionable threat intelligence or strategic analysis through written reports and products. Quantitative analytic experience is a plus. Experience in using AI platforms and applications. Experience in common database query languages (e.g. SQL, KQL) and Python is a plus. Excellent cross-group collaboration with experience building relationships. Experience leveraging language skills for open-source research. Experience in social media research and analysis, including on platforms frequently used by Chinese actors (e.g., WeChat, Weibo). Strong writing skills. Proficient in Microsoft Excel for data analysis and Microsoft PowerPoint for presentations for executive audiences. Professional analytic experience working on influence, cyber, or AI threats in the East Asia region. Ability to quickly and efficiently sift through data to identify trends, shifts, or key issues to incorporate into synthesized analysis for executive-level customers or decisionmakers. The role is ON-SITE based in our NYC office. LOCATION IS NON-NEGOTIABLE. Some domestic and international travel may be expected, estimated to be less than 10%. Most common travel locations include offices in the Washington, DC area and Microsoft’s Corporate Headquarters, in Redmond, WA. The typical base pay range for this role across the U.S. is USD $68,300 - $137,900 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $93,200 - $151,200 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until 10/29/2025.\nRequired Qualifications:\n• Bachelor's Degree in Statistics, Finance, Mathematics, Analytics, Engineering, Computer Science, Marketing, Business, Economics or related field OR equivalent experience.\n• Proficiency in reading and listening in Mandarin Chinese.\nOther Requirements:\n• Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under U.S. export control regulations, potentially under the International Traffic in Arms Regulations or the Export Administration Regulations. As a condition of employment, the successful candidate will be required to provide proof of citizenship, for assessment of eligibility to access the export-controlled information. To meet this legal requirement, citizenship will be verified via a valid passport.\n• This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport.\n• Cloud Screening: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Experience:\n• Experience living and/or working in the East Asia region.\n• Reading and listening proficiency in additional language skills are a plus, particularly for languages in Asia (e.g., Korean, Japanese, Taiwanese, Cantonese, Filipino, Vietnamese, Malay, Indonesian).\n• 2+ years of experience tracking Chinese threat capabilities, infrastructure, and operational techniques and East Asia geopolitical issues.\n• 2+ years producing actionable threat intelligence or strategic analysis through written reports and products.\n• Quantitative analytic experience is a plus.\n• Experience in using AI platforms and applications.\n• Experience in common database query languages (e.g. SQL, KQL) and Python is a plus.\n• Excellent cross-group collaboration with experience building relationships.\n• Experience leveraging language skills for open-source research.\n• Experience in social media research and analysis, including on platforms frequently used by Chinese actors (e.g., WeChat, Weibo).\n• Strong writing skills.\n• Proficient in Microsoft Excel for data analysis and Microsoft PowerPoint for presentations for executive audiences.\n• Professional analytic experience working on influence, cyber, or AI threats in the East Asia region.\n• Ability to quickly and efficiently sift through data to identify trends, shifts, or key issues to incorporate into synthesized analysis for executive-level customers or decisionmakers.\nThe role is ON-SITE based in our NYC office. LOCATION IS NON-NEGOTIABLE. Some domestic and international travel may be expected, estimated to be less than 10%. Most common travel locations include offices in the Washington, DC area and Microsoft’s Corporate Headquarters, in Redmond, WA.\nThe typical base pay range for this role across the U.S. is USD $68,300 - $137,900 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $93,200 - $151,200 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay Microsoft will accept applications for the role until 10/29/2025.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $68,300 - $137,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $93,200 - $151,200"
      }
    ]
  },
  {
    "job_id": "1861970",
    "title": "Creator Strategist - Developers & Technical Communities",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1861970/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing, Communications, Cultural Studies, or related field AND 2+ years experience in creator marketing, influencer strategy, social content, or digital brand storytelling, or related work experience OR Bachelor's Degree in Marketing, Communications, Cultural Studies, or related field AND 5+ years experience in creator marketing, influencer strategy, social content, or digital brand storytelling, or related work experience OR equivalent experience. Experience in a matrixed or enterprise organization and the ability to balance creative vision with strategic and operational needs. Cross-functional collaboration and communication skills. Familiarity with B2B (business to business) audiences or the ability to make technical topics accessible through creative storytelling and community activation. Fluency in social platform trends and creator formats (TikTok, Instagram, YouTube, LinkedIn, Threads, etc.). Technical fluency with experience using tooling such as VS Code, Microsoft Fabric, Azure AI Foundry, Databricks, Snowflake, GitHub, and more Experience helping large brands earn relevance and credibility in technical spaces Integrated Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1896512",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896512/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, Software Engineering, Mathematics, Physics, Physical Sciences, or related field AND 4+ years software industry experience, including developing commercial software, compilers, scientific computing applications, or multi-component systems OR Master's Degree in Computer Science, Software Engineering, Mathematics, Physics, Physical Sciences, or related field AND 3+ years software industry experience, including developing commercial software, compilers, scientific computing applications, or multi-component systems OR Doctorate in Computer Science, Software Engineering, Mathematics, Physics, Physical Sciences, or related field AND 1+ years software industry experience, including developing commercial software, compilers, scientific computing applications, or multi-component systems OR equivalent experience. 4+ years programming experience in related programming languages including C++ and C#. 4+ years of experience in a collaborative environment. Experience with systems development such as compiler design or operating systems. Experience administering and developing on Windows.",
    "preferred_qualifications_text": ": MS degree or higher in Computer Science or related field . Effective in problem-solving skills, with a solid understanding of software development and testing practices. Self-motivated with an ability to succeed in a team-oriented, fast-paced environment. Experience with project tracking and source control. Quantum Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations or Export Administration Regulations, the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide proof of citizenship, U.S. permanent residency, or other protected status (e.g., under 8 U.S.C. § 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Ability to apply AI to accelerate engineering while developing shipping & prototype code. Ability to leverage AI tools to drive innovation and efficiency (e.g., performance modeling and analysis, research gathering, day to day task automation).",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1897791",
    "title": "Senior Content Creator - User Generated Content",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897791/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business, Marketing, Communications, Economics, Public Relations, or related field AND 2+ years integrated marketing (e.g., digital, relationship, social media, campaign), event management, marketing strategy, business planning, marketing operations, or related experience OR Bachelor's Degree in Business, Marketing, Communications, Economics, Public Relations, or related field AND 5+ years integrated marketing (e.g., digital, relationship, social media, campaign), event management, marketing strategy, business planning, marketing operations, or related experience OR equivalent experience. 5+ year(s) experience in content creation, copywriting, content strategy, or creator marketing OR equivalent experience. Experience writing in different voices for diverse audiences. 5+ years of experience shooting high-quality video content using DSLR and hi-res cameras. 5+ years of experience editing video with post-production software such as CapCut, Premiere Pro, and other relevant Adobe Creative Cloud applications. Demonstrated ability to collaborate with creators and cross-functional teams. 3+ years of experience of social media trends, audience engagement, and platform best practices. Integrated Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1897727",
    "title": "Senior Manager, Creative Art",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897727/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree or Certificate in Design, Human Computer Interaction, Visual Communications or related art field AND 12+ years experience in art design or a related art field working on computer games or entertainment OR equivalent experience. 6+ years experience using related software and packages (e.g., Maya, 3DS Max, Photoshop/Adobe suite, Mental Ray, Substance Designer/Painter/Zbrush, SideFX Houdini, After Effects, Unity, Softimage). Experience shipping 2+ multiple projects or products end to end. 2+ years of experience in social creative, content marketing, or visual storytelling OR equivalent experience. Experience and understanding of commercial audiences and B2B (business-to-business) social storytelling. Art IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1897222",
    "title": "Senior Quantum Simulation Engineer",
    "locations": [
      "Santa Barbara, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897222/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Doctorate in Physics, Engineering, or related field AND 3+ years experience in industry or in a research and development environment (completion of a postdoctoral research position may be included) OR Master's Degree in Physics, Engineering, or related field AND 6+ years experience in industry or in a research and development environment OR Bachelor's Degree in Physics, Engineering, or related field AND 8+ years experience in industry or in a research and development environment OR equivalent experience Experience modeling the dynamics of open quantum systems. Background in topological and mesoscopic device physics. Proficiency with high performance computing environments. Experience with collaborative code development in Python or Julia. Quantum Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations or Export Administration Regulations, the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide either proof of their country of citizenship or proof of their U.S. permanent residency or other protected status (e.g., under 8 U.S.C. 1324b(a)(3)) for assessment of eligibility to access the export-controlled information . To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable. Ability to work in an “AI-first” environment using modern AI tools to accelerate discovery through both hardware and software development. Ability to design and build AI agents/copilots that assist with experiment setup, log triage, measurement report generation, protocol templating, and knowledge retrieval (e.g. instrument manuals, design docs). Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1897798",
    "title": "Senior Software Engineer – Backend",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897798/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3+ years of experience building and operating large-scale cloud services.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience working with authentication stack of services. Experience working with M365 components like Entra (AAD), Exchange, Substrate, SharePoint. Drive to improve performance, availability and supportability of services and systems. Drive to increase efficiency through automation. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1898030",
    "title": "Data Engineer II - Copilot Insights",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898030/",
    "required_qualifications_text": ": Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 1+ year(s) experience in business analytics, data science, software development, data modeling, or data engineering OR Bachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 2+ years experience in business analytics, data science, software development, data modeling, or data engineering OR equivalent experience. 1+ year experience building and maintaining data pipelines with large scale data systems using technologies like the following: query language (SQl, Kusto, or Scope), data orchestration systems (like Azure Data Factories or similar technology), and systems for analyzing data (Python, Synapse, or R).",
    "preferred_qualifications_text": ": Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 3+ years experience in business analytics, data science, software development, data modeling, or data engineering OR Bachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 5+ years experience in business analytics, data science, software development, data modeling, or data engineering OR equivalent experience. 1+ year experience with data governance, data compliance and/or data security. Data Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1899040",
    "title": "Software Engineer II - Microsoft 365 Copilot inference infrastructure",
    "locations": [
      "Multiple Locations, Costa Rica + 2 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899040/",
    "required_qualifications_text": ": Bachelor’s Degree in Computer Science or related technical field AND 2+ years of technical engineering experience coding in languages such as C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience building distributed, near real-time, high-load systems. 2+ years of experience translating requirements into feature implementations.",
    "preferred_qualifications_text": ": Bachelor’s Degree in Computer Science OR related technical field AND 4+ years technical engineering experience OR Master’s Degree in Computer Science or related technical field AND 2+ years technical engineering experience Familiarity with modern software design patterns (microservices, containers, caching, queuing). Experience with one of CUDA kernels, CPU/GPU performance optimization, network latency, and managing large-scale capacity fleets. #M365Core\nRequired Qualifications:\n• Bachelor’s Degree in Computer Science or related technical field AND 2+ years of technical engineering experience coding in languages such as C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• 2+ years of experience building distributed, near real-time, high-load systems.\n• 2+ years of experience translating requirements into feature implementations.\n• OR equivalent experience.\nOther Requirements: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications:\n• Bachelor’s Degree in Computer Science OR related technical field AND 4+ years technical engineering experience OR Master’s Degree in Computer Science or related technical field AND 2+ years technical engineering experience\n• Familiarity with modern software design patterns (microservices, containers, caching, queuing).\n• Experience with one of CUDA kernels, CPU/GPU performance optimization, network latency, and managing large-scale capacity fleets.\n• OR Master’s Degree in Computer Science or related technical field AND 2+ years technical engineering experience\n#M365Core",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1889021",
    "title": "Content Creator - Creators & Fandom",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889021/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in marketing, communications, journalism, or related field AND 3+ year(s) experience in content creation, copywriting, content strategy, or creator marketing OR equivalent experience. Experience writing in different voices for different creators, channels, and audiences. Experience distilling technical or enterprise topics into accessible, engaging content and copy. Integrated Marketing IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $85,100 - $169,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $112,000 - $185,300"
      }
    ]
  },
  {
    "job_id": "1898241",
    "title": "Senior Data Scientist - Copilot Insights",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898241/",
    "required_qualifications_text": ": Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 1+ year(s) data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. 1+ year experience building generative AI applications. 1+ year experience fine-tuning language models.",
    "preferred_qualifications_text": ": Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 7+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. 4+ years of technical leadership in designing and scaling generative AI pipelines (retrieval augmented generation (RAG) , finetuning, evaluation frameworks), with deep knowledge in transformer models and architectures. Data Science IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1855329",
    "title": "Customer Security Officer - Federal Government & Defense Industrial Base - CTJ - Top Secret",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1855329/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": 8+ years technical pre-sales, technical consulting, or technology delivery, or related experience OR equivalent experience. 6+ years experience with cloud and hybrid, or on premises infrastructures, architecture designs, migrations, industry standards, and/or technology management. Certification in relevant technologies or disciplines (e.g., Office 365, Power BI, Azure Architect and Development exams, Cloud Platform Technologies, Information Security, Architecture). Prior experience working with the Federal Government and Defense Industrial Base Industry verticals strongly preferred. Information Security knowledge and/or hands-on experience with any combination of the following: information security competency - including Identity and Access Management, Security Operations (SOC), network security, Security Development Lifecycle (SDL), cryptography, key management, hardware security modules, security architecture and design, operations security, legal/risk/compliance, and physical security. Deep knowledge of security issues & trends, able to articulate the high-level Microsoft security strategy to both technical & non-technical audiences with a detailed understanding of Microsoft 365 and Azure security frameworks, all service-level security capabilities (including details of defense-in-depth implementation – data encryption, data isolation, lock box, customer key, datacenter security, etc.), and all customer controls (identity & access management, RMS, encryption, etc.) In-depth knowledge of security principles, compliance standards and ability to apply them in diverse business contexts., with detailed understanding of current compliance status for industry standard security & audit frameworks (such as ISO27001, HIPAA, SSAE16, FISMA, NIS2, etc.), and compliance features. Experienced and credible communicator who can cast security in the language of the business, discussing Microsoft’s security strategy with CISO & other C-level executives and government representatives and comfortable navigating in complex and high-pressure sales scenarios. Demonstrate ability to influence without authority to drive change with both our strategic customers as well as internal stakeholders. Solution Engineering IC5 - The",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret Security Clearance. Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Additional/",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1900411",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1900411/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Proven experience in design, coding, testing, problem solving, and debugging skills in any language. Experience working across disciplines, groups, and teams. Experience architecting and delivering distributed cloud services, Azure preferred. Experience in building highly available distributed systems at scale. Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1899982",
    "title": "Datacenter Inventory & Asset Technician - CTJ - Top Secret",
    "locations": [
      "Manassas, Virginia, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1899982/",
    "required_qualifications_text": ": High School Diploma AND 2+ years experience in warehouse/supply chain in an information technology (IT) environment, logistics, supply chain, inventory management, retail, or a related field OR equivalent experience.",
    "preferred_qualifications_text": ": 3+ year(s) experience in warehouse/supply chain in an information technology (IT) environment, IT, and/or logistics, operating heavy-load movement equipment (e.g., forklift, pallet jacks, chassis lifts) for a large corporation. OR equivalent experience. Materials Handling ATR-D - The",
    "other_requirements_text": ": Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: The successful candidate must have an active U.S. Government Top Secret Security Clearance . Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate clearance and/or customer screening requirements may result in employment action up to and including termination. Clearance Verification : This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment. Citizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Criminal Justice Information Services: This position requires passing a background check conducted through the CJIS criminal justice information system by authorized local, state, and/or federal agencies.",
    "pay_ranges": []
  },
  {
    "job_id": "1897770",
    "title": "Senior Content Creator - Employee-Generated Content",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897770/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business, Marketing, Communications, Economics, Public Relations, or related field AND 2+ years integrated marketing (e.g., digital, relationship, social media, campaign), event management, marketing strategy, business planning, marketing operations, or related experience OR Bachelor's Degree in Business, Marketing, Communications, Economics, Public Relations, or related field AND 5+ years integrated marketing (e.g., digital, relationship, social media, campaign), event management, marketing strategy, business planning, marketing operations, or related experience OR equivalent experience. 5+ years of experience collaborating with technical employees or subject matter experts. 3+ years of experience of social media platforms, trends, and audience engagement strategies. 5+ years of experience storytelling, writing, and presentation skills. Ability to manage multiple projects and stakeholders in a fast-paced environment. Integrated Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1898193",
    "title": "Principal Ambassador Strategist - Fandom",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898193/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business, Marketing, Communications, Economics, Public Relations, or related field AND 3+ years integrated marketing (e.g., digital, relationship, social media, campaign), event management, marketing strategy, business planning, marketing operations, or related experience OR Bachelor's Degree in Business, Marketing, Communications, Economics, Public Relations, or related field AND 7+ years integrated marketing (e.g., digital, relationship, social media, campaign), event management, marketing strategy, business planning, marketing operations, or related experience OR equivalent experience. 5+ years experience tracking and analyzing program performance using data and analytics tools. 7+ years experience collaborating with marketing, product, and creative teams in a corporate or agency setting. 7+ years experience storytelling, writing, and presentation experience. Integrated Marketing IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1900895",
    "title": "Executive Business Administrator",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 23, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1900895/",
    "required_qualifications_text": "5+ years Administrative, Business Support, or customer service experience in an environment with an emphasis on scheduling meetings/events, travel management, and administration work for executive/upper level management. 1+ year(s) experience serving as a mentor to others.",
    "preferred_qualifications_text": "Bachelor's Degree in relevant field (e.g., Business Administration, Human Resources [HR], Marketing, Communications, Psychology, Sociology) OR equivalent experience. 2+ years experience serving as mentor to others. 3+ years experience reviewing and managing administrative budgets (e.g., for events, morale, travel, training). Business Support ATR-D - The",
    "other_requirements_text": "",
    "pay_ranges": []
  }
]