[
  {
    "job_id": "1903678",
    "title": "Director Business Strategy - Revenue & Profitability",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903678/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration or related field AND 8+ years marketing, strategy, business planning, consulting, banking, finance, economics, and/or partner organization experience OR Bachelor's Degree in Business, Finance, Economics, Liberal Arts, Computer Science, or related field AND 12+ years marketing, strategy, business planning, consulting, banking, finance, economics, and/or partner organization experience OR equivalent experience. 4+ years experience in Strategy, Management Consulting, and/or Finance. Business Strategy IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1871850",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1871850/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience. 1+ years experience writing automation in languages such as, C#, Python, Powershell, and PERL.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 5+ years of experience in software development. Ability to work independently on complex tasks Knowledge of API design such as Netconf, RESTful API, XML APIs, and SNMP. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1887923",
    "title": "Senior Finance Manager, FP&A",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887923/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "4+ years of relevant experience with progressive advancement within your discipline Partnering capabilities, with the ability to influence business partners without direct authority and to appropriately push back when required Self-starter who thrives in ambiguous, fast-moving environments with evolving technology and business model trends Deep understanding of the technology industry, particularly commercial public and private cloud services, business models and economics Ability to communicate complex analysis in a simple way. Executive level oral and written communication skills Proven leadership skills, with demonstrated results in proactively driving and delivering high value/high-impact project results through both individual and virtual-team efforts Demonstrate analytical skills, financial modeling capabilities, and ability to think strategically Financial Analysis IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1894694",
    "title": "Software Engineer II - Calendar",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1894694/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Python or Azure OR equivalent experience. Experience building cloud-native applications and services. Problem solving decomposition and presenting efficient solutions through scalable systems design and understanding of distributed systems, APIs, and telemetry. User experience, product craftsmanship, and solving real-world problems.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Python, or Azure OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 5+ years of experience in software development using C#, .NET, TypeScript, or similar technologies. Experienced using software development agents / assistants to co-develop. Experience with Microsoft Graph, M365 services, or workplace productivity tools. Familiarity with AI/ML concepts, especially in the context of Copilot or agent-based systems. Exposure to hybrid work scenarios, calendar systems, or workplace coordination platforms. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1903667",
    "title": "Business Strategy - Revenue & Profitability",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903667/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration or related field AND 3+ years marketing, strategy, business planning, business consulting, banking, finance, economics, and/or partner organization experience OR Bachelor's Degree in Business, Finance, Economics, Liberal Arts, Computer Science, or related field AND 5+ years marketing, strategy, business planning, consulting, banking, finance, economics, and/or partner organization experience OR equivalent experience. 2+ years experience in Strategy, Management Consulting, and/or Finance. An advanced understanding of technology business models. Willing to take on a big challenge with significant growth potential. Business Strategy IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $85,100 - $169,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $112,000 - $185,300"
      }
    ]
  },
  {
    "job_id": "1903403",
    "title": "Principal AI Applied Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903403/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 8+ years of experience leading large-scale AI systems and cross-org initiatives that shipped. 8+ years of experience in software engineering foundations and hands-on depth in Python plus deep-learning frameworks ( PyTorch / TensorFlow) and modern MLOps /tooling.",
    "preferred_qualifications_text": ": PhD in AI/ML or related field with top-venue publications and/or patents. Experience architecting and deploying LLMs/multimodal models and multi-agent systems in production at scale. Familiarity with Responsible AI frameworks and bias-mitigation techniques. Demonstrated ability to shape product strategy and drive organizational change. Experience with Microsoft’s LLMOps stack: Azure AI Foundry, Azure Machine Learning, Semantic Kernel, Azure OpenAI Service, and Azure AI Search for vector/RAG Applied Sciences IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer , and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1902455",
    "title": "Senior Portfolio Manager, Real Estate",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1902455/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Bachelor's Degree in Business Management, Real Estate, Project Management, or related field AND 5+ years Portfolio Management, Real Estate, or Office Management experience OR 7+ years equivalent experience. Ability to comprehend, analyze, and interpret complex documents and data, demonstrating advanced analytical and quantitative skills to solve multifaceted problems and positively influence partners. Ability to apply long-term, strategic perspective and forecasting, demonstrating organizational skills to develop and prioritize plans at both strategic and execution levels. Understand workplace, financial, and organizational dynamics to deliver successful corporate real estate solutions. Communication skills that include presenting information clearly and respond effectively to sensitive issues. Ability to drive solutions and lead effectively in a fast-paced, dynamic environment. A continuous improvement mindset with a passion for optimizing space solutions and driving innovation within the company. Real Estate Portfolio Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  },
  {
    "job_id": "1881814",
    "title": "Director Sourcing Engineering Manager",
    "locations": [
      "Redmond, Washington, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1881814/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Preferred Requirements: 4+ years of experience in technical sourcing, business development, field application engineering, sales, product line management, or in fields requiring technical & business acumen OR equivalent experience. 3+ years experience in silicon engineering. Sourcing Engineering M5 - The typical base pay range for this role across the U.S. is USD $139,900 - $274,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $188,000 - $304,200 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: US corporate pay information | Microsoft Careers Microsoft will accept applications for the role until November 7th, 2025. #CSCP #CSCPJobs #MSCareerEvents25\nMinimum qualifications:\n• Master's degree in Business, Supply Chain Management, Engineering, Materials Science, or related field AND 6+ years experience in procurement, supply chain, sourcing, engineering, operations, or relevant sales-related roles OR Bachelor's degree in Business, Supply Chain Management, Engineering, Materials Science, or related field AND 8+ years experience in procurement, supply chain, sourcing, engineering, operations, or relevant sales-related roles OR equivalent experience.\n• 2+ years of experience leading a team.\n• OR Bachelor's degree in Business, Supply Chain Management, Engineering, Materials Science, or related field AND 8+ years experience in procurement, supply chain, sourcing, engineering, operations, or relevant sales-related roles\n• OR equivalent experience.\nOther Requirements:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Requirements:\n• 4+ years of experience in technical sourcing, business development, field application engineering, sales, product line management, or in fields requiring technical & business acumen OR equivalent experience.\n• 3+ years experience in silicon engineering.\n• OR equivalent experience.\nSourcing Engineering M5 - The typical base pay range for this role across the U.S. is USD $139,900 - $274,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $188,000 - $304,200 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: US corporate pay information | Microsoft Careers Microsoft will accept applications for the role until November 7th, 2025.\n#CSCP #CSCPJobs #MSCareerEvents25",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1860861",
    "title": "Technical Program Management IC3",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1860861/",
    "required_qualifications_text": ": Bachelor's Degree AND 2+ years experience in engineering, product/technical program management, data analysis, computer science, or product development OR equivalent experience. 1+ years project management experience Ability to communicate complex technical concepts clearly to non-technical stakeholders. Strong skills in cross-functional collaboration, project planning, and risk management.",
    "preferred_qualifications_text": ": Bachelor's Degree AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 1+ year(s) of experience reading and/or writing code (e.g., sample documentation, product demos). Strong understanding of WINDOWS OS technologies including but not limited to commercial use; Windows 11 Enterprise, Windows Server, and Azure Virtual Desktop, infrastructure support, and scalable virtualization. For Consumer; Windows 11 Home & Pro, Microsoft 365 Personal & Family, and Copilot in Windows. And for Windows 365 space; Windows 365 Enterprise, and Business. Experience in industries such as technology, healthcare, or finance, where WINDOWS OS is applied to solve real-world problems. Cloud (OS) proficiencies highly desired. Scrum Master, or other relevant certifications. Technical Program Management IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1898471",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898471/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of experience with distributed systems and cloud services. 1+ year(s) of experience identifying, analyzing, and resolving complex technical issues, ensuring optimal performance, scalability, and user experience.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1882214",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882214/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to C++, C#, Java, JavaScript, or Python OR equivalent experience. 6+ years experience designing, building, and managing high-scale full-stack systems including authentication, microservices, distributed systems, data and analytics workloads, and AI training and inferencing services. 6+ years experience with AI, cloud-based architectural patterns and best practices.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. OR equivalent experience. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1900409",
    "title": "Market Research Manager IC3",
    "locations": [
      "Redmond, Washington, United States + 3 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1900409/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "5+ years experience in data science, research, marketing or business-related roles OR Bachelor's Degree in Business, Marketing, Economics, Social Sciences, Statistics, or related field AND 4+ years experience in data science, research, marketing or business-related roles OR Master's Degree in Business, Marketing, Economics, Social Sciences, Statistics, or related field AND 3+ years experience in data science, research, marketing or business-related roles. 1+ year(s) project management experience. 2+ years experience working with decision makers to define needs and scope research to answer questions. 2+ years creating content that conveys a simple, clear message. Experience working with brand tracking data. Experience with B2B market research, products, or product management. Experience working with market research agencies or in a market research agency to design and execute different types of research. Proficiency with productivity software (e.g., Microsoft 365/Office 365, Google Apps/Workspaces) and communication/collaboration platforms. (e.g., Microsoft Teams, Slack, Zoom, etc.) Proficient verbal, and visual storytelling skills to design research, deliver insights, and impact business decisions. Collaboration skills both within and across groups. Market Research IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $85,100 - $169,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $112,000 - $185,300"
      }
    ]
  },
  {
    "job_id": "1903637",
    "title": "Senior Product Marketing Manager, Commercial eCommerce",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903637/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Marketing, Computer Science, Business or related field AND 6+ years experience in business OR Bachelor's Degree in Marketing, Computer Science, Business or related field AND 8+ years experience in business OR equivalent experience. 3+ years experience with marketing AI products Product Marketing IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1903624",
    "title": "Commercial Transact Enablement Manager",
    "locations": [
      "Reno, Nevada, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1903624/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business, Operations, Finance, or related field AND 3+ years experience in program management, process management, or process improvement OR Bachelor's Degree in Business, Operations, Finance, or related field AND 5+ years experience in program management, process management, or process improvement OR equivalent experience. Strong business knowledge and ability to set clear expectations around business outcomes within a fast paced global multi-site operation Strong data and analytical skills Proven experience of influencing across groups, managing individuals both directly and indirectly to achieve a common goal, with ability to work across cultures effectively Demonstrated change and project management skills Demonstrated collaboration skills with a keen understanding of how to drive results Demonstrated skills in relation to dealing with ambiguity and applying judgement Outstanding attention to detail combined with an ability to see the big picture (be both broad and deep) Excellent written and verbal communication skills (open, confident communicator effective in senior levels of engagement) Business Program Management IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $76,800 - $151,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,800 - $168,000"
      }
    ]
  },
  {
    "job_id": "1887926",
    "title": "Senior Finance Manager, Demand Planning",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 30, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887926/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "4+ years of relevant experience with progressive advancement within your discipline Partnering capabilities, with the ability to influence business partners without direct authority and to appropriately push back when required Self-starter who thrives in ambiguous, fast-moving environments with evolving technology and business model trends Prefer a deep understanding of the technology industry, particularly commercial public and private cloud services, business models and economics Ability to communicate complex analysis in a simple way. Executive level oral and written communication skills Proven leadership skills, with demonstrated results in proactively driving and delivering high value/high-impact project results through both individual and virtual-team efforts Able to demonstrate analytical skills, financial modeling capabilities, and ability to think strategically Financial Analysis IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $96,500 - $188,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $123,500 - $206,400"
      }
    ]
  }
]