[
  {
    "job_id": "1854069",
    "title": "Principal Applied Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 31, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1854069/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 8+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 5+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 3+ years' experience developing and deploying large language models (LLMs), including agentic systems, supervised fine-tuning, and Reinforcement Learning (RLHF) 3+ years' experience designing, implementing, and optimizing Retrieval-Augmented Generation (RAG) pipelines and advanced context engineering.",
    "preferred_qualifications_text": ": 5+ year(s) experience creating publications (e.g., patents, peer-reviewed academic papers). Hands-on experience with modern LLM evaluation techniques, including LLM-as-a-Judge, agentic evaluations, and RAG assessments. A track record of delivering successful, large-scale applied ML projects in an industry setting. Deep understanding of fundamental ML algorithms (supervised, unsupervised) and modern neural network architectures. Experience with MLOps practices, including model versioning, automated testing, monitoring, and CI/CD for machine learning. A record of publication in top-tier scientific venues (e.g., NeurIPS, ICML, ICLR, ACL, EMNLP, KDD). Applied Sciences IC6 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $163,000 - $296,400"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $220,800 - $331,200"
      }
    ]
  }
]