[
  {
    "job_id": "1885742",
    "title": "Sr. Technical Program Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885742/",
    "required_qualifications_text": "Bachelor's Degree AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 2+ years of experience managing cross-functional and/or cross-team projects.",
    "preferred_qualifications_text": "Experience with building services on Azure or other cloud services with use of AI technologies. Experience with data analytics and related technologies, including Kusto (Azure Data Explorer), SQL, ETL technologies, machine learning (ML), Azure AI and PowerBI or other similar technologies. Proven ability to lead through ambiguity while partnering across organizations. Demonstrated ability to come up-to-speed quickly on a new technical domain. Experience using data to drive prioritization and measure progress. Experience managing multiple concurrent projects in a fast-paced environment. Proven collaboration and communication skills (verbal and written). Technical Program Management IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1901368",
    "title": "Principal Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1901368/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 5+ years of experience owning and delivering large-scale projects involving multiple engineers. 2+ years working in AI or LLM based system s.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Proven analytical mindset with a data-driven approach to problem-solving, consistently upholding high standards of quality and engineering rigor. Proven track record of independently owning and delivering technically challenging projects with measurable impact. Fast learner with a demonstrated ability to quickly master new technologies, tools, and domains. Self-motivated and outcomes-focused, with a strong sense of ownership and accountability. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1901123",
    "title": "Senior Researcher – LLM Systems",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1901123/",
    "required_qualifications_text": ": Doctorate in relevant field OR equivalent experience. 2+ years of experience in queuing/scheduling theory and practical request orchestration under SLO constraints. 2+ years of experience in C++ and Python for high-performance systems; reliable code quality and profiling/debugging skills. Demonstrated research impact (publications and/or patents) and shipping systems that run at scale.",
    "preferred_qualifications_text": ": Deep understanding of transformer inference efficiency techniques (attention, paged Key-Value (KV) caching, speculative decoding, Low-Rank Adaptation ( LoRA), sequence packing/continuous batching, quantization). Background in cost/performance modeling, autoscaling, and multi-region DR. Hands-on experience with inference serving frameworks (e.g., vLLM, Triton Inference Server, TensorRT-LLM, ONNX Runtime/ORT, Ray Serve, DeepSpeed-MII). Familiarity with GPU/accelerator memory management concepts to co-design cache/throughput policies. Research Sciences IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1901873",
    "title": "Principal Product Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1901873/",
    "required_qualifications_text": ": Bachelor's Degree AND 8+ years experience in product/service/program management or software development OR equivalent experience. 4+ years experience taking a product, feature, or experience to market (e.g., design, addressing product market fit, and launch, internal tool/framework). 6+ years experience improving product metrics for a product, feature, or experience in a market (e.g., growing customer base, expanding customer usage, avoiding customer churn).",
    "preferred_qualifications_text": ": Bachelor's Degree AND 12+ years experience in product/service/program management or software development OR equivalent experience. 6+ years experience disrupting a market for a product, feature, or experience (e.g., competitive disruption, taking the place of an established competing product). Experience in developing AI applications and solutions and writing evals. Ability to deliver rapid, customer-centric outcomes in emerging AI spaces while staying grounded in focus and clarity amidst the noise of evolving agentic trends. Systems thinking and ability to balance platform consistency with product flexibility. Ability to communicate complex ideas to others, including senior leadership, in a clear, effective, and motivating manner. Proven track record of shipping end user experiences at scale. Demonstrated ability to drive and execute strategic plans; influence strategies across multiple stakeholders considering synergies with other products, cultures, and geographies. Proven experience with negotiating with stakeholders at higher organizational levels to drive decisive actions and orchestrate meaningful business and customer outcomes. Product Management IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1900814",
    "title": "Principal Product Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1900814/",
    "required_qualifications_text": ": Bachelor's Degree AND 8+ years experience in product/service/program management or software development OR equivalent experience. 8+ years of experience in Product and Program Management, delivering technical products in partnership with engineering teams. 8+ years of experience taking a product, feature, or experience to market (design, product-market fit, launch, internal tools/frameworks). 8+ years of experience improving product metrics for a product, feature, or experience (customer growth, usage expansion, churn reduction). 8+ years of experience disrupting markets for a product, feature, or experience (competitive displacement, replacing established products). 8+ years of experience managing complex projects involving multiple partners, with proficient skills in project management, leadership, dependency management, and cross-group collaboration. 8+ years of experience building technical products with engineering partnership and articulating requirements from a tenant perspective.",
    "preferred_qualifications_text": ": Bachelor's Degree AND 12+ years experience in product/service/program management or software development OR equivalent experience. Product Management IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1900825",
    "title": "Back-End Senior & Principal Software Engineer(s)",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1900825/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of experience designing, developing, or maintaining secure software systems , with applied knowledge of authentication , data protection , access control , and secure coding practices. 4+ years of experience working with distributed data processing frameworks such as Apache Spark , Databricks , or similar technologies to transform and manage large - scale datasets . 4+ years of experience designing and developing scalable solutions using microservices architecture and related technologies (e.g., REST, gRPC, Docker, Kubernetes). 2+ years of e xperience building consensus and resolving conflicts across cross - functional teams to drive alignment and effective decision - making .",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 8+ years of experience designing, developing, or maintaining secure software systems , with applied knowledge of authentication , data protection , access control , and secure coding practices. 8+ years of experience working with distributed data processing frameworks such as Apache Spark , Databricks , or similar technologies to transform and manage large - scale datasets . 8+ years of experience designing and developing scalable solutions using microservices architecture and related technologies (e.g., REST, gRPC, Docker, Kubernetes). 4+ years of e xperience building consensus and resolving conflicts across cross - functional teams to drive alignment and effective decision - making . Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1883198",
    "title": "Principal Applied Scientist",
    "locations": [
      "Mountain View, California, United States + 1 more location"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1883198/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 1+ year LLM Generative AI experience with chatbot, reasoning, or similar technologies. 4+ years of experience working with Machine Learning technologies (e.g. Natural Language Processing, Computer Vision, Knowledge Graph )",
    "preferred_qualifications_text": ": Master's Degree in Computer Science, Electrical or Computer Engineering, or related field AND 9+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience Experience in knowledge graph building and entity linking. 1+ year of experience developing end to end analytics solutions or ML systems for real world applications. Have publications at peer-reviewed Data Science/AI conferences (e.g. KDD-Knowledge Discovery and Data Mining, CIKM- Conference on Information and Knowledge Management, SIGIR- Special Interest Group on Information Retrieval, NeurIPS- Neural Information Processing Systems, CVPR- Computer Vision and Pattern Recognition, ICML International Conference on Machine Learning, ICLR- International Conference on Learning Representations, ICCV- International Conference on Computer Vision, and ACL- Association for Computational Linguistics). Applied Sciences IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1901127",
    "title": "Senior Researcher - GPU Performance",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1901127/",
    "required_qualifications_text": ": Doctorate in relevant field OR equivalent experience. 2+ years of experience in GPU architecture, memory hierarchies, parallel computing and algorithm optimization. 2+ years of experience in GPU programming, including performance profiling and optimization tools. Reliable C++ programming skills.",
    "preferred_qualifications_text": ": 5+ years of experience in GPU programming and optimization, expert knowledge of CUDA, ROCm, Triton, PTX, CUTLASS, or similar GPU programming frameworks. Experience with machine learning frameworks (PyTorch, TensorFlow). Familiarity with compiler optimization techniques and background in auto-tuning and automated code generation. Publication record in relevant conferences or journals (MLSys, NeurIPS, ICML, ICLR, AISTATS, ACL, EMNLP, NAACL, ISCA, MICRO, ASPLOS, HPCA, SOSP, OSDI, NSDI, etc.) Research Sciences IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1896398",
    "title": "Principal Applied Scientist",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1896398/",
    "required_qualifications_text": ": Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 4+ years experience in applied science projects from ideation to production—in high-scale environments such as search, recommendation, or conversational AI. 4+ years experience in data analysis at scale, including working with logs, telemetry, and large datasets to uncover behavioral patterns, build evaluation datasets, and derive insights.",
    "preferred_qualifications_text": ": Experience in search and ranking systems, semantic retrieval, and information retrieval at scale. Applied experience with state-of-the-art retrieval and ranking techniques, including: Experience with Dense retrieval models (e.g., DPR, ANCE, ColBERT) Experience with Vector search systems (e.g., FAISS, ScaNN, Milvus, Pinecone) Experience with RAG (Retrieval-Augmented Generation) architectures using LLMs such as OpenAI GPT, T5, or Llama. Experience with Fine-tuning or prompt engineering of large-scale language models for query rewriting, summarization, and document reranking Familiarity with hybrid search strategies, learning-to-rank (LTR) frameworks, and evaluation methodologies for IR systems (offline metrics, A/B testing, relevance judgments). Applied Sciences IC5 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1897988",
    "title": "Solution Area Specialists IC4",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1897988/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Business Administration (i.e., MBA), Information Technology, Information Security, or related field AND 6+ years experience in technology-related sales or account management OR Bachelor's Degree in Computer Science, Information Technology, Business Administration, Information Security, or related field AND 8+ years experience in technology-related sales or account management OR equivalent experience. 5+ years in a consultative role throughout the customer lifecycle. 5+ years of AI selling experience in healthcare cloud-based solutions. 5+ years solutions sales experience for clinical healthcare. Solution Area Specialists IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $107,600 - $187,500"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $145,600 - $205,600"
      }
    ]
  },
  {
    "job_id": "1890622",
    "title": "Applied Scientist II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890622/",
    "required_qualifications_text": "Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience. 1+ years' of hands on experience with generative AI OR LLM (Large Language Models) / ML (Machine Learning)",
    "preferred_qualifications_text": ": Experience with MLOps Workflows, including CI/CD (Continuous Integration and Continuous Delivery/Deployment ) , monitoring, and retraining pipelines. Familiarity with modern LLMOps frameworks (e.g., LangChain , PromptFlow ) A track record of publishing in peer-reviewed venues or filing patents Experience presenting at conferences or industry events A track record of conducting research in academic or industry settings Hands-on experience developing and deploying live production systems Experience across the product lifecycle from ideation to shipping Applied Sciences IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1902939",
    "title": "Senior Software Engineer (CoreAI)",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1902939/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. U nderstanding of engineering infrastructure, tools, and workflows. Analytics skills in research, experiments, and insights generation to solve business problems. Experiene with building dashboards and reports for visualizing complex systems, interactive data, critical business metrics, and other s imilar reports .",
    "preferred_qualifications_text": "Experience and expertise working with data products such as Microsoft Fabric, Databricks, or similar. Experience with data visualization technologies such as PowerBI , Tableau, Grafana , or similar . Prior experience working as a software engineer. Software Engineering IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1887639",
    "title": "Technical Program Manager II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "25-50 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887639/",
    "required_qualifications_text": ": Bachelor's Degree AND 2+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 1+ year(s) of experience managing cross-functional and/or cross-team projects. 1+ year(s) of experience in technical program management, engineering, or data analytics.",
    "preferred_qualifications_text": ": Bachelor's Degree AND 4+ years of experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 4+ year of experience managing cross-functional and/or cross-team projects. 1+ year(s) of experience reading and/or writing code (e.g., sample documentation, product demos). Experience with cloud platforms (Azure, AWS, GCP) and AI/ML tools. Strong analytical skills with experience in data modeling, visualization, and reporting (e.g., Power BI, SQL, Python). Proven ability to communicate across technical and non-technical audiences. Technical Program Management IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1900842",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1900842/",
    "required_qualifications_text": ": ​​Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience developing products or applications powered by Generative AI. 1+ year of experience assessing the quality of Generative AI outputs, including evaluating accuracy, utilizing benchmarks and relevant metrics and proposing enhancement",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with industrial machine learning applications Hands-on project experiences in big data analysis or distributed computing Software Engineering IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. ​​",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1898832",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1898832/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years experience designing and leading large-scale, distributed backend, data, or ML systems in production environments. Demonstrated ability to set technical direction, influence architecture, and mentor engineers to deliver scalable, maintainable, and high-quality systems. Experience driving cross-team engineering initiatives, balancing hands-on contributions with strategic technical leadership.",
    "preferred_qualifications_text": ": Experience working with State-OF-The-Art (SOTA) AI tooling to accelerate software development lifecycle. Experience in data platforms or ML pipelines supporting AI-driven applications. Experience defining and tracking engineering metrics — including performance, reliability, observability, and agility. Reliable understanding of developer productivity tooling and practices that reduce cycle time and increase development velocity. Passion for continuous improvement, technical innovation, and enabling teams to build better software faster. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1902970",
    "title": "Business Administrator",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1902970/",
    "required_qualifications_text": "5+ years Administrative, Business Support, or customer service experience in an environment with an emphasis on scheduling meetings/events, travel management, and administration work for executive/upper-level management. 1+ year(s) experience reviewing and managing administrative budgets (e.g., for events, morale, travel, training).",
    "preferred_qualifications_text": "Bachelor's Degree in relevant field (e.g., Business Administration, Human Resources [HR], Marketing, Communications, Psychology, Sociology) OR equivalent experience. 2+ years experience serving as mentor to others. 3+ years experience reviewing and managing administrative budgets (e.g., for events, morale, travel, training). Effective written, verbal and communication skills. Proficiency in Outlook, Teams, Word, Excel, PowerPoint, Visio and SharePoint Work successfully in a team environment, build effective working relationships inside and outside of the group, ability to navigate complex corporate organization and environment Proven interpersonal, organizational & planning skills and time management The ability to manage routine tasks proactively and effectively, prioritize own work and resources to complete projects on time as required , identifying and seeking ways to resolve issues should they occur Business Support ATR-D - The",
    "other_requirements_text": "",
    "pay_ranges": []
  },
  {
    "job_id": "1887034",
    "title": "Senior Product Manager",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 25, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887034/",
    "required_qualifications_text": ": Bachelor's Degree AND 5+ years experience in product/service/project/program management or software development OR equivalent experience. 3+ years of working experience in the payments or fintech domain.",
    "preferred_qualifications_text": ": A growth mindset that enables working in ambiguous environments and finding product market fit. Ability to work on complex systems at scale by partnering closely with engineers to build products. Written and verbal communication skills. Help lead strategic direction and product decisions across team and other cross-functional teams. Experience in Payments, Payments processing, Financial Services or Fintech. Product or technical product management experience held at fast-growing, dynamic, technology company known for good product management discipline. Product Management IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  }
]