[
  {
    "job_id": "1872630",
    "title": "Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 12, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1872630/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical discipline OR equivalent experience. Proven experience coding in languages C, C++, Rust, C#, and/or Python",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, Rust, C#, or Python OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, Rust, C#, or Python OR equivalent experience. Coursework in distributed and operating systems. Software Engineering IC2- The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1891111",
    "title": "Sr. Content Designer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Nov 12, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891111/",
    "required_qualifications_text": ": Master's Degree in Arts, Humanities, Digital Communications, UX Design, Human Computer Interaction, Communications, English, Journalism, or related field AND 2+ years experience working in product or service design OR Bachelor's Degree in Arts, Humanities, Digital Communications, UX Design, Human Computer Interaction, Communications, English, Journalism, or related field AND 3+ years experience working in product or service design, copywriting, technical writing, writing (e.g. for marketing, advertising, e-commerce), brand design, or brand marketing OR equivalent experience Experience strategizing and designing the experience of products.",
    "preferred_qualifications_text": ": Solid portfolio demonstrating high craft, strategic thinking, and impact across multiple product areas. (please provide password if applicable) Experience with prototyping tools and design systems. Proven track record of designing and delivering content strategies for complex, large-scale products. Experience mentoring peers and contributing to the growth of a content design discipline. Ability to advocate for design thinking and influence outcomes in fast-paced, ambiguous environments. Deep understanding of customer-centered design, UX writing, and information architecture. Ability to synthesize research and data into actionable content strategies. Content Design IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  }
]