[
  {
    "job_id": "1883038",
    "title": "General LAB Support Hardware Engineer",
    "locations": [
      "Mountain View, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Sep 29, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1883038/",
    "required_qualifications_text": "Master's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, or related field AND 3+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, or related field AND 5+ years technical engineering experience OR equivalent experience. 5+ years of experience in Technical operations related to Server System architecture that includes server functionality, network requirements and management, mechanical and electrical specification application, and software & firmware application in engineering labs or datacenter environments and/or data center operations.",
    "preferred_qualifications_text": "Experience with Rack and stack of servers and kit to cabinets. Physical installation and/or removal of equipment within the Data Center or Intermediary Data Facilities. Experience Liquid loop preparing and assembly Background with system level qualification, validation, I/O interconnect, PCIE high speed data switches. Solve and support projects (OU creation / Group Policy / MECM / Image builds / Maintenance Automation / Monitoring Automation, Debug and Solutions. Experience with VM manipulation and PowerShell scripting Experience with lab test equipment setups for signal measurement using oscilloscopes and the capability to read and interpret schematic diagrams. Good written and verbal communication & organization skills. Ability to work well independently and on a team. A collaborative spirit and a growth mindset. Customer and results oriented with attention to security, quality, safety, and details. Motivated to continuously learn and improve existing solutions. Hardware Engineering IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  }
]