[
  {
    "job_id": "1889809",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889809/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 12+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 7+ years of experience designing, developing, or maintaining secure software systems , with applied knowledge of authentication , data protection , access control , and secure coding practices 7+ years of experience building systems with emphasis on reliability , durability , and operational efficiency , including experience with live site operations , incident response , and performance optimization .​ 4+ years of experience designing, building, and operating scalable , highly available cloud services or distributed systems on platforms such as Azure , AWS , GCP , or comparable cloud environments , with production ownership and CI/CD pipeline integration .​ 4+ years of experience applying distributed systems concepts such as concurrency , conflict resolution , and consensus algorithms to build resilient and maintainable back - end architectures .​ Demonstrated ability to own and deliver projects and results of increasing technical complexity Proficient program management skills for organizing information, breaking down complex problems, and working effectively in situations involving uncertainty Demonstrated ability to communicate business and technical ideas to varied audiences across disciplines, including peer engineers, product managers and management Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1890289",
    "title": "Senior Data Scientist - Azure Storage",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1890289/",
    "required_qualifications_text": ": Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 1+ year(s) data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techn OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical tec OR equivalent experience. 3+ years of applied data science experience, including building and deploying machine learning models at scale. 3+ years of skilled in Python, R, or Scala, with SQL capabilities and hands-on experience using ML frameworks like scikit-learn, PyTorch, and TensorFlow. 3+ years proficiency in Generative AI models such as GPT (Generative Pre-trained Transformer), T5 (Text-to-Text Transfer Transformer), and BERT (Bidirectional Encoder Representations from Transformers), using frameworks like Hugging Face and OpenAI. 3+ years of demonstrated success in leading experimentation (A/B testing and causal inference), collaborating across cross-functional teams, and communicating technical insights clearly to non-technical audiences.",
    "preferred_qualifications_text": ": Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, OR related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, OR related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, OR related field AND 7+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) OR equivalent experience. 1+ year(s) experience working with cloud-based technologies and big data solutions (e.g., Hadoop, Spark). 1+ year(s) exposure to semantic search, knowledge graphs, or Copilot integration, and p roficiency deploying solutions in Azure Services and Managing Azure Subscriptions. 1+ years of analytical skills with a systematic and structured approach to software design of demonstrated ability to lead projects independently and influence cross-functional teams, supported by stakeholder management and communication skills. Data Science IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1891698",
    "title": "Principal Innovation Hub Solution Engineer, Cloud and AI",
    "locations": [
      "New York, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891698/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": AI Solution Design Experience: Expertise in designing architectures and hands-on experience building and deploying AI. Experience with Copilot Studio, AI Foundry, Large Language Models, prompt engineering, agentic architecture, responsible AI practices and familiarity with emerging industry standards such as MCP and A2A. Understanding of AI - related Azure services such as Cognitive Services and more. Certification in relevant technologies or disciplines Azure Certifications: AI-102 Azure AI Engineer Associate or AZ-305 Azure Solutions Architect Expert or DP-600 Fabric Analytics Engineer Associate or DP-700 Fabric Data Engineer Associate or AZ-204 Azure Developer Associate or other domain-relevant certifications from different vendors Design Thinking: Proven experience of delivering design thinking; ‘ ideation ’; or similar context analysis / problem framing. AI and Application Design Expert : E xtensive, hands-on experience on developing API s using microservices and modern application development techniques. Experience with SDLC leveraging Azure DevOps, GitHub Enterprise, or similar tools. Architectural experience of guiding enterprise customers on developing modern applications with AI technologies. Adept at solution design, development, integration, governance, compliance, and security, this role drives operational excellence and responsible AI transformation through scalable, secure, and sustainable solutions. Enterprise Architect Experience: Proven experience as an Enterprise Architect, designing and implementing large-scale, complex solutions that align with business goals and technical requirements. Ability to integrate various technologies and platforms to create cohesive and scalable architectures. Experience with cloud and hybrid infrastructures, adjacent technologies, architecture designs, migrations, and industry standards. Strategic & Structured Facilitator: Validated customer experience in requirements capture; prioritization; capturing evidence and impact to quantify business value; issue, risk and constraint identification with a focus on strategic goals and outcomes. Use of consultative selling skills to navigate complex technical landscapes, establish trust and deliver tailored solutions that meet specific customer needs. Solution Engineering IC5 - The",
    "other_requirements_text": ": Microsoft is unable to sponsor a work visa for this role due to the nature of the role’s job duties.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $130,900 - $251,900"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $165,600 - $272,300"
      }
    ]
  },
  {
    "job_id": "1891637",
    "title": "Senior Software Engineer - AI for Security",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891637/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience building, scaling, and operating Azure cloud services. 2+ years of relevant industry experience driving research incubations to Production to drive real world impact. 2+ years of experience building customer solutions or open-source projects using ML/generative AI and/or multi-agent frameworks such as AutoGen, LangChain, LangGraph, crewAI, or equivalent.",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with training and fine-tuning of transformer-based models, information retrieval or reinforcement learning Experience in safety and ethical aspects of AI. Experience with MLOps. Experience in working with large-scale datasets. Experience in cyber security and safety domains, such as malware detection, fraud prevention, cyber-physical systems, adversary tradecraft, emerging threats or SOC operations Experience with code contributions to products and/or open-source projects. Experience with large-scale data processing and distributed compute tools such as Cosmos, Azure Data Explorer, Kusto, Azure Data Factory, Azure AML pipelines, Spark, Synape, or Dask. Experience with building and deploying services on Azure including Azure Functions, Azure Containers, Azure DevOps pipelines, Github actions, Github Codespaces, and Jupyter Notebooks. Software Engineering IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1841367",
    "title": "Principal Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1841367/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $139,900 - $274,800"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $188,000 - $304,200"
      }
    ]
  },
  {
    "job_id": "1886878",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1886878/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages C# and/or Python OR equivalent experience. 4+ years of demonstrated understanding of software architecture and design patterns. 1+ years of experience in AI engineering, and optimizing the efficiency of LLM solutions. 1+ years experience with distributed systems and cloud platforms.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C# and/or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to C# and/or Python OR equivalent experience. 5+ years of professional software development experience. Experience with Azure preferred. Experience with semantic data pipelines, ML model integration, or UX development. Familiarity with tools like Aether, Cosmos DB, Object Store, and XAP. Contributions to open-source projects or published research. Experience with Agile methodologies and DevOps practices. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1891105",
    "title": "Escalation Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891105/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Microsoft Technology Certifications. 2+ years of experience in one or more of the following: Microsoft Azure Platform, Azure Networking Services, Azure Virtual Machine, Azure Storage, Microsoft Azure Analytics – Azure Databricks, JAVA, JavaScript, Python, R, Scala, REST concepts, PowerShell. Experience with Data Integration solutions and services. Experience with Open-Source technology preferred. Service engineering and/or DevOps experience at internet scale involving user data and/or software development for an enterprise level product. Superior problem solving and troubleshooting skills, an ability to use various data collection tools and methodologies to analyze problems and develop solutions. Technical Support Engineering IC5 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and / or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire / transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $106,400 - $203,600"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $137,600 - $222,600"
      }
    ]
  },
  {
    "job_id": "1882749",
    "title": "Senior Software Engineer - Azure Compute",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882749/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience. 1+ year(s) of experience in incident management, debugging large-scale distributed systems, and collaborating across teams to align on complex technical issues.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ year(s) of experience with Microsoft Azure Software Development Kits (SDKs) and Representational State Transfer (REST) Application Programming Interfaces (APIs), along with a deep understanding of compute orchestration, asynchronous operations, and service reliability. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1883665",
    "title": "Senior Software Engineer - Azure Kubernetes Service",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1883665/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience. 4+ year(s) experience with Kubernetes, Go programming language (Golang), and cloud-native technologies.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 6+ year(s) experience with Kubernetes, Go programming language (Golang), and cloud-native technologies. 4+ year(s) experience building and operating cloud-based and distributed systems, with a strong understanding of scalability, reliability, authentication, and authorization in production environments. 1+ year(s) experience working with artificial intelligence (AI) and agentic technologies, such as large language models (LLMs), autonomous agents, or AI-assisted development tools including GitHub Copilot, security analyzers, and anomaly detection systems. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1887174",
    "title": "Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887174/",
    "required_qualifications_text": "Bachelor's Degree (or currently pursuing a degree) in Computer Science or related technical discipline, OR equivalent experience. Proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. Experience designing and implementing large-scale cloud services. Experience building extensible, maintainable services designed for long-term scalability and reliability.",
    "preferred_qualifications_text": "Bachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. OR Master's Degree (or currently pursuing a degree) in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. Experience designing, developing, and shipping software solutions on cloud platforms (e.g., Azure, AWS, Google Cloud). Familiarity with UX technologies such as Angular or React. Experience building scalable web services, REST APIs, and working with SQL/NoSQL data stores. Knowledge of distributed systems, microservices architecture, scalability patterns, and high-availability design. Proven problem-solving skills with a data-driven approach to debugging and performance optimization. Experience participating in and leading technical discussions. Experience deploying, monitoring, and operating services in the cloud. Software Engineering IC2 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $84,200 - $165,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $109,000 - $180,400"
      }
    ]
  },
  {
    "job_id": "1887378",
    "title": "Back-End Senior Software Engineer - Security AI",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1887378/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 3+ years of experience designing, developing, or maintaining secure software systems , with applied knowledge of authentication , data protection , access control , and secure coding practices . 3+ years of experience designing, building, and operating scalable, highly available cloud services or distributed systems on platforms such as Azure, AWS, GCP, or comparable cloud environments , with production ownership and CI/CD pipeline integration .​ 2+ years of experience applying distributed systems concepts such as concurrency, conflict resolution , and consensus algorithms to build resilient and maintainable back-end architectures .​ 2+ years of experience building systems with emphasis on reliability , durability , and operational efficiency , including experience with live site operations , incident response , and performance optimization .​",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience designing or working with secure execution environments (e.g., sandboxing , containerization , virtualization ) for safe workload handling , including exposure to malware analysis or threat intelligence workflows . 2+ years of experience in MLOps , AIOps , or SecDevOps , including deploying and maintaining ML/AI services on cloud platforms such as Azure , AWS , or GCP , with a focus on automation , scalability , and security .​ Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1863449",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1863449/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of experience architecting and scaling solutions using cloud technologies. 3+ years of experience proven track record of ensuring system security, scalability, reliability, and maintainability. 1+ year of experience hands-on experience designing and deploying AI/LLM-based solutions in production environments. 1+ year of experience implementing DevOps practices, including CI/CD pipelines, containerization, and infrastructure-as-code.",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with optimizing, prompting and finetuning AI-based solutions for performance, accuracy, and scalability is preferred but not required. Demonstrated ability to leverage generative AI to create innovative, user-centric product features. Experience in Agentic development will be preferred. Experience coaching and growing engineers within the team. Software Engineering IC4 - The",
    "other_requirements_text": "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1882254",
    "title": "Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882254/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Rust, Java, or Python, or Python OR equivalent experience. Demonstrated technical experience in cloud computing, distributed systems, and/or high-performance computing (HPC) systems. Demonstrated experience designing, building and deployment distributed systems. Demonstrated experience maintaining high service reliability and availability for distributed systems.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science OR related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR equivalent experience. Familiarity with Microsoft Azure cloud technology and Microsoft software development tools. Experience with Linux, containers, and related cloud-native open-source technologies. Experience with high-performance computing workloads and/or job schedulers. Knowledge of networking fundamentals. Software Engineering IC2 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $84,200 - $165,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $109,000 - $180,400"
      }
    ]
  },
  {
    "job_id": "1891916",
    "title": "Research Intern - Artificial Intelligence",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1891916/",
    "required_qualifications_text": "Currently enrolled in a Master or PhD program in Computer Science, Electrical Engineering, Mathematics or a related field.",
    "preferred_qualifications_text": "Ability to work independently and collaboratively in a dynamic and vibrant research environment. Willingness to embrace knowledge outside your field of research interest. Solid programming skill in Python, PyTorch and experience conducting experiments and writing papers. Familiarity with current various world modeling methods. Experience in LLM, either pre-train or post-train. Experience in RL, Computer Vision or Signal Processing is a plus. Relevant publications such as CVPR, ACL, ICML, ICCV, ECCV, NeurIPS, ICLR, EMNLP etc. Applied Sciences IC2 :",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $5,460 -$10,680"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $7,040 -$11,640"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,550 -$12,880"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,480 - $13,"
      }
    ]
  },
  {
    "job_id": "1872398",
    "title": "Applied Scientist II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1872398/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience. 1+ years of experience training/fine tuning AI/ML models, preferably LLMs/SLMs (small language model). 1+ years' experience with productization or shipping ML and/or AI components for large-scale internet applications. Demonstrated experience with deep learning techniques (e.g., Transformers, RNNs, CNNs, reinforcement learning) and machine learning frameworks (Python, PyTorch, TensorFlow, ONNX). Experience working with multimodal data and models (e.g., text, vision, speech, structured signals) and/or retrieval-augmented generation (RAG).",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics predictive analytics, research) OR Master's Degree in Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR equivalent experience. 1+ year(s) experience creating publications (e.g., patents, peer-reviewed academic papers). Experience creating or deploying evaluation frameworks that drive model improvement, data synthesis, or system-level design. Solid background in applied research with ability to translate evaluation insights into new models, end-to-end solutions, and research directions. Proficiency with C/C++ or other performant programming languages a plus. Applied Sciences IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1889671",
    "title": "Senior Research Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889671/",
    "required_qualifications_text": "Bachelor's Degree in Computer Science , or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, CUDA, Python, PyTorch , or Rust OR equivalent experience. 3+ years’ research or engineering experience building large scale AI infrastructure, ML systems , and/or HPC systems .",
    "preferred_qualifications_text": "5 years of experience in engineering roles building large scale AI infrastructure, ML systems, and/or HPC systems , or 3 years of experience in such roles with a PhD or equivalent advanced degree in a relevant area . Active participation in engineering efforts in the above areas, with involvement in building and maintaining systems . Active particip ation in research as demonstrated by publications . Demonstrable ability to work in a multi-disciplinary team. Software Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1864529",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1864529/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years of experience designing & shipping production software. 4+ years of experience with algorithms, data structures, and design patterns.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Proven Application Design: Your track record includes designing and delivering high-performance, reliable, accessible, and secure applications for a vast user base. Data-Driven Development: You're adept at instrumenting apps and leveraging analytics and A/B testing to guide feature development. Agile Methodology: You're well-versed in Agile practices, frequent app releases, and the modern software development lifecycle. Collaborative Approach: You excel at partnering with teams both locally and globally within Microsoft, as well as contributing to the Open Source community. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1889691",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889691/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of hands-on coding experience shipping products across multiple release cycles.",
    "preferred_qualifications_text": ": 2+ years of experience designing and developing production quality software using C/C++; proven experience in improving product performance. Extensive and specialized knowledge in one or more of the following areas: Database/OS internals, Big Data technologies, Hardware knowledge (CPU/System/Networking/Storage..), and Cloud related technologies. 2+ years of experience related to Performance Engineering skills covering design/development/usage of performance workloads/test-suites/Tools to measure, analyze and root cause performance and scalability issues in the product. Experience in both Windows and Linux system administration fundamentals. Methodical problem-solving, interpersonal, and communication skills Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1863901",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1863901/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ years Industry experience in Identity Frameworks including Oauth , Authentication, Authorization, OpenID Connect, JWT, Cryptography, CyberSecurity . 2+ years Industry experience with cloud-based systems at scale.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science, Information Technology, or related field AND 3+ years technical experience in software engineering, network engineering, or systems administration OR Bachelor's Degree in Computer Science, Information Technology, or related field AND 5+ years technical experience in software engineering, network engineering, or systems administration OR equivalent experience. Experience with building cloud-scale infrastructure components. Awareness, passion, and experience related to cloud scale distributed design and patterns. Familiarity with secure software design concepts. Demonstrated experience delivering delivering projects that include multiple components. Ability and eagerness to work across and partner with multiple engineering teams to achieve business goals. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1888632",
    "title": "Senior Verification Engineer",
    "locations": [
      "Redmond, Washington, United States + 7 more locations"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1888632/",
    "required_qualifications_text": ": Master's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, or related field AND 3+ years technical engineering experience OR Bachelor's Degree in Electrical Engineering, Computer Engineering, Mechanical Engineering, or related field AND 5+ years technical engineering experience OR equivalent experience. 4+ years of verification experience. 3 years of developing UVM-based testbenches or completion of formal design verification (DV) training.",
    "preferred_qualifications_text": ": Experience as a technical team lead in verification or hardware development projects. Proficiency in Python and/or Perl for scripting and automation. Experience with FPGA design, implementation, and debug tools. Expereince in leveraging Copilot or LLM-based tools to enhance productivity and verification workflows. Hardware Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1872588",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1872588/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience in design and implementation of large-scale cloud services. Experience with data analysis and machine learning.",
    "preferred_qualifications_text": ": 3+ years of hands-on software design and coding experience. Knowledge of modern engineering practices like automated deployments with integrated quality gates and experience working with modern version control systems like Git. Building extensible and maintainable services that last the test of time. Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1857059",
    "title": "Senior Software Engineer - AI Frameworks",
    "locations": [
      "Mountain View, California, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1857059/",
    "required_qualifications_text": ": Bachelor's degree in computer science , or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to , C, C++, C#, Python OR equivalent experience. 4 + years of experience in AI frameworks, large scale distributed computation, system programming, compiler or machine learning. 4 + years of experience successfully collaborating with cross functional teams , owning deliverables and driving results to meet business objectives . 2+ years of experience building Android applications from scratch.",
    "preferred_qualifications_text": ": Experience working on systems performance optimization. Experience working with Open-Source code. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1889686",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889686/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of hands-on coding experience shipping products across multiple release cycles.",
    "preferred_qualifications_text": ": 2+ years of experience designing and developing production quality software using C/C++; proven experience in improving product performance. Extensive and specialized knowledge in one or more of the following areas: Database/OS internals, Big Data technologies, Hardware knowledge (CPU/System/Networking/Storage..), and Cloud related technologies. 2+ years of experience related to Performance Engineering skills covering design/development/usage of performance workloads/test-suites/Tools to measure, analyze and root cause performance and scalability issues in the product. Experience in both Windows and Linux system administration fundamentals. Methodical problem-solving, interpersonal, and communication skills Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1892617",
    "title": "Research Intern - Gray Systems Lab (GSL)",
    "locations": [
      "Redmond, Washington, United States + 2 more locations"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892617/",
    "required_qualifications_text": "Currently pursuing a PhD degree in computer science, statistics, mathematics, or related technical field.",
    "preferred_qualifications_text": "Experience with one or more general purpose programming languages, such as Python, Java, C#, C++, Rust. Experience with one of the following: PostgreSQL, MySQL, SQL Server, Spark, Apache Iceberg, CUDA, or other database or big data systems. Experience contributing to research communities and/or efforts, including publishing papers (being listed as author) at academic conferences. Take initiative but also follow a research/productization plan and work well as part of a team. Excellent critical thinking and communication skills. The base pay range for this internship is",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,710 - $13,270"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,760 - $14,360"
      }
    ]
  },
  {
    "job_id": "1863969",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1863969/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java OR equivalent experience. 4+ years of experience in at least one of the following Identity Frameworks or security domains: OAuth, Authentication, Authorization, OpenID Connect, JSON Web Token (JWT), Cryptography, or Cybersecurity.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with building cloud-scale infrastructure components. Collaborate with partner teams to meet the engineering goals in a unified manner. Experience in delivering and interacting with REST API’s and web services across multiple systems. Able to learn new systems and adapt new methodologies to our service. Awareness, passion, and experience related to cloud scale distributed design and patterns. Proven track record of delivering projects that include multiple components. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $117,200 - $229,200"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $153,600 - $250,200"
      }
    ]
  },
  {
    "job_id": "1888027",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1888027/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years experience designing, developing, testing, and rolling out web services utilizing technologies including, but not limited to, C#, PowerShell, and ASP.NET.",
    "preferred_qualifications_text": ": Proficiency in one or more programming languages (e.g., C++, C#, Java, Python). Design, coding, problem solving, analytical and communication skills. Understanding of data structures, algorithms, and distributed systems. Excellent communication and collaboration abilities. Adept at learning and adapting to new technologies and tools, with a focus on distributed systems. Demonstrated commitment to Microsoft's core values and growth mindset. #W+DJOBS\nRequired Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n• 2+ years experience designing, developing, testing, and rolling out web services utilizing technologies including, but not limited to, C#, PowerShell, and ASP.NET.\n• OR equivalent experience.\nOther Requirements :\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nPreferred Qualifications :\n• Proficiency in one or more programming languages (e.g., C++, C#, Java, Python).\n• Design, coding, problem solving, analytical and communication skills.\n• Understanding of data structures, algorithms, and distributed systems.\n• Excellent communication and collaboration abilities.\n• Adept at learning and adapting to new technologies and tools, with a focus on distributed systems.\n• Demonstrated commitment to Microsoft's core values and growth mindset.\nProficiency in one or more programming languages (e.g., C++, C#, Java, Python).\n#W+DJOBS",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": []
  },
  {
    "job_id": "1876573",
    "title": "Senior Cloud Network Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1876573/",
    "required_qualifications_text": ": Master's Degree in Electrical Engineering, Optical Engineering, Computer Science, Information Technology, or related field AND 1+ year(s) technical experience in network design, development, and automation OR Bachelor's Degree in Electrical Engineering, Optical Engineering, Computer Science, Information Technology, or related field AND 2+ years technical experience in network design, development, and automation OR equivalent experience. Experienced managing enterprise grade optical transport systems and provisioning, troubleshooting, and maintaining long-haul and metro optical networks. Experienced with optical performance management tools, and optical transmission technologies including DWDM, CWDM, ROADM, and OTN. Experienced with fiber characterization technologies (OTDR, CD, PMD, etc). Experienced interpreting fiber plant documentation and optical schematics. Experienced with network design and capacity planning. Additional Qualifications: Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "preferred_qualifications_text": ": 3+ years experience managing enterprise grade networks Understanding of network routing protocols (ISIS, OSPF, BGP). Understanding of TCP/IP. Experienced with automation and scripting (Python, Ansible) for network provisioning and monitoring. Proficient in evaluating optical performance metrics including OSNR, BER, and Q-factor to ensure signal integrity across metro and long-haul DWDM deployments. Experience in simulating and planning high-capacity optical transport networks using professional-grade design tools Understanding of fiber types, key performance metrics, and deployment standards across OSP and transport environments Cloud Network Engineering IC4 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1889327",
    "title": "Software Engineer II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889327/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Rust, C#, Java, JavaScript, or Python OR equivalent experience. 1+ year(s) technical experience working in low level systems development (Ex. networking, drivers, etc.). 1+ year(s) technical experience with computer networking, and general cloud technologies.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++,Rust C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1882868",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1882868/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years of experience in coding, debugging, algorithm design, and problem-solving skills.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. OR Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience in developing full stack web applications – from front end to back end. Experience with Experimentation and Data Analysis. Experience with Machine Learning. Experience working with LLMs. Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1885878",
    "title": "Senior Software Engineer - Azure Policy Team",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885878/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Go, Java OR Python OR equivalent experience. 2+ years experience working with Azure Cloud services.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Go, Java OR Python. OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Go, Java OR Python OR equivalent experience. 2+ years experience working with Azure Cloud services. 2+ years experience with Kubernetes, containers or other Cloud Native technologies. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1885826",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1885826/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience 1+ year experience with agentic AI development including, but not limited to Large Language Models (LLMs), Semantic Kernel, and LangChain",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 8+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python. OR equivalent experience. 2+ years demonstrated familiarity and passion for AI technologies. Previous experience with Windows development. Communicates effectively and has experience working across disciplines and functions.‌ All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form . The",
    "other_requirements_text": "s : Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1857074",
    "title": "Applied Scientist, Gaming AI",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1857074/",
    "required_qualifications_text": "Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field O R equivalent experience. 2+ years of experience developing machine learning solutions AND 1+ year(s) customer-facing, project-delivery experience, professional services, and/or consulting experience. Proficiency in SQL and Python (or R), with experience using data science libraries and tools Experience with ML infrastructure (e.g., model deployment, evaluation, optimization, debugging).",
    "preferred_qualifications_text": "Proficiency in one statically typed language (C#, Java, C, C++). Familiarity with software engineering principles and practices. Experience working with real-world noisy data. Outstanding communication and collaboration skills. Previous exposure to the gaming industry. Visionary Thinking: Demonstrate a proven ability to think beyond the immediate scope, envisioning future possibilities and trends within the ever-evolving landscape of technology and incubation products. Comfort with Ambiguity: Thrive in an environment characterized by uncertainty and ambiguity. Possess the adaptability and resilience to navigate uncharted territories, embracing the challenges of operating in the unknown. Intellectual curiosity and aptitude for learning capacity. Effective problem-solving acumen and critical thinking skills. Ability to thrive in a dynamic, fast-paced work environment. Applied Sciences IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1841261",
    "title": "Software Engineer II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1841261/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Broadcom/VMware Certifications Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1850060",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1850060/",
    "required_qualifications_text": ": Bachelor’s degree in Computer Science or related technical field. OR 2+ years of technical engineering experience with coding in languages including, but not limited to C++, C# 2+ yeares of experience in Windows application development technologies and frameworks such as UWP, WinUI3, WPF or Win32, MVVM",
    "preferred_qualifications_text": ": Experience in Windows Programming using WinRT/COM with solid understanding of the Windows architecture. Fluent at coding in languages including but not limited to C, C#, XAML, Swift, Java, JavaScript or Python. Deep understanding of Windows app ecosystem. Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1852621",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1852621/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 2+ years active software development",
    "preferred_qualifications_text": ": Experience building highly available cloud services Experience working on platforms that supported millions of users Knowledge of communications protocols like HTTP, SDP, Offer Answer Experience with web services, especially container technologies like Kubernetes is a big plus Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1863573",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1863573/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience 1+ year(s) of experience with Cloud Services 1+ year(s) of experience using Generative AI (Gen AI) to build features and experiences",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience in building AI-driven applications, prompt engineering and model evaluation. Web development skills (ASP.NET, React, etc.) SQL, Kusto and Machine Learning (ML) Self-driven and ability to work with minimal direction to research solutions to challenging business/technical problems. Data-driven approach to software engineering Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1889355",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889355/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4+ years experience in service development, successfully shipping software across multiple releases in a SaaS environment. Proven track record of technical leadership and delivering complex projects at scale. Proficiency in C#, .NET, or equivalent languages and frameworks. Experience with Azure or other cloud platforms.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 6+ years of experience in software engineering, with a solid background in building distributed systems and cloud services. OR equivalent experience. 6+ years experience in service development, successfully shipping software across multiple releases in a SaaS environment. Experience creating AI-centric software and services, and familiarity with AI-based orchestration and agent capabilities. Experience building scalable applications and services on Azure or other scalable cloud platforms with robust reliability, resiliency, security, and performance. Solid understanding of identity, access control, and secure service design. Excellent communication and collaboration skills, with the ability to influence across teams and disciplines. Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check : This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1859285",
    "title": "Full Stack Software Engineer II",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1859285/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": "Master's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with Python, AI/LLM-based tools and frameworks, particularly for analyzing test failures and predicting root causes. Experience in developing applications using RESTful APIs, microservices architecture, ASP.NET, and Azure AI Foundry, with focus on scalable and intelligent enterprise solutions. Knowledge of data structures, algorithms, and software design principles. Experience in enterprise-scale technical experience with cloud and hybrid infrastructures, architecture designs, migrations, and technology management. Knowledge of tools like Azure DevOps or similar CI/CD platforms for integrating and managing test gates. Production experience with two or more of the following domains; automated secret and certificate management, building private firewalled networks with VPNs, building and managing multiple automated K8s clusters, implementing a global multi-region tech stack, automating API gateways, or automated code first data pipelines (Azure Data Factory preferred). Excellent communication skills and ability to collaborate in a multi-disciplinary team consisting of Software Engineers, Program Managers, and Data Scientists. Software Engineering IC3 - The",
    "other_requirements_text": "",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1884200",
    "title": "Senior Software Engineer - Compiler",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1884200/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C++, C, C#, OR/ and Java OR equivalent experience. 4+ years of industry experience developing compiler technologies 6+ months of experience using AI-assisted development tools (e.g., GitHub Copilot, or similar) to enhance productivity and code quality",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 5+ years of experience working on programming language design, compilers, managed runtimes, or OS internals 1+ years of experience using AI-assisted development tools (e.g., GitHub Copilot, or similar) to enhance productivity and code quality 1+ years of experience applying AI technologies (such as large language models or code generation tools) in software development workflows, including tasks like static analysis, automated documentation, or test generation Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1892721",
    "title": "Research Intern - Artificial Intelligence",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1892721/",
    "required_qualifications_text": "Currently enrolled in a Master or PhD program in Computer Science, Electrical Engineering, Mathematics or a related field.",
    "preferred_qualifications_text": "Ability to work independently and collaboratively in a dynamic and vibrant research environment. Willingness to embrace knowledge outside your field of research interest. Solid programming skill in Python, PyTorch and experience conducting experiments and writing papers. Interdisciplinary research experience across world model, multimodal learning and computer system. Experience in LLM, either pre-train or post-train. Relevant publications such as CVPR, ACL, ICML, NeurIPS, ICLR, OSDI, SOSP, etc. Applied Sciences IC2 :",
    "other_requirements_text": "Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship. In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $5,460 -$10,680"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $7,040 -$11,640"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $6,550 -$12,880"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $8,480 - $13,"
      }
    ]
  },
  {
    "job_id": "1849175",
    "title": "Senior Software Engineer",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1849175/",
    "required_qualifications_text": "",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Experience with SQL server deployments at scale Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft background and Microsoft Cloud background check upon hire/transfer and every two years thereafter. Additional or",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1889161",
    "title": "Software Engineer II - Azure Resource Builder",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889161/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ years of experience developing, deploying, monitoring and shipping scalable cloud services.",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  },
  {
    "job_id": "1889294",
    "title": "Senior Software Engineer",
    "locations": [
      "Multiple Locations, United States"
    ],
    "travel": "0-25 %",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889294/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, OR Java, JavaScript, or Python OR equivalent experience. 2+ years experience with distributed systems",
    "preferred_qualifications_text": ": Bachelor's Degree in Computer Science OR related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 4 years of experience in distributed systems. 4 years of Programming experience . Software Engineering IC4 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $119,800 - $234,700"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $158,400 - $258,000"
      }
    ]
  },
  {
    "job_id": "1889382",
    "title": "Software Engineer II",
    "locations": [
      "Redmond, Washington, United States"
    ],
    "travel": "None",
    "date_posted": "Oct 08, 2025",
    "url": "https://jobs.careers.microsoft.com/global/en/job/1889382/",
    "required_qualifications_text": ": Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in Python and one or more of: TypeScript, JavaScript, Rust OR equivalent experience. 6+ months of experience using AI-assisted development tools (e.g., GitHub Copilot, or similar) to enhance productivity and code quality. Experience applying AI technologies (such as large language models or code generation tools) in software development workflows, including tasks like static analysis, automated documentation, or test generation.",
    "preferred_qualifications_text": ": Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in Python and one or more of: TypeScript, JavaScript, Rust OR Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in Python and one or more of: TypeScript, JavaScript, Rust OR equivalent experience. Experience with the internals of compiler and language service concepts such as parsing, type inference, diagnostics, static/dynamic analysis and experiene with developer tools, IDE extensions (Visual Studio or VS Code), or similar ecosystems. 1+ years of experience using AI-assisted development tools (e.g., GitHub Copilot, or similar) to enhance productivity and code quality 1+ years of experience applying AI technologies (such as large language models or code generation tools) in software development workflows, including tasks like static analysis, automated documentation, or test generation Software Engineering IC3 - The",
    "other_requirements_text": ": Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "pay_ranges": [
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $100,600 - $199,000"
      },
      {
        "region": "SF Bay Area / NYC",
        "range": "USD $131,400 - $215,400"
      }
    ]
  }
]