{
  "689836217499639": {
    "title": "Tech Compensation Business Partner, Strategic Initiatives",
    "URL": "https://www.metacareers.com/jobs/689836217499639",
    "location": "Bellevue, WA • Austin, TX • Menlo Park, CA • Seattle, WA • New York, NY • Full Time + 4 more • Full Time - Hide",
    "responsibilities": "Drive complex and strategic compensation initiatives and projects by collaborating with broader compensation team, cross-functional partners, Business leaders and Human Resource Business Partners across technology pillars Develop and deliver robust compensation strategy and innovative solutions to meet evolving business and talent needs Lead projects that align with Tech compensation priorities and scale/advance our approach to deliver compensation with adoption of AI-powered solutions Act as the liaison between Tech Comp team and Comp Programs and Equity Comp teams plus other cross functional partners to execute and drive initiatives across compensation planning, program administration, performance summary cycles and comp program projects Lead the annual market review process for Tech Comp team, providing insights on market trends and conducting analysis to ensure ongoing market competitiveness for our roles Work closely with our offers team and recruiting partners to accelerate our review process and hire specialized talent Partner with centralized analytics and insights team to develop and implement robust data analysis and modeling framework to increase comp business partners’ efficacy and scale our processes Lead with a global mindset- designing and implementing compensation solutions at global scale with international compensation partners Lead with internal & market insights to drive compensation solutions with business leaders and HR business partners while providing project leadership, a bias towards action, and a strategic focus on driving key outcomes Partner with business leaders and HR business partners and comp team on job review initiatives for new and existing roles within technology pillars Communicate complex compensation topics with clarity and confidence. Effectively influence leaders/executives and cross functional partners",
    "minimum_qualifications": "BA/BS in Economics, Business Administration or similar field 10+ years of experience in compensation analyst/consultant role, with sufficient experiences and knowledge of stock compensation Cross-functional Partnership, influencing, and communication skills Experience working with HR business partners and leaders & executives Experience with analytics, Excel, PowerPoint and HR Systems Experience in one or more of the following compensation disciplines: salary and incentive plan design and administration, sales compensation, international compensation, stock compensation, executive pay Experience working in fast paced environments and managing multiple key priorities simultaneously",
    "preferred_qualifications": "Advanced degree Experience effectively navigating ambiguity, setting strategy, and driving effective solutions in a well-thought-out manner Experience managing projects with tight deadlines through to completion while balancing evolving priorities and a broad range of stakeholders",
    "compensation": "$181,000/year to $252,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "836093078960608": {
    "title": "Research Scientist Intern, Core AI - Vision and Multi-Modal (PhD)",
    "URL": "https://www.metacareers.com/jobs/836093078960608",
    "location": "Burlingame, CA • Internship",
    "responsibilities": "Plan and execute impactful research to advance the state-of-the-art in vision or multi-modal foundation models. Publish research findings in top-tier conferences, release code, and effectively present research outcomes to internal and external audiences.",
    "minimum_qualifications": "Programming experience in Python, deep learning frameworks such as Pytorch Research and/or work experience in computer vision, multi-modal language models or generative models Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as publications at leading conferences such as CVPR, ECCV/ICCV, ICLR, ICML, NeurIPS Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Experience in large scale vision/multi-modal model training/evaluation Experience in large scale vision data collection and curation Experience building systems based on machine learning, reinforcement learning and/or deep learning methods Demonstrated SWE or research experience via an internship, work experience, coding competitions, widely used contributions in open source repositories (e.g. GitHub), or top-tier publications",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}