{
  "674309939086892": {
    "title": "ASIC Engineer, Power",
    "URL": "https://www.metacareers.com/jobs/674309939086892",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Develop power vectors for estimation and optimization. Low-power design of ASIC modules. Run industry standard EDA power simulation tools on customized ASIC designs. Power estimation and optimization strategies for all layers of abstraction in silicon design, from architecture to physical design. Develop power vectors for estimation and optimization. Low-power design of ASIC modules. Run industry standard EDA power simulation tools on customized ASIC designs. Power estimation and optimization strategies for all layers of abstraction in silicon design, from architecture to physical design. Develop internal tooling for performance and power improvement for ASICs. Reduce arithmetic unit and data-path power while reducing area and increasing performance in new generation hardware accelerators. Formulate circuit and data-path abstractions using mathematical models.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Mathematics, Physics, Applied Sciences, or a related field and 2 years of experience in the job offered or in a computer-related occupation Experience must include 2 years of experience in the following: C, C++, Java, TCL, and Python Programming Writing RTL code using Verilog/SystemVerilog or VHDL Mathematical modeling of ASIC physical feature phenomenon Frontend power analysis and optimization tools (Prime Power RTL / RTL Architect) with experience in RTL design or validation Backend power estimation tools and flows including development and analysis (Prime Power / Power Replay) to perform power estimation, analysis and optimization at various stages of the design UPF generation, verification (VC Low Power), and signoff for complex SoC projects Understanding of Computer Architecture including various design tradeoffs and how they affect power and Experience generating Thermal and Power maps to understand hotspots and power density in an ASIC using mathematical modeling software (MATLAB)",
    "preferred_qualifications": "",
    "compensation": "$187,029/year to $192,170/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "806702595405626": {
    "title": "Partner Engineer, Android",
    "URL": "https://www.metacareers.com/jobs/806702595405626",
    "location": "Los Angeles, CA • Menlo Park, CA • Seattle, WA • New York, NY • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Improve the quality of Facebook apps on our partners' latest Android devices Identify and surface insights using metrics on product usage to increase adoption and provide new solutions that address the needs of our partners Use broad range of technical and soft skills to build productive relationships with our partners, and resolve complex technical and business needs while contributing to partner documentation Use expertise and product insight to deliver high-quality project/integration/ partner engagements, while sustaining productivity Guide workflow changes, and gain consensus from stakeholders while driving to solution Respond and maintain effective communication with industry partners and internal stakeholders Build and manage working relationships with technical counterparts. Mentor and share knowledge with peers, creating productive atmosphere amongst team Work with partners to develop a long- term strategic plan, grounded on business objectives, and manage partners during feature launches Understand organizational structure and cross functional team dynamics and get support from those teams as needed",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 5+ years of relevant industry experience - software engineering or partner engineering B.A/B.S. or M.S. in Computer Science or equivalent degree or experience Experience with Android development and using various SDKs and libraries Understand tools, concepts and processes related to Meta family of apps, and underlying implementation across Android Software development experience in languages and environments such as Java, Kotlin, NDK(C++) and/or PHP Experience to take on complex and ambiguous problems Willingness to travel approximately 10% of the time",
    "preferred_qualifications": "Proven experience in communication, analytical, collaboration, and problem-solving skills Experience communicating with external parties Experience in adopting changes by new Android OS releases for applications Experience in large code bases, including API design techniques",
    "compensation": "$147,000/year to $203,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1127245616250908": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1127245616250908",
    "location": "New York, NY • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field Experience must include university level course, research project, or internship experience with the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases SQL and Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$178,360/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1321549758971701": {
    "title": "Information Architect",
    "URL": "https://www.metacareers.com/jobs/1321549758971701",
    "location": "Austin, TX • Menlo Park, CA • Seattle, WA • New York, NY • San Francisco, CA • Fremont, CA • Full Time + 5 more • Full Time - Hide",
    "responsibilities": "Create and use AI to make content systems smarter, so content is automatically better, personalized, and delivered proactively Build context rich information representation models to power NLP and LLMs with smart content Help build APIs for smooth knowledge sharing across all platforms and new tech Implement content system infrastructure using generative AI, semantic search engines, and predictive analytics models, building scalable technical solutions that anticipate organizational knowledge requirements Build and deploy connected knowledge system integrations between HR platforms and enterprise intelligence systems using modern integration patterns and API development Team up with product managers, engineers, and business stakeholders to build and deploy technical solutions, implementing user-friendly knowledge systems Implement and deploy future thinking employee support systems using automated workflows, proactive information delivery mechanisms, and intelligent user interfaces Work with global HR program owners to configure AI-powered content management solutions, implementing machine learning models and deploying enhanced knowledge system methods Help make the People@ taxonomy smarter, turning it into AI-ready knowledge graphs that can power advanced analytics, automatic insights, and chat interfaces Design and build knowledge systems that use AI tech like large language models, vector databases, and semantic understanding to give employees better experiences Pioneer new ways to deliver knowledge, like voice interfaces, augmented reality overlays, and experiences that know what you need based on context Research and implement industry best practices through direct technical development and system configuration Develop architecture solutions that enable knowledge systems to adapt to changing business models and workforce needs Maintain intricate system integrations across content management platforms, HR systems, analytics tools, and AI services Use code-based tools (such as Jupyter notebooks) to create, run, and share documents containing live code, text, equations, and data visualizations, supporting rapid prototyping, analytics, and machine learning workflows Leverage AI-enhanced coding interfaces for rapid iteration, prototyping, and solution delivery Partner with engineering to build and deliver high-quality solutions that meet business needs and bring innovative disruption in ambiguous spaces",
    "minimum_qualifications": "Bachelor's degree in a directly related field, or equivalent practical experience 6+ years of progressive experience in enterprise content architecture, knowledge systems design, or HR technology solution development 4+ years of hands-on experience developing complex taxonomies, ontologies, and knowledge architectures for AI/ML applications and large-scale systems Experience implementing AI-enhanced content solutions, including machine learning classification, semantic search, or conversational AI systems Experience with modern data technologies including vector databases, graph databases, knowledge graphs, and big data platforms Advanced experience with content management platforms, GraphQL, metadata management, and structured content strategies Demonstrated track record of leading global technical initiatives with cross-functional stakeholder collaboration and business impact delivery Strategic thinking with experience in technology roadmapping, competitive analysis, and innovation planning Proficiency in agile methodologies and experience managing complex, ambiguous technical initiatives Demonstrated communication skills with proven experience to influence at all levels and drive organizational change",
    "preferred_qualifications": "Master's degree in Information Science, Computer Science, Library Science, or equivalent technical field Advanced certifications in AI/ML, cloud architecture, or enterprise content management Familiarity with programming languages such as Python, JavaScript, Go, or Java with experience in AI/ML frameworks Background in conversational AI development, natural language processing, or generative AI implementations Practical experience in HR domains including benefits, compensation, payroll, and global regulatory compliance Experience with enterprise integration platforms (MuleSoft, Workday, Salesforce) and advanced analytics tools Track record of successful vendor partnerships for AI technology implementation and strategic technology consulting Experience leading innovation initiatives in rapidly evolving, global technology environments Understanding of AI ethics and responsible AI development in enterprise systems",
    "compensation": "$122,000/year to $177,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1333090144863128": {
    "title": "Executive Administrative Partner",
    "URL": "https://www.metacareers.com/jobs/1333090144863128",
    "location": "Bellevue, WA • Redmond, WA • Seattle, WA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Coordinate internal and external meetings Manage complex calendar set-up and movement Prepare expense reports and purchase requisitions Coordinate both domestic and international travel arrangements Organize space planning, strategic offsite events and team all-hands meetings Build cross-functional relationships between departments Partner closely with lead admins across the organization Communicate key organizational and company updates to admins and cross functional partners General office duties as needed",
    "minimum_qualifications": "4+ years of relevant experience providing administrative support to 1 or more executives 4+ years of relevant experience coordinating travel logistics on behalf of 1 or more executives 4+ years of relevant calendar management and expense report management experience for 1 or more executives Experience prioritizing multiple projects Experience with Microsoft Office and Google Suite",
    "preferred_qualifications": "Experience collaborating and partnering closely with other administrative professionals, executives, business leads, and key cross functional partners Experience planning, executing and driving strategic events and offsites, including both leadership and larger team offsites Experience in prioritizing multiple assignments quickly and with high autonomy Experience in prioritizing multiple assignments quickly and proactively following up with leadership to ensure task completion",
    "compensation": "$47.16/hour to $67.50/hour + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1371757317907486": {
    "title": "DFX Engineer",
    "URL": "https://www.metacareers.com/jobs/1371757317907486",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Provide technical leadership and coaching on manufacturing best practices Conduct detailed CAD reviews to identify manufacturing pain points and design alternatives Develop and qualify manufacturing processes and equipment for final assembly, packaging lines, and optical module automation Create and approve manufacturing documentation including process flows, SOPs, qualification packages, and fixture/equipment designs Create Engineering Requirements Specification (ERS) documents and review/approve all proposals from vendors Drive New Technology Introduction (NTI) initiatives Support factory operations by troubleshooting assembly line issues, conducting failure analysis, and driving process improvements Collaborate with internal partners (Mechanical, Electrical, Optical Design, Quality, Operations, CapEx, and TPM teams), external contract manufacturers (CMs) and suppliers/vendors Travel domestically and internationally as needed",
    "minimum_qualifications": "BS in Mechanical Engineering or related field 5+ years of engineering experience in product design, manufacturing, or process engineering Experience with CAD software (NX Preferred) Experience in automation and machine design for high precision manufacturing",
    "preferred_qualifications": "Experience with New Product Introduction (NPI) and manufacturing operations GD&T and tolerance analysis experience Competency in statistical software such as JMP or MiniTab Cleanroom manufacturing experience Ability to work across multidisciplinary teams Experience working with contract manufacturers and suppliers in Asia Pacific Experience in leveraging AI tools to perform routine tasks",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1385784299936672": {
    "title": "Deployment Strategy Lead - Data Center Design, Engineering, & Construction",
    "URL": "https://www.metacareers.com/jobs/1385784299936672",
    "location": "Reston, VA • Menlo Park, CA • Remote, US • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Interpret market signals and provide data-driven recommendations and strategies to de-risk Meta’s data center deployment Cultivate relationships with industry peers, contractors and the supplier community to proactively address supply chain challenges Benchmark current and planned strategies against industry-leading peers by leveraging internal team’s networks Quickly synthesize quantitative and qualitative information from readily available market reports Provide insight into Meta's strategic execution advantages compared to competitors Contribute key market intelligence to major DEC-Eng deployment decisions Provide technical and project execution commentary to Meta’s broader Market Intelligence team for context and insights from new signals Perform thorough analysis on industry trends and peer practices related to risk distribution, design and deployment strategies, and project development prepositioning Partner with XFN teams in Delivery, Precon, Engineering and Operations to ensure seamless transition from development phase to execution phase and ensure the success of XFN teams Identify risks that could derail the delivery of capacity and actively partner with XFN teams to mitigate those risks and quantify in the context of cost and schedule and articulate those risks to the business Travel required up to 20%",
    "minimum_qualifications": "10+ years of experience in engineering or construction roles, both in the office and the field Solid knowledge of electrical and mechanical systems in Data Center applications Research experience related to sectors including, but not limited to data centers, networking, silicon and hardware, or AI Progressive responsibility in commercial management, market intelligence, go-to-market strategy, project management, with a focus on strategic planning, risk management, and data-driven decision-making Working knowledge of standards and codes Effective communications skills with experience developing strategic communication plans over short and long term Proficient in understanding of construction means and methods, project sequencing, critical path schedules and cost estimating Solid knowledge of conceptual budgeting and cost estimating for large capital projects as well as scheduling tools Proficient in Excel, Power Point, Word, and other tools required to plan and communicate work products Mission critical, Infrastructure and/or data Center Construction Experience",
    "preferred_qualifications": "Construction market intelligence programs experience Masters or License in Engineering Discipline such as Electrical , Mechanical, Civil or Construction Management Additional Experience or Certification in Project Management, Leadership, Logistics, Communications Broad range of work experience from Owner, General Contractor, Trade Contractor, Supplier, Vendor, Consultant, Tangential Field",
    "compensation": "$144,000/year to $201,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1390163419141773": {
    "title": "Materials Engineer",
    "URL": "https://www.metacareers.com/jobs/1390163419141773",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Design and develop thin film optical coatings and advanced materials for high-volume manufacturing, addressing requirements such as angular and spectral transmission control, polarization, phase control, reliability, and cost Develop and optimize coating and materials processes, including vacuum deposition techniques (PVD, CVD, ALD), wet coatings, and other relevant methods Characterize and analyze the performance of thin film coatings and advanced materials using techniques such as spectroscopy, ellipsometry, and other industry-standard or custom-developed methods Innovate and adapt characterization methodologies, creatively modifying or inventing new approaches when existing tools are insufficient Develop and execute validation and verification activities for new product integration, ensuring all requirements and functions are met for coatings and other advanced materials Lead root cause analysis for field failures, utilizing advanced chemical and physical analysis to identify and resolve issues across coatings and other advanced materials Troubleshoot coating-related issues and provide in depth technical support to manufacturing teams Provide technical leadership throughout the lifecycle of coatings and advanced materials, from proof of concept through to mass production, including deposition and reliability testing Communicate findings, recommendations, and technical insights clearly to stakeholders, driving alignment and continuous improvement across teams Guide and coordinate cross-functional teams to ensure rapid, cohesive problem-solving and effective implementation of solutions in manufacturing environments Collaborate with internal teams and external industry partners to integrate coating and materials designs into larger systems, ensuring compatibility and alignment with project goals",
    "minimum_qualifications": "Bachelor’s or Master’s degree in Materials Science, Optical Engineering, Physics, Chemistry, or a related field 8+ years of industry experience in thin film coatings and/or advanced optical materials development for high-volume manufacturing Expertise in optical coatings, noble materials, and advanced materials, including design, deposition and characterization Experience in the integration of coatings and advanced materials into complex hardware systems, from concept through mass production Experience guiding cross-functional teams and collaborating with internal and external partners to deliver solutions in a manufacturing environment Proven technical leadership and communication skills, with the ability to clearly convey complex findings and drive alignment across stakeholders",
    "preferred_qualifications": "PhD in Materials Science, Optical Engineering, Physics, Chemistry, or a related field Experience with AR/VR display technologies, waveguides, or diffractive optics Demonstrated ability to develop and implement innovative characterization methods, including adapting or inventing new approaches when standard tools are insufficient Proven track record of leading root cause analysis and troubleshooting for field failures using advanced chemical and physical analysis techniques Familiarity with consumer electronics manufacturing processes, supplier engagement, and mass production ramp Experience in one or more optical design tools such as Zemax, Code V, LightTools, FRED, or ASAP Experience with machine learning algorithms and their application to optical coating design and optimization Experience in manufacturing design for cost, quality control and statistical analysis using JMP, Matlab, Python, or similar programs Experience with program management or technical leadership roles",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1447365726323922": {
    "title": "Lead Counsel, Monetization (AI)",
    "URL": "https://www.metacareers.com/jobs/1447365726323922",
    "location": "Los Angeles, CA • Menlo Park, CA • Seattle, WA • Washington, DC • New York, NY • San Francisco, CA • Full Time + 5 more • Full Time - Hide",
    "responsibilities": "Analyze global products, features, and initiatives and provide practical legal risk mitigation strategies for products across multiple jurisdictions Counsel product, engineering and business teams on compliance with existing and emerging AI, data protection, competition, intellectual property and consumer protection laws Drive and contribute to high-impact projects with cross-functional stakeholders across business, policy, legal, communications, security, and other cross-functional teams Become an expert in AI and advertising legal issues and help build legal frameworks to address risk in these areas",
    "minimum_qualifications": "J.D. degree (or foreign equivalent) Active membership in at least one US state bar and eligibility to obtain registered in-house counsel status (if required by the State Bar in the assigned work location) 5+ years of legal experience as a practicing attorney, including at a law firm and/or in-house or government experience Experience with at least one of the following or related legal areas: AI, data protection, platform, consumer protection, or advertising-related laws and regulations Effective communication skills",
    "preferred_qualifications": "In-house experience at an AI, technology, social media, or digital advertising company Experience working proactively, independently and reliably under tight timeframes in a fast-paced environment Experience collaborating in a multi-stakeholder environment, navigating complex issues, and driving high-impact projects",
    "compensation": "$167,000/year to $233,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1537289387611959": {
    "title": "Product Manager, International Supply Chain Management and Expansion",
    "URL": "https://www.metacareers.com/jobs/1537289387611959",
    "location": "Menlo Park, CA • Seattle, WA • Full Time",
    "responsibilities": "Define and own the global product strategy and roadmap for AI-powered supply chain optimization solutions, ensuring alignment with Meta’s international expansion goals and compliance requirements Lead end-to-end product development for innovative tools, platforms, and products that address cross-border supply chain challenges—including ideation, technical development, launch, and ongoing iteration Drive product development with high-performing, cross-functional teams of engineers, designers, regional supply chain experts, and compliance specialists, maintaining team health and a collaborative work environment Collaborate closely with international supply chain operators, business stakeholders, regional partners, and data/infrastructure teams to understand country-specific pain points, regulatory landscapes, workflows, and data needs Incorporate global market analysis, competitive positioning, regulatory research, and customer insights into product requirements and prioritization, ensuring solutions are scalable and locally compliant Maximize efficiency and impact in a rapidly evolving, multinational environment by embracing agile processes, creative problem-solving, and flexible adaptation to country-specific priorities Plan, initiate, and manage information technology projects that support both web-based products and AI-powered platforms, ensuring technical scalability, data privacy, and business relevance across multiple countries and regions Navigate complex international trade-offs, including build vs. buy decisions for AI platforms and tools, by leveraging data-driven insights and collaborating with relevant global stakeholders Prioritize use cases and features based on impact to international supply chain metrics such as market entry speed, trade compliance, logistics cost optimization, and global customer experience—balancing short-term wins and long-term strategic bets Drive adoption of AI recommendations and automation in international contexts by designing seamless user experiences focused on trust, transparency, and explainability across broad regulatory environments Define, track, and analyze key performance metrics to inform product success, regularly reporting on outcomes and impact to business goals, user satisfaction, and operational efficiency Foster an environment of continuous improvement, learning, and feedback across teams and stakeholders to ensure products remain innovative, user-centric, and industry-leading",
    "minimum_qualifications": "8+ years of relevant industry experience with at least 3 years in Product Management Significant experience within International Supply Chain functional domain, either managing supporting products or as an operator Experience working in a technical environment with a broad, cross functional team to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), and guide the team through key milestones Experience defining vision and strategy for a product Experience delivering technical presentations Experience analyzing complex, large-scale data sets and making decisions based on data Experience gathering requirements across broad areas and users, and converting and developing them into a product solution Technical experience with analytical tools, methodologies, and design Displaying leadership, organizational and execution skill Proven communication skills Experience going through a full product lifecycle, integrating customer feedback into product requirements, driving prioritization and pre/post-launch execution Bachelor's degree (or relevant degree equivalent): STEM subject ideal but not essential (Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences)",
    "preferred_qualifications": "Experience building supply chain platform products to optimize performance Experience building AI first products, particularly with agentic experiences Experience recruiting and leading a cross-functional team of industry leading individuals",
    "compensation": "$171,000/year to $238,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2348375505591355": {
    "title": "Public Affairs Manager",
    "URL": "https://www.metacareers.com/jobs/2348375505591355",
    "location": "Menlo Park, CA • Washington, DC • New York, NY • San Francisco, CA • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Support the development and execution of public affairs strategies for a range of priority policy issues Advise on strategy and help create communications plans, messaging, and related materials for policy audiences, including blog posts, statements, and social content Collaborate with cross-functional teams (Policy, Legal, Product, Marketing, etc.) to ensure alignment and effective execution of public affairs initiatives Monitor and respond to emerging issues, providing rapid response support and helping to de-risk and de-escalate potential challenges Develop and contribute to proactive campaigns that educate and engage policy audiences, leveraging internal experts, social channels, exec communications and other creative tactics Distill complex policy and product topics into clear, accessible language for specific audiences Build and maintain relationships with internal and external stakeholders, including agency partners, third-party stakeholders and reporters Help the team remain agile, ready to take on new projects and priorities as they arise",
    "minimum_qualifications": "8+ years of experience in public affairs, communications, or a related field Experience supporting policy communications, public affairs, or issues management for a variety of clients or topics Proven experience to work under deadlines and manage multiple projects simultaneously Experience distilling complex policy areas into plain language for policy audiences and embracing ambiguity to drive innovative and impactful solutions Experience collaborating with cross-functional teams and managing stakeholder relationships Create compelling narratives, editing and communication skills",
    "preferred_qualifications": "Experience working at a communications firm or public affairs agency on legislative, regulatory, political or issue-based campaigns Familiarity with driving public affairs campaigns related to technology policy areas such as security, privacy, new or emerging technology, and online safety Experience supporting crisis communications and rapid response efforts Demonstrated experience adapting to changing priorities and workstreams",
    "compensation": "$145,000/year to $204,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3366830046807765": {
    "title": "DFX Engineer",
    "URL": "https://www.metacareers.com/jobs/3366830046807765",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Provide technical leadership and coaching on manufacturing best practices Conduct detailed CAD reviews to identify manufacturing pain points and design alternatives Develop and qualify manufacturing processes and equipment for final assembly, packaging lines, and optical module automation Create and approve manufacturing documentation including process flows, SOPs, qualification packages, and fixture/equipment designs Create Engineering Requirements Specification (ERS) documents and review/approve all proposals from vendors Drive New Technology Introduction (NTI) initiatives Support factory operations by troubleshooting assembly line issues, conducting failure analysis, and driving process improvements Collaborate with internal partners (Mechanical, Electrical, Optical Design, Quality, Operations, CapEx, and TPM teams), external contract manufacturers (CMs) and suppliers/vendors Travel domestically and internationally as needed",
    "minimum_qualifications": "BS in Mechanical Engineering or related field 3+ years of engineering experience in product design, manufacturing, or process engineering Experience with CAD software (NX Preferred)",
    "preferred_qualifications": "GD&T and tolerance analysis experience Competency in statistical software such as JMP or MiniTab Experience in automation and machine design for high precision manufacturing Cleanroom manufacturing experience Ability to work across multidisciplinary teams Experience working with contract manufacturers and suppliers in Asia Pacific",
    "compensation": "$111,000/year to $164,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3726295961011954": {
    "title": "Research Scientist, ML Spatial Audio Processing",
    "URL": "https://www.metacareers.com/jobs/3726295961011954",
    "location": "Redmond, WA • Menlo Park, CA • Full Time",
    "responsibilities": "Conduct research, design, develop and prototype novel algorithms and signal processing techniques to solve complex problems at the intersection between spatial audio processing, sound source separation, audio enhancement, and audio perception with applications in VR and AR Collaborate with cross-functional teams, including engineering, product management, and user experience, to develop and implement new audio technologies Develop and maintain technical roadmaps for audio research and development Communicate research results and technical plans to stakeholders, including technical and non-technical audiences Collaborate with teams in the larger Reality Labs organization and provide creative leadership on cross-team technologies",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta PhD in Electrical Engineering, Computer Science, Acoustics, or a related technical field 3+ years of experience in audio research and development, including experience with spatial audio processing, and with ML models designing training and implementation Experience with programming languages such as C++, Python, or MATLAB Demonstrated experience and understanding of linear and non-linear multichannel spatial audio signal processing",
    "preferred_qualifications": "Proven track record of successfully maturing innovative technology in industry or similar environment Experience with development of source separation, speech enhancement, noise reduction models Experience with development of spatial audio capture algorithms, including signal-dependent and signal-independent approaches Publication record in high-quality conferences and journals in the field of audio research Demonstrated experience designing, executing and analyzing perceptual studies to evaluate audio performance Experience with spatial audio mixing formats - surround, Atmos, Ambisonics Experience utilizing any DAW, e.g. Reaper, Audition, Wwise, FMOD, Unity, Unreal, Premiere, Pro Tools Experience with virtual and augmented reality audio applications",
    "compensation": "$117,000/year to $173,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}