{
  "1148741113874625": {
    "title": "Corporate Finance Manager",
    "URL": "https://www.metacareers.com/jobs/1148741113874625",
    "location": "Menlo Park, CA • New York, NY • Full Time",
    "responsibilities": "Lead the structuring, negotiation, and execution of non-recourse financings for Meta’s data centers and other infrastructure projects Develop and maintain complex financial models to evaluate project economics, identify key risks and sensitivities, and support decision-making Drive financial due diligence efforts, collaborating with internal and external stakeholders to facilitate robust risk assessment and mitigation Prepare and deliver presentations and communications to executives, credit rating agencies, and other key stakeholders Manage multiple concurrent projects, ensuring timely execution and alignment with Meta’s strategic priorities Stay current on market trends, financing structures, and regulatory developments relevant to infrastructure and project finance Support ad hoc strategic finance initiatives as needed",
    "minimum_qualifications": "10+ years of experience in finance, capital markets, or related functions Bachelor’s degree in business, finance, or a technically related field Expertise in building and analyzing financial models for infrastructure projects, including risk identification and sensitivity analysis Hands-on analytical problem-solving skills with a track record of prioritizing among multiple deliverables Effective collaborator with proven experience communicating complex topics to a wide variety of stakeholders, including Meta leadership and credit rating agencies Experience managing multiple projects and collaborating across internal and external teams",
    "preferred_qualifications": "MBA, JD, or other relevant advanced degree Experience in data center, infrastructure, or project finance at an investment bank or financial sponsor Demonstrated success in raising or investing capital for data centers, energy infrastructure, or similar large-scale projects",
    "compensation": "$174,000/year to $243,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1347840270322686": {
    "title": "Electrical Engineer",
    "URL": "https://www.metacareers.com/jobs/1347840270322686",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Contribute to the development of complex subsystems, own the development of moderately complex subsystems, or own the development of simple systems under the direction of a technical lead Design schematics, evaluate components, direct board layout, conduct design reviews and draft design documentations Manage bring up and debug, support manufacturing and assembly build Collaborate in a team environment and work across engineering disciplines to develop systems and manage trade offs across electronics, mechanics, sensors, haptics, firmware and software Evaluate vendor reference design and transform these into custom solutions which meet product and form factor constraint Work in distributed team environment Contribute to building and sustaining internal Meta community through recruitment and mentorship Travel both domestically and internationally",
    "minimum_qualifications": "Currently has, or is in the process of obtaining, Bachelor’s degree in Electrical Engineering, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta Proven knowledge of electrical engineering fundamentals (analog) Experience with schematic and board design using Cadence OrCAD, Altium or equivalent Experience working with one of these technologies: use of oscilloscopes, high speed digital test equipment, logic analyzers, or function generators Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Currently has, or is in the process of obtaining, Master's degree in Electrical Engineering, Computer Engineering, relevant technical field, or equivalent practical experience",
    "compensation": "$111,000/year to $131,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1474404313779164": {
    "title": "Data Scientist, Product Analytics",
    "URL": "https://www.metacareers.com/jobs/1474404313779164",
    "location": "Bellevue, WA • Menlo Park, CA • Seattle, WA • New York, NY • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Work with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches. Apply technical expertise with quantitative analysis, experimentation, data mining, and the presentation of data to develop strategies for our products that serve billions of people and hundreds of millions of businesses. Identify and measure success of product efforts through goal setting, forecasting, and monitoring of key product metrics to understand trends. Define, understand, and test opportunities and levers to improve the product, and drive roadmaps through your insights and recommendations. Partner with Product, Engineering, and cross-functional teams to inform, influence, support, and execute product strategy and investment decisions.",
    "minimum_qualifications": "Experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), and/or statistical/mathematical software (e.g. R) Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta",
    "preferred_qualifications": "Experience in collaborating with individuals and organizations Experience working with large scale dataset Internship experience in solving analytical problems using quantitative approaches",
    "compensation": "$46.63/hour to $134,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1589287305882721": {
    "title": "OptoMechanical Design Engineer",
    "URL": "https://www.metacareers.com/jobs/1589287305882721",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Design, develop, and optimize the Smartglasses or AR glasses eyepiece, including optical, mechanical, and electrical components Connect system PD and module designs with fit study and total stack tolerance analysis to ensure seamless system level integration and optimal performance Develop and maintain detailed design documentation, including 2D and 3D CAD models, drawings, and specifications Guide FEA team for mechanical simulation, structural risk assessment and design optimization of display system Collaborate with optical and thermal engineers for Structural Thermal Optical Performance multiphysics analysis of display system performance Conduct end-to-end design and DFM reviews, tolerance analysis, verification and validation to ensure design meets requirements and specifications from optical modules to system level Drive FMEA, failure analysis, tolerance analysis, gauge R&R, and the GD&T activities supporting product scalability in close collaboration with process, manufacturing and RELteams Apply engineering expertise in the areas of opto-mechanics, precision manufacturing, metrology, and tooling design to drive vendors, including CMs, external equipment manufacturers, part suppliers, and integrators for design improvement and technical problem solving",
    "minimum_qualifications": "Bachelor's or Master's degree in Mechanical Engineering, Optical Engineering, or a related field 7+ years of experience in complex opto-mechanical system design and analysis, development, and optimization In-depth understanding of mechanical design as it relates to optical performance, precision engineering, and manufacturing process 5+ years of hands-on experiences with at least one of the CAD design tools, such as NX, SolidWorks, Creo, or similar Experienced in GD&T standards, dimensional metrology, statistics, Gauge R&R, and their application to process and design controls in high volume manufacturing Experienced with design for manufacturability and assembly, with a focus on cost-effective and efficient design solutions Demonstrate analytical and problem-solving skills to analyze complex systems and identify innovative solutions Working knowledge of optical principles, including geometric optics, wave optics, optical components, adhesives, etc Familiarity with industry-standard optical design and testing tools, such as Zemax, CodeV, FRED, or similar Demonstrated experience with communication and collaboration skills, and can work effectively with cross-functional teams",
    "preferred_qualifications": "MS or PhD in Mechanical Engineering or equivalent experience Experience working on mechanical design and productization of augmented reality (AR) or virtual reality (VR) display systems Extensive hands-on experiences on NX is preferred Hands-on experience with mechanical simulation tools, such as ANSYS or Abaqus, with working knowledge of material behaviors including polymers, adhesives, and brittle materials Working knowledge of main optical components in one or more of the following areas: waveguide design and manufacturing, Lens design, active dimming, eyetracking Knowledge of image processing and optical-display metrics, such as MTF, contrast, luminance, uniformity etc Familiar with data processing and analysis tools like JMP, Tableau, Matlab, Python, R, etc Experience working with offshore Contract Manufacturers in delivering consumer electronics products in mass production",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1602201430744633": {
    "title": "Enablement Operations Program Manager",
    "URL": "https://www.metacareers.com/jobs/1602201430744633",
    "location": "Seattle, WA • Full Time",
    "responsibilities": "Optimize Processes with Data: Analyze business processes using quantitative and qualitative data to identify inefficiencies, implement improvements, and track results through defined metrics Lead Enablement Initiatives: Manage and execute projects with clear KPIs, ensuring outcomes are measurable and aligned with strategic objectives Metrics-Driven Collaboration: Partner with cross-functional teams, leveraging data insights to align stakeholders, inform decisions, and drive consensus Strategic Decision Support: Interpret business metrics and trends to provide actionable insights that guide operational and strategic priorities Implement and Measure Automation: Deploy automation tools and workflow solutions, monitoring and reporting on their impact to drive efficiency Foster Data Literacy: Coach and mentor team members to enhance analytical skills and promote data-driven decision making Relationship Building: Establish and maintain productive relationships with customers, partners, and internal teams",
    "minimum_qualifications": "5+ years of experience in program management, operations, or a related field, with a proven track record of using metrics and data to drive business outcomes Solid analytical and problem-solving skills, with the ability to extract, interpret, and synthesize data from multiple sources to inform decisions Proficiency in data analysis and visualization tools (e.g., Tableau, Power BI, SQL, Excel) to translate complex data into actionable insights and reports Demonstrated experience managing projects with measurable outcomes, including setting, tracking, and reporting on KPIs Outstanding communication skills, with the ability to present data-driven insights clearly to wide-ranging audiences and to influence stakeholders Experience collaborating across functions and building relationships to achieve shared objectives, using data to facilitate alignment and drive change High adaptability and flexibility to thrive in a dynamic, evolving business environment with shifting priorities",
    "preferred_qualifications": "Experience designing and delivering training programs, especially to build data literacy and analytical skills Participation in quality assurance programs, with a focus on developing and tracking quality metrics for continuous improvement Hands-on experience with automation tools (e.g., RPA, workflow platforms), including measuring and reporting on their impact Skilled in developing and maintaining dashboards and reporting tools to communicate key metrics and insights",
    "compensation": "$160,000/year to $221,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1703331590513759": {
    "title": "Corporate Development Strategy and Scouting Manager",
    "URL": "https://www.metacareers.com/jobs/1703331590513759",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Identify, research, and recommend industries, companies, regional trends, and technologies for Meta’s M&A evaluation Stay current on the competitive landscape and internal product development to inform and influence M&A strategy Build and maintain relationships within the startup and investor ecosystem to proactively identify trends and M&A opportunities that accelerate Meta’s business objectives Serve as a core member of M&A deal teams, supporting all aspects of the process, including strategic and financial analysis, valuation, due diligence, and negotiation Develop and maintain financial models, dashboards, and presentations to track and analyze industry and prospective M&A opportunities Collaborate cross-functionally with product, legal, finance, and other teams to ensure successful deal execution",
    "minimum_qualifications": "6+ years of experience in investment banking, management consulting, venture capital, or a related field, preferably covering internet, digital media, or mobile companies Bachelor’s degree Demonstrated ability to design, lead, and execute analyses and effectively communicate insights to stakeholders Familiarity with M&A processes, including deal structuring and negotiation Proven problem-solving skills, both independently and in group settings Ability to manage multiple priorities in a fast-paced environment while maintaining a high degree of organization and attention to detail",
    "preferred_qualifications": "An advanced degree (MBA or equivalent) Experience working in or with technology companies Expansive network within the startup and venture capital ecosystem Proven interpersonal and communication skills",
    "compensation": "$159,000/year to $223,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1878517609430704": {
    "title": "Category Sales Manager - Optical Worldwide",
    "URL": "https://www.metacareers.com/jobs/1878517609430704",
    "location": "Los Angeles, CA • Burlingame, CA • New York, NY • Seattle, WA • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Define and drive alignment on the sales distribution strategy by analyzing existing portfolio performance, monitoring competitive activity, analyzing market trends and identifying opportunities for differentiation for upcoming AI wearable optical products Create go-to-channel (GTC) strategy to drive product sales via conducting path to purchase analysis by understanding customer behavior, identifying key touch points, and optimizing the customer journey for AI wearable optical products Establish and manage long lead partner sell-in for the Optical & Health channels (example: Optical retailers, Wholesale Channel with Optical departments etc.) by building relationships, creating joint business plans, and ensuring effective communication and collaboration Create sales strategies and evaluate sales opportunities that help develop and grow the category Provide annual sales guidance by analyzing market trends, identifying opportunities for revenue growth, and developing global sales plans for the category Align and define Lifetime Goals specifically for the optical related product and its supporting budget to drive towards its goals Partner with demand planning to forecast Sales plan and manage subsequent iterations Work with internal and external partners to optimize the prescription smart glasses customer experience and drive product adoption Manage prescription data and analytics with internal and external partners, and uncover actionable insights to drive access and adoption in existing and new channels Serve as the subject matter expert on prescription wearer and channel needs and mindsets Collaborate with cross-functional teams to develop and execute promotional and merchandising strategy while aligning with new product/feature launches and marketing support",
    "minimum_qualifications": "Bachelor's degree in Business, Marketing, or related field 8+ years of experience in category performance management in the prescription optical industry Proven track record of managing launch moments with analytical background for Prescription - Optical products Experience with consumer research and proficiently using data and insights to inform product, Go-To-Market and Go-To-Channel strategy Proven track record of building relationships to effectively work with internal and external partners Experience in conducting path to purchase, competitive sales analysis, and identifying opportunities for differentiation Effective communication skills and experience creating documents and presentations to influence stakeholders",
    "preferred_qualifications": "Masters Degree in Business, Marketing or related field 10+ years of professional experience Experience working in a fast-paced dynamic environment, identifying and escalating issues early and often Experience in consumer electronics with a demonstrated interest in new and emerging tech",
    "compensation": "$150,000/year to $211,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2744410602616808": {
    "title": "Software Engineer, iOS",
    "URL": "https://www.metacareers.com/jobs/2744410602616808",
    "location": "Sunnyvale, CA • Bellevue, WA • Redmond, WA • Menlo Park, CA • Seattle, WA • Burlingame, CA • New York, NY • San Francisco, CA • Full Time + 7 more • Full Time - Hide",
    "responsibilities": "Collaborate with cross-functional teams (product, design, operations, infrastructure) to build innovative application experiences Implement custom user interfaces using latest programming techniques and technologies Develop reusable software components for interfacing with back-end platforms Analyze and optimize code for quality, efficiency, and performance Lead complex technical or product efforts and provide technical guidance to peers Architect efficient and scalable systems that drive complex applications Identify and resolve performance and scalability issues Work on a variety of coding languages and technologies Establish ownership of components, features, or systems with expert end-to-end understanding",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 6+ years of programming experience in a relevant language or 3+ years of experience + PhD Track record of setting technical direction for a team, driving consensus and successful cross-functional partnerships Experience building maintainable and testable code bases, including API design and unit testing techniques",
    "preferred_qualifications": "2+ years of experience building complex applications for the iPhone or iPad using Objective-C/C++/Swift with the iOS SDK and other frameworks Experience with multithreaded programming and mobile memory management Shipped at least one large-scale product to production, supporting millions of active users",
    "compensation": "$70.67/hour to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3121526421361996": {
    "title": "Product Specialist Ads",
    "URL": "https://www.metacareers.com/jobs/3121526421361996",
    "location": "Austin, TX • New York, NY • Full Time",
    "responsibilities": "Become a subject matter expert on Meta’s Ads, Business, and Commerce products Leverage technical skill set and product experience to resolve complex customer issues or triage them to the appropriate Engineering team Continuously improve the end-to-end support funnel and the overall customer support experience by upskilling front-line agents and optimizing internal and external processes Identifying opportunities to improve product usability issues and influence Product and Engineering teams to address them Understand operational workflows, identify and define support tool needs to enable operational scaling and bring resolution closer to the customer Manage stakeholder expectations and communicate with internal teams and external customers to provide technical and business feedback as well as deliver technical solutions",
    "minimum_qualifications": "2+ years of relevant work experience in an operations, support, or product role within the ad-tech space Experience in translating product and technical concepts to technical and non-technical audiences Experience in communication and presentation skills, influencing cross-functional partners and leadership Experience with SQL and analytic dashboards to pull insights from data sets Experience working with cross functional teams such as Product and Engineering globally Basic understanding of web technologies (e.g., HTML, CSS, JavaScript, HTTP, etc.) and experience in technical troubleshooting Experience working in the advertising industry or related field",
    "preferred_qualifications": "Experience navigating complex cross-functional landscapes in an ambiguous and rapidly changing environment Experience in investigating technical issues and provide workarounds/solutions",
    "compensation": "$97,000/year to $136,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}