{
  "811259734965155": {
    "title": "Edits Labs, Director of Product Management",
    "URL": "https://www.metacareers.com/jobs/811259734965155",
    "location": "Menlo Park, CA • San Francisco, CA • Full Time",
    "responsibilities": "Lead a team through the ideation, technical development, and launch of innovative products Drive product development with a team of world-class engineers and designers Attract, build, manage, and develop a talented team of product leaders with a broad range of experiences, perspectives, approaches, and backgrounds Establish shared vision across the company by building consensus on priorities leading to product execution Integrate usability studies, research and market analysis into product requirements to enhance user satisfaction Define and analyze metrics that inform the success of products Understand Facebook’s strategic and competitive position and deliver products that are recognized best in the industry Maximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm Manage multiple products and priorities, scale teams, and ensure org is effective, healthy and set up for success by establishing clear and measurable goals Identify and initiate opportunities for new projects or focus areas and builds teams necessary to execute",
    "minimum_qualifications": "12+ years of experience in Product Management and/or Product Design 12+ years of experience working collaboratively with engineering, design and user research teams 8+ years of experience hiring, managing, and developing both individual contributors and executive leaders Critical thinking/analytical leadership experience Experience presenting to executive executive audiences BA/BS in Computer Science or related field",
    "preferred_qualifications": "Experience working with creators and editing products 0-to-1 product development Experience creating AI native products and workflows Track record of successful consumer products",
    "compensation": "$249,000/year to $323,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1282305640331049": {
    "title": "Research Scientist Intern, Imaging Experiences Architecture (PhD)",
    "URL": "https://www.metacareers.com/jobs/1282305640331049",
    "location": "Sunnyvale, CA • Redmond, WA • Internship",
    "responsibilities": "Design and implementation of models exploring aspects of visual perception to empower novel display modes, like virtual and augmented reality. Identification of solution space for opportunities to improve display graphics/rendering. Collaboration with and support of other researchers across various disciplines (human factors, optics, graphics, display). Communication of research agenda, progress, and results over the course of the intern project.",
    "minimum_qualifications": "Currently has, or is in the process of obtaining, a PhD degree in Computer Science, Vision Science, Electrical Engineering, or relevant technical field Programming in C#, Unity, Python, MATLAB, or similar Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Familiarity with display hardware, display calibration, eye tracking, EMG, GPUs/Graphics APIs Understanding of the display rendering graphics pipeline Familiarity with modern deep learning frameworks (e.g. PyTorch, TensorFlow) Experience with visual perception, knowledge of optics, signal processing, mathematical modeling and/or simulation expertise with respect to visual perception and/or systems design Ability to design and perform psychophysical experiments Demonstrated software engineering experience via an internship, work experience, coding competitions or scientific publications Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as SIGGRAPH, SIGGRAPH Asia, Transactions on Image Processing, CVPR, ICCV, ECCV, Journal of Vision, ICIP, etc.) Experience working and communicating cross functionally in a team environment Intent to return to degree program after the completion of the internship/co-op",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}