{
  "738384129270836": {
    "title": "Research Scientist Intern, Soft Wearable Tactile Sensors (PhD)",
    "URL": "https://www.metacareers.com/jobs/738384129270836",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Design, prototype, and characterize novel wearable tactile sensors able to detect and predict slip and/or cover large area with high density resolution. Research, develop, and characterize the next generation of soft wearable sensing technologies. Collaborate with the larger Reality Labs team and provide creative solutions to challenges in soft wearables and sensing technologies. Emphasis on fundamental scientific and engineering questions related to the complex deformation of soft wearable technologies. Use experimental and characterization data to improve designs of tactile sensors. Communicate or publish research activities and findings to collaborators across a variety of disciplines.",
    "minimum_qualifications": "Currently has or is in the process of obtaining a PhD in the field of Mechanical Engineering, Materials Science, Applied Physics, Robotics or relevant technical field 2+ years experience with hardware prototyping, soft wearable technologies, and hands-on experience including but not limited to soft transducers design, manufacturing and characterization OR 3+ years of experience in optimizing sensor design using data-based approaches or similar Must obtain work authorization in country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Demonstrated experience via an internship, work experience, or widely used contributions to open source projects Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as ISSCC, VLSI Symposium, ESSCIRC or similar Experience working and communicating cross functionally in a team environment Intent to return to the degree-program after the completion of the internship/co-op",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1387290326251445": {
    "title": "Research Scientist Intern, Edge Compute Architectures (PhD)",
    "URL": "https://www.metacareers.com/jobs/1387290326251445",
    "location": "Burlingame, CA • Internship",
    "responsibilities": "Support architecture studies, performance analysis, and design studies Participate in research activities focused on edge compute architecture",
    "minimum_qualifications": "Currently has or is in the process of obtaining a PhD in the fields of Electrical Engineering, Computer Engineering, Computer Science, or related field Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment 2+ years of research experience in one or more of the following: machine learning accelerators or inference engines for deep neural networks (DNN), computer architecture for mobile or embedded systems (ARM/RISC-V ISA), deployment of computer vision algorithms on embedded systems Experience with deep learning frameworks (Pythorch, Tensorflow, etc.) Proficient with Python/C/C++",
    "preferred_qualifications": "Experience developing or optimizing CV and ML algorithms for vision tasks Experience in system modeling for all aspects of a digital system Proficiency in hardware description languages, including SystemVerilog (preferred), Verilog, VHDL, and Chisel, with experience in designing, simulating, and implementing digital systems Experience with FPGA design, development, and implementation using industry-standard tools (e.g., Xilinx Vivado) Experience with EDA tools for simulation, synthesis, place and route, and power analysis (e.g., ModelSim, Synopsys Design Compiler, Cadence Innovus, Synopsys PrimeTime) Proven track record of achieving significant results as demonstrated by grants, or fellowships, as well as first-authored publications in major conferences and journals such as ICCAD, DAC, ISCA, MICRO, HPCA, ISSCC, TinyML, IEDM, VLSI Symposium, ASPLOS, JSSC, TCAS Intent to return to the degree program after the completion of the internship/co-op",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}