{
  "695805120249165": {
    "title": "Digital Design Engineering Intern",
    "URL": "https://www.metacareers.com/jobs/695805120249165",
    "location": "Sunnyvale, CA • Redmond, WA • Internship",
    "responsibilities": "RTL development using SystemVerilog. Participate in Micro-architecture, Design, and Verification reviews and provide feedback. Analyze design and enhance PPA (Power, Performance, Area) Support Verification to analyze and improve Verification Coverage Debug simulations",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering, or a related field Knowledge of Verilog or SystemVerilog Knowledge of Logic Design Fundamentals Must obtain work authorization in the country of employment at the time of hire, and maintain on-going work authorization during employment",
    "preferred_qualifications": "Experience with Lint, Synthesis, Timing Closure, Formal Verification or Physical Design tools Experience with scripting languages (Python, Perl, TCL, shell scripting) Experience with AR/VR technologies, Compression, Image Processing Experience in data path development Demonstrated experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub) Intent to return to degree-program after the completion of the internship/co-op",
    "compensation": "$6,660/month to $11,647/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "822522530372342": {
    "title": "Growth Marketing Manager, Applied AI",
    "URL": "https://www.metacareers.com/jobs/822522530372342",
    "location": "Menlo Park, CA • New York, NY • San Francisco, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Design, develop, and test AI prompts for various growth marketing applications, including creative generation, marketing insights, and translations. Establish quality rubrics and facilitate prompt testing and QA workflows to ensure high-quality outputs Build partnerships with internal and external stakeholders, including marketing, analytics, and creative teams, to understand user needs and translate them into the development of prompts, AI tools, and/or processes. Facilitate regular cross-functional meetings to align on goals and track progress Design and implement test plans to measure the effectiveness of marketing campaigns and AI initiatives, providing data-driven insights to inform future campaign optimization Support the development of learning experiences, including workshops, training modules, and hands-on sessions, to drive adoption and sustained use of AI capabilities among marketing stakeholders Develop and execute a robust change management strategy to embed AI capabilities into marketing workflows, engaging stakeholders, developing communication plans, and providing continuous support to ensure sustainable impact and smooth transitions Collaborate with cross-functional teams to define requirements, scope, deliverables, and goals, ensuring alignment and effective project execution",
    "minimum_qualifications": "8+ years of experience in marketing or related field 1+ years of experience in prompt engineering or working with LLMs/generative AI tools for marketing use cases BA/BS degree or equivalent work experience Experience measuring the effectiveness and quality of LLM outputs Experience influencing, and providing direction to cross-functional teams, including performance marketing, engineering, data science, sales, product, and creative",
    "preferred_qualifications": "Demonstrated experience of the generative AI landscape and Meta’s advertising and AI products 2+ years of experience in data analysis, marketing research, or a related field 1+ years of experience building generative AI agents for insights and data analysis Proven track record of data visualization and data-driven storytelling 1+ years of experience with SQL and/or programming skills in languages like Python or R is preferred",
    "compensation": "$122,000/year to $176,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "836880255469338": {
    "title": "North America Field Sales Manager, AR",
    "URL": "https://www.metacareers.com/jobs/836880255469338",
    "location": "Seattle, WA • Burlingame, CA • New York, NY • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Grow sales revenue, market share, brand advocacy and purchase consideration for Meta products Collaborate and build relationships with internal departments (sales, channel, category) to consult on retail field program execution. Lead internal meetings to share results, build strategy, define success, and innovate with new solutions Manage performance of agency’s field sales team including holding account team and ﬁeld management teams accountable to program results. For example: execution metrics, budget, and ROI targets Partner with staffing agencies to consistently reevaluate and optimize field coverage models (quarterly). Manage balance of field time allocation across retailers, products, and channels Facilitate weekly conference calls and daily communication with the agency team. Review all performance measures with agency on a weekly basis Take accountability for results, question gaps, and push for growth Own Quarterly Business Reviews and agency evaluations. Support and motivate the agency field and account team to provide added value to the program and to achieve Meta goals Contribute to event execution strategy and measurement plans. Drive agency staffing plans, education, and reporting. Collaborate on all event recaps and posting efforts including learning and go-forward recommendations Directly partner with Meta Training Lead on VR & Wearables training content, deployment, and measurements Report key industry activity, competitor position, retailer news, and customer issues/inquiries to leadership as actionable insights Deliver analysis of VR & Wearables staffing sales impact in partnership with Data Science team Manage budgets for agency spend. Lead the charge for new contracts, purchase orders and engagement with Finance. Proactively review spend reports to identify gaps and propose solutions",
    "minimum_qualifications": "7+ years of experience working within the retail consumer electronics industry 5+ years of experience leading a retail staffing agency program including: account management, ﬁeld management, or other leadership roles 5+ years of experience managing retail staffing measurements, field team reporting, data tools, analytics and tactics 5+ years of experience in project management leading large and small scale initiatives at retail. Streamlining, troubleshooting, and building new processes Relevant experience managing relationships and consulting with cross-functional stakeholders including Sales and Channel teams Existing knowledge about emerging technologies (AR / VR / Other), GTM strategy, and retail execution High level of accuracy and attention to detail. Experience detecting inconsistencies and proactively building solutions Relevant physical and digital communication skills. Skillset to package and present internal strategies, results, and recommendations",
    "preferred_qualifications": "Direct experience at a consumer electronics manufacturer responsible for staffing or Brand Ambassador programs Experience in the Wearables, Artificial Intelligence, Virtual Reality, or Gaming industry Knowledge of local Consumer Electronic retail chains and penetration strategies Experience with project management tools (example: Asana) Proficiency in dashboard reporting tools including Power BI and Tableau",
    "compensation": "$122,000/year to $176,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "839631455185355": {
    "title": "Research Scientist, Robotic Dexterous Manipulation (PhD)",
    "URL": "https://www.metacareers.com/jobs/839631455185355",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Explore forward-looking ways and novel robotic architectures to advance dynamic in-hand manipulation, generalizable dexterous and functional manipulation (rigid to deformable objects in-hand to against the environment) Research novel sensors, robotic systems architectures, planning and control algorithms that involve tactile and multimodal vision and perception, dexterous manipulation and collision avoidance Develop machine learning models and end-to-end applications for robotics, dexterous manipulation, and contextual understanding Invent novel paradigms for robotics sensing and intelligence, leveraging a variety of sensing and machine perception modalities (images, video, audio, tactile, etc.) Develop efficient models deployable to robotic systems, integrate research into full system-level robotic prototypes",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta Currently has or is in the process of obtaining a PhD degree in Robotics, Artificial Intelligence, Computer Vision, Physical AI, Machine Learning, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta Research experience in at least one of the following research areas: robotics, dexterous manipulation, control theory, optimization algorithms, representation learning, self-supervised learning, multimodal learning, vision-language-action (VLA) models, reinforcement learning, imitation learning, robotics policy development, computer vision, egocentric perception, embodied AI and/or LLMs Experience in C/C++ and Python and deep learning frameworks (e.g., PyTorch, TensorFlow) Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as Robotics (RSS, ICRA, IROS, CoRL, T-RO, IJRR), Machine Learning (NeurIPS, ICML, ICLR, AAAI, JMLR), and Computer Vision (CVPR, ICCV, ECCV, TPAMI) Experience with research and development of humanoid robots Experience with embedded systems and communication protocols Experience with robotics frameworks such as Robot Operation System (ROS), along with experience working with robotic simulations and real-world robots Experience bringing-up and debugging prototype/scientific software-hardware systems (e.g., robotics platforms, multi-camera sensing/tracking solutions, wearable sensing systems) Experience working and communicating cross-functionally in a team environment",
    "compensation": "$117,000/year to $173,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1118624806693191": {
    "title": "Preconstruction Manager - Data Center Design, Engineering, & Construction",
    "URL": "https://www.metacareers.com/jobs/1118624806693191",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Responsible for successful execution of large-scale commercial agreements with external partners from design kick off through construction start, including coordination of multiple team inputs, evaluation and allocation of risk, and incorporation of commercially responsible terms into construction contracts. Provide continued preconstruction subject matter expertise throughout life of the construction execution phase Lead program management alignment of multiple projects in preconstruction phase, including programmatic cost, schedule, and risk comparison, and alignment of implementation and constructability approaches across several internal stakeholder teams Manage reporting of project status, risk, budget, and schedule guidance including reporting key performance indicators for projects in the preconstruction / planning stage and presenting to leadership Provide “bid levelling” to analyze prospective external partner responses by analyzing proposal to ensure scope of work is complete and pricing information is accurate including providing recommendation of successful bidder Interface with Engineering to develop scope criteria, budgets and schedules for new products and projects Support our build strategy including supply chain analysis, vendor selection and developing a roadmap for procurement and contracts models for new programs Lead the development of new processes and tooling as required to support new or existing initiatives as required by the business and operationalize new processes to support new initiatives or improve existing workflows Provide constructability perspective and input into new initiatives or ideas and influence implementation plan or provide critical considerations to be accounted for in TCO analysis Maintain industry connections and develop database of prequalified external partners / potential new partners for design, engineering, and construction services Fully account for implications of change management within our organization support execution team in change evaluation from a preconstruction and commercial accountability perspective. Drive feedback loop efforts to incorporate change mitigation strategies into future design or agreements Partner with Contracts Management team to ensure partners are delivering under the proper agreements with the correct commercial terms Lead and influence stakeholders on high impact initiatives across our delivery organization and broader design/engineering and construction teams to de-risk project delivery (i.e., labor availability / productivity, competition for talent.) Manage and respond to a high volume of daily interaction with cross-functional partners both inside and outside the company",
    "minimum_qualifications": "Bachelor’s degree in construction management, or equivalent technical degree and/or minimum of ten (10) years direct professional experience in Commercial Management, Construction Management or equivalent Demonstrated communication and coordination skills to lead a team towards a single project outcome Familiar with large capital programs, ground-up construction and greenfield site development as well as retrofit construction Proficiency in all aspects of Preconstruction: Budget Development, Scheduling, Change Management, Risk Management, Negotiation, etc Demonstrated understanding and perspective of construction schedules, costs, supply chain analysis, risk analysis, labor markets, project cash flows and commercial contract terms and contract delivery methods",
    "preferred_qualifications": "Mission Critical/ Data Center experience is preferred in addition to hyperscale builds General contractor and / or trade contractor experience including field and office International development experience is preferred",
    "compensation": "$144,000/year to $201,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1158411885823294": {
    "title": "Market Specialist, Global Response Operations, Brazil",
    "URL": "https://www.metacareers.com/jobs/1158411885823294",
    "location": "Austin, TX • Full Time",
    "responsibilities": "Work as part of the Brazil team, enforcing on crisis response within the region Work as part of an On-call Operational structure to enforce on critical content within SEO Markets with a higher focus on Brazil Use a combination of language and market geopolitical knowledge, understanding of cultural, language nuances and minority communities, to capture signals and insights to enforce and solve for complex risk and operational issues within the region Scope scalable solutions to improve the support of our community of users in the market and in partnership with other regions Investigate and resolve issues that are reported on Meta products, such as requests for account support and reports of potentially abusive content including but not limited to graphic images, videos and writings, offensive or derogatory language, and other objectionable material Support enforcement efforts on agnostic content that originates from multiple sources globally, where language expertise is not required Support enforcement efforts identifying integrity risks to our local and regional advertising business and enforce on these risks Support region wide programs of work supporting peak season buying initiatives, protecting advertisers, businesses and removing friction in the ad delivery process Analyze key metrics and collaborate with cross-functional teams to improve our processes and tools Build subject matter expertise around abuse areas prevalent in the region and work with the team on enforcement efforts to manage and control impacts Investigate emerging risk across the region and influence cross-functional resolution Provide input and support on policy recommendations using geopolitical as well as operational understanding with cross-functional partners Remain up-to-date on key workflow changes, operational guidelines, policy updates and our Community Standards Liaise closely with our Meta vendor teams to ensure all operational KPIs meet and exceed targets and work collaboratively to improve processes and tools and scale solutions Support the training and onboarding Meta partners This role may involve exposure to potentially graphic and/or objectionable content including but not limited to graphic images, videos, audio and writings, offensive or derogatory language, and other potential objectionable material, i.e. child exploitation, graphic violence, self-injury, animal abuse, and other content which may be considered offensive or disturbing",
    "minimum_qualifications": "Bachelors degree or equivalent experience in trust and safety, operations, policy or project management Fluency in Portuguese 5+ years of professional experience within an operations environment Experience communicating with a variety of audiences and stakeholders from the Brazil market Strategic thinker with proven analytical and creative problem-solving skills Interest in supporting the Facebook and Instagram community Experience in communication and collaboration Self-starting, intellectually curious and creative individual with experience operating in a fast paced, ever changing environment Ability to work with potentially graphic and objectionable content",
    "preferred_qualifications": "Problem solving/project management experience Technical and data skills such as Excel and SQL and experience with visualisation tools such as Tableau to drive efficient analytics and reporting Experience with training, quality assurance or metrics analysis",
    "compensation": "$97,000/year to $139,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}