{
  "840270818573569": {
    "title": "Finance Manager, Facebook",
    "URL": "https://www.metacareers.com/jobs/840270818573569",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Act as a trusted Finance partner for Product, Engineering, and cross functional Tech leaders. Work collaboratively with these groups to drive continuous improvement in initiatives regarding headcount and expense planning, product investment strategy, and capital allocation Drive nuanced return on investment (ROI) and impact frameworks across headcount, expense, and other investments Proactively lead analytics and projects requiring expertise in Facebook’s business model and share your insights with relevant stakeholders Present financial reporting and forecasts to stakeholders across Facebook and Finance Collaborate with horizontal Financial Planning and Analysis (FP&A) teams and Corporate FP&A to improve and operationalize processes related to core FP&A activities",
    "minimum_qualifications": "10+ years of experience in rigorous FP&A, Strategic Finance, Business Operations, or related organizations demonstrating increasing levels of responsibility Bachelor's Degree in Economics, Finance, Math, Statistics, Engineering, Computer Science, or related discipline Experience using analytical and quantitative modeling skills, including buildout of headcount, operating and driver-based financial models (Microsoft Excel, Google Sheets, SQL) Demonstrated history of building trusted business partner relationships at increasingly executive levels, influencing decisions, and driving alignment on financial targets Consistently takes initiative and approaches business challenges and opportunities with curiosity, clarity, and intention Experience synthesizing strategic insights and problem solving individually or in a group setting",
    "preferred_qualifications": "Advanced degree such as a MS in quantitative field",
    "compensation": "$142,000/year to $205,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "849273494298086": {
    "title": "Product Visualization Specialist",
    "URL": "https://www.metacareers.com/jobs/849273494298086",
    "location": "Seattle, WA • Full Time",
    "responsibilities": "Create state-of-the-art imagery of category-defining products Help create the visual language of our brand through imagery Work collaboratively with multiple cross-functional teams on complex multi discipline programs Conceive elegant, effective ways to showcase our products, highlight features, and inspire consumers Lead/own imagery needs with a combination of internal and external resources",
    "minimum_qualifications": "Bachelor’s degree in design, motion design, art/animation or related field 5+ years of experience in product rendering, 3D animation, 3D art or a related field 2+ years experience of rendering and lighting consumer electronics or wearable tech products Demonstrated expertise in product animation with a solid skill set ranging from concepting and storyboarding to final rendering Domain experience in rendering process from polygon optimization through raytracing Experience working with 3D CAD data Experience in a physically-based rendering program(s) (Redshift, Octane, V-Ray, Arnold, Corona, etc.)",
    "preferred_qualifications": "Experience working within Cinema4D, Redshift, Photoshop, After Effects Expertise in creating and animating VFX (Houdini and/or Cinema4D) Expertise in leading the look and feel of a project Clear understanding of the notions of Metaverse, VR/AR/MR Great knowledge of branding and marketing best practices",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "850850464280320": {
    "title": "Manager, Product Management - Security, Integrity, & Investigations",
    "URL": "https://www.metacareers.com/jobs/850850464280320",
    "location": "Austin, TX • Menlo Park, CA • Washington, DC • New York, NY • San Francisco, CA • Chicago, IL • Full Time + 5 more • Full Time - Hide",
    "responsibilities": "Own the product roadmap for critical systems that enable our organization’s mission to ensure protection of user privacy and safety Structure the team around critical priorities and goals Proactively increase team capacity through efficiency or recruitment Primary driver for identifying significant opportunities and disclosure impacts including new or changes to existing products across the family of applications Build consensus around roadmaps and how to evaluate success by managing the roadmap through tough tactical prioritization decisions while helping the organization think long-term. Build trust with stakeholders by maintaining an understandable, accurate roadmap and by knowing the customer Collaborate across teams and peers of all levels by operating as the critical person in creating alignment between engineering teams and stakeholders Measure success by defining success criteria and metrics at the inception of a product and tracking throughout its lifecycle Display leadership, organizational and execution skills in engagements across the entire organization Maximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm Work with peers of all levels from front-line analysts to executives",
    "minimum_qualifications": "Bachelor's degree 12+ years of product or program management experience Experience leading a team with direct management responsibilities Experience operating independently across a broad problem space, demonstrating critical thinking, and thought leadership Experience leading cross-functional teams towards shared goals",
    "preferred_qualifications": "BS/MS in a technology related area of study Experience in Trust & Safety, Privacy, Legal, or Security related fields Experience weighing business requirements and priorities to produce project plans, engineering estimates, and product roadmaps Experience leading enterprise-wide engagements Willingness to obtain and maintain a U.S. Government NDA",
    "compensation": "$186,000/year to $253,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1154975250031978": {
    "title": "Technical Program Manager, Wearables SW Integration and Releases",
    "URL": "https://www.metacareers.com/jobs/1154975250031978",
    "location": "Sunnyvale, CA • Redmond, WA • Full Time",
    "responsibilities": "Drive cross-organizational and portfolio partners to own and execute several large-scale workstreams to meet goals, building partnerships with managers and engineers across infrastructure and product teams, with a specific focus on software release planning and execution Bootstrap programs in ambiguous areas, requires managing multiple cross organization or cross company interdependencies related to software releases Monitor and report on program progress, including risks and issues, and take necessary actions to mitigate them, particularly for software releases Demonstrate end-to-end ownership and thought leadership across multiple organizations and influence strategic direction impacting long-term plans for critical infrastructure challenges in collaboration with engineering leaders and stakeholders, with an emphasis on release train management and continuous delivery Resolve conflicts, maintain clarity on priorities and drive progress on execution of software releases Resolve intra-organizational issues and escalate or drive solutions to cross-organizational issues related to release schedules and dependencies Drive with technical expertise within the team, coordinating and contributing to engineering deliverables for software releases Collaborate with multiple teams to drive technical analysis, design, development, testing, implementation, and post-implementation phases for software releases",
    "minimum_qualifications": "B.S. in Computer Science, or a related technical field, or equivalent experience 10+ years of experience in software engineering, systems engineering, or technical product/program management, with an emphasis on software release management Proven experience delivering complex technology programs and/or products from inception to delivery Proficiency in understanding user needs, gathering requirements, and defining project scope to ensure alignment with business objectives Experience operating across multiple teams, with demonstrated critical thinking and thought leadership in a release management context Experience in defining and optimizing engineering processes at scale Experience shaping strategy/direction and identifying new opportunities for impact across products, platforms, and programs, with a focus on improving release efficiency and quality Experience communicating effectively at the executive level and influencing leadership and technical management teams to develop systems, solutions, and products, especially regarding release readiness and risk",
    "preferred_qualifications": "",
    "compensation": "$167,000/year to $230,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1341744917550143": {
    "title": "Product Lifecycle Management Analyst",
    "URL": "https://www.metacareers.com/jobs/1341744917550143",
    "location": "Fremont, CA • Full Time",
    "responsibilities": "Drive operational Product Lifecycle Management activities to support New Product Introduction (NPI) as well as Mass Production (MP) programs to include BOM structuring, BOM release and changes, and ECOs while upholding the highest quality and process standards Interface closely with key external suppliers and Meta internal stakeholders (including Sourcing, Procurement Operations, Manufacturing & Product Quality Engineering, Technical Program Management, and Logistics) to accurately and expeditiously process changes Participate in training external suppliers and internal employees on PLM processes and monitor adherence through audits ensure a closed-loop process for all document control functions mitigate PLM risk and identify and eliminate single points of failure Identify and drive process improvement opportunities support adoption of Oracle Fusion and Innovation Management and PLM automation projects Represent PLM in business-critical cross functional projects and help team adapt to changing priorities to hit program goals and timeline Serve as back-up to PLM Support team’s day-to-day activities such as Part Number creation and updating, importing and loading master parts catalogs when needed",
    "minimum_qualifications": "Bachelor's degree in a directly related field, or equivalent practical experience 6+ years relevant supply chain experience including experience with PLM tools and processes, document control and configuration management Technical knowledge of product structure and processes including Bill of Material buildout, change control and PLM standards Proven experience collaborating effectively with cross-functional teams Experience successfully delivering timely impact across multiple high priority projects in a rapidly changing environment Demonstrated experience in translating technical terminology in order to drive understanding and buy-in from a varied range of stakeholders Proven process improvement experience Demonstrated attention to detail Proficiency with Excel or similar spreadsheet tools",
    "preferred_qualifications": "Product lifecycle management experience",
    "compensation": "$122,000/year to $177,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1492265655395492": {
    "title": "Research Engineer - Camera System Prototyping",
    "URL": "https://www.metacareers.com/jobs/1492265655395492",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Develop camera prototypes to demonstrate the latest imaging technology developed by the team Propose camera architectures and derive specifications based on the imaging technology and the target application Design camera PCBs Develop camera drivers on PC, FPGA or other types of image data aggregation chips Develop necessary software stack to integrate the camera prototype into existing algorithm pipeline for use case demonstration Leverage off-the-shelf optical/electrical/mechanical components to shorten development time when needed Identify quick workarounds to mitigate hardware/software bugs",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Master’s degree in the field of Computer Science, Electrical Engineering or related field 3+ years of experience with camera PCB design and layout 5+ years of experience with developing camera drivers on PC, FPGA or other types of image data aggregation chips 5+ years of experience with programming languages such as Python or C++ 5+ years of experience with image processing Familiar with camera optics, understands the relationship and trade-offs among various camera specifications such as pixel size, image area, field of view, angular resolution, MTF etc Familiar with common image sensor interfaces such as I2C/I3C, MIPI C/D-PHY, LVDS Experience with defining mechanical design requirements for cameras",
    "preferred_qualifications": "Proficient in developing FPGA programs Experience with algorithm development for vision based machine learning applications Experience with camera system design in cellphones or wearable devices Experience with image sensor design A PhD degree in the field of Computer Science, Electrical Engineering or related field",
    "compensation": "$147,000/year to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1504594883912480": {
    "title": "Area Schedule Lead - Data Center Design, Engineering and Construction",
    "URL": "https://www.metacareers.com/jobs/1504594883912480",
    "location": "Menlo Park, CA • Fremont, CA • Remote, US • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Technical lead in Schedule Controls on the specified Mega Campus including baseline schedule reviews, schedule updates & reporting, E2E Schedule updates and internal coordination reviews, IMS schedule updates and execution team coordination reviews, schedule change management/Extension of Time (EOT) approval, delay tracking, schedule metric/quality, schedule delay mitigation, and risk facilitation Responsible for application of commercial entitlement for schedule changes and Extension of Time (EOT) in their region. Provide leadership to site teams, Project Controls Analysts and CW Schedulers for Delay Tracking, Extension of Time (EOT) requests and claims. Coordinate the change evaluation in collaboration with the cost team as part of the Change Management review process. Responsible for making recommendations that are in line with the contract and escalating when site decisions differ from the contractual language Support the development of delay mitigation ideas and work directly with Site Leadership in collaboration with other Area Schedule Leads to make recommendations Responsible for the review and approval of all GC and TP Precon Baseline Schedules. In conjunction with the Meta PreCon Manager and with the support of the CW Site Scheduling team Area Schedule Lead will work with GCs & TPs to develop Baseline schedules and resolve all quality and logic issues prior to submission. They will ensure Baseline schedules meet program expectations and are delivered in the agreed upon timeline for the project Analyze and communicate Area’s Project Controls Health (Schedule, & Risk) in support of the Area Project Controls Manager and DEC Leadership and provide escalation when needed Identify proactive project commercial risk in collaboration with other Area Leads, Delivery team and cross-functional partners and support programmatic schedule delay review and mitigation activities Support CW Site Schedules in Area and provide feedback to CW Account leads on any concerns, quality issues, or additional training needed. Support Area by training all new Site Schedulers on processes and procedures and working with Area Managers to ensure projects are adequately staffed and supported Provide support of Area’s schedule reviews, and ensure Proactive Risk Indicators are being identified and used appropriately to identify risk. Support monthly/quarterly communication to site leadership and Strategic Planning & Analytics on schedule risk and health in support of MCP Direct communication with Area Cost Lead to ensure collaboration and alignment of project health between cost and schedule and overall project risk and direct support and coaching for Project Controls Analysts Strategize and drive programmatic efficiencies and opportunities for future Business Controls within DEC including continued alignment with other Area Schedule Leads Work directly with Retrofit Schedule Lead to ensure alignment of processes and procedures and ensure all schedule reporting and risks are escalated properly to Area Managers and site leadership teams Approximately 50% travel to other Data Center sites within the Area and home office",
    "minimum_qualifications": "10+ years of Planning, Scheduling, Construction Management, or Related field experience Bachelor’s degree in Engineering, Construction Management, or Equivalent Technical Field or related field experience Subject Matter Expert in Primavera P6, Microsoft Project, Smartsheets, Lean Planner, TAKT Planning, and other scheduling related methodologies and software Familiar with Earned Value Management, Resource Loaded Schedules, or collection and analysis of resource data Experience developing/managing an Owner’s planning/scheduling program Familiar with Data Center, Manufacturing, Infrastructure or Construction programs requiring complicated commissioning specifications Demonstrated analytical, communication, problem solving, prioritization, organization and reporting skills",
    "preferred_qualifications": "Experience identifying schedule efficiencies and driving programmatic or organizational alignment in changing execution strategies to optimize schedule performance Experience negotiating schedule changes or complex construction claims Successful development and implementation of scheduling or project controls strategies in a large organization Familiar with complex networking systems and electrical infrastructure Experience managing a team of Contingent Worker Schedulers",
    "compensation": "$144,000/year to $201,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2169239866902350": {
    "title": "Director, Supply Chain Insights",
    "URL": "https://www.metacareers.com/jobs/2169239866902350",
    "location": "Sunnyvale, CA • Los Angeles, CA • Full Time",
    "responsibilities": "Implement and evolve the strategy for driving value from data and analytics for the Supply Chain Operations Analytics organization. Own the KPI roadmap, including the development of definitions, performance drivers and other insights, root cause and corrective action analysis and leadership commentary on our progress. Own the analytics roadmap to align with organizational priorities, identifying gaps, risks and communicating progress and shifts to leadership and partners. Grow and nurture a team of motivated analytics professionals through their development and evolution of Analytics solutions and best practices. Collaborate cross-functionally to provide thought leadership and prioritize organizational use cases where data and analytics can add value addressing both Business Intelligence and Advanced Analytics use cases (Model Development, Artificial Intelligence). Collaborate in decision making regarding business and technical trade-offs in data architecture, data governance, measurement strategies and data security. Give a voice to the data and influence future efforts using the power of the teams’ insights.",
    "minimum_qualifications": "10+ years or equivalent experience as a People Manager directly responsible for leading and developing data and analytics teams (Data Architects, Data Engineers, Data Governance, Data Scientists, Business Intelligence Analysts) Experienced Supply Chain professional, familiar with the industry standard definitions, hierarchy of supply chain metrics and how and typical causes for under-performance Adept at developing/delivering business valuable solutions in an Agile delivery environment and familiar with Scrum and Kanban delivery model Strong understanding of the application of statistics in business, such as forecasting, machine learning, causations and correlations Experience influencing technical and non-technical partners with data and insights Able to distill clear and simple themes from complex analytical findings",
    "preferred_qualifications": "Degree in an analytical field (e.g., Information Systems, Computer Science, Engineering, Mathematics, Statistics, Management Science) Hands-on experience in a technical role as a Data Modeler, Data Architect, Data Engineer, or Data Scientist, gathering and decomposing requirements into a technical solution for insights and analysis",
    "compensation": "$222,000/year to $286,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2308254012972454": {
    "title": "Electrical Engineer: Robotics Hardware Engineering",
    "URL": "https://www.metacareers.com/jobs/2308254012972454",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Architect and design electrical engineering solutions for the next generation of robotics that include fabrication and assembly of Printed Circuit Boards, Flexible Printed Circuits, and Rigid Flexible Printed Circuits Develop schematics, guide board layout, assemble, test, debug, and integrate multi-component electrical systems using industry-standard simulation and design packages such as SPICE, MATLAB, Altium or Cadence Establish and conduct collaborations with multidisciplinary partners, both internal and external Embrace constant learning, diving into new areas with unfamiliar technologies, and supporting the ambiguity of robotics problem solving",
    "minimum_qualifications": "5+ years of experience in Electrical Engineering, with a proven track record of contributing to the successful inception, ideation, development, and launch of consumer products BS degree or equivalent experience in Electrical Engineering, Computer Engineering or a related field Experience in one or more of the following systems in the context of Robotic systems: Lithium Battery Systems, High Power (>100W) DC/DC Power Conversion and Distribution, DC Motor Controllers and Drivers, Embedded systems (MCU/GPU), Electrical System Integration, positional sensing (encoders, etc), cable harness design, functional safety systems, and control theory Experience with electrical system integration including schematic and layout using industry-standard simulation and design packages such as SPICE, MATLAB, Altium or Cadence Experience with electrical design verification using standard test and measurement equipment (Oscilloscope, LCR, DMM, Electronic Load, etc) Experience working collaboratively with cross functional Engineering, Safety, Manufacturing, and external partners Experience hands-on in lab assembling and testing systems, including soldering, crimping, and basic mechanical assembly Experience innovating and solving complex design problems",
    "preferred_qualifications": "MS or equivalent experience in Electrical Engineering, Computer Engineering or a related field 8+ years of experience in research or advanced development incubating new tech and guiding them through to product transfer Experience in full Robotics and consumer electronic product design Experience programming in other languages like Python/Java/C#/C++/C, creating initial system bring-up, debugging, and test code Experience with signal and power integrity Experience with vendor engagement and relationship management, including co-design and customization of existing commercial technologies Experience defining and coordinating test procedures in a lab and factory environment to facilitate system bring-up and evaluation Experience with electrical and operational safety controls and procedures Design for Compliance certification and EMI/EMC theory",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}