{
  "649057208027123": {
    "title": "Data Engineering Manager",
    "URL": "https://www.metacareers.com/jobs/649057208027123",
    "location": "Remote, US • Full Time",
    "responsibilities": "Plan, direct, or coordinate activities in such fields as electronic data processing, information systems, systems analysis, and computer programming. Be both a highly technical, and an effective people manager. Be a subject matter expert in at least one specific domain. (examples: product, product infrastructure, infrastructure, machine learning). Lead teams that deliver on multiple projects of increasing dependencies in an ambiguous or high-impact area. Work with team and cross functional partners to define and influence strategy. Work on issues requiring an in-depth knowledge of organizational objectives. Drive roadmap creation and execution. Collaborate with various functions, drive engineering initiatives and have an impact at an organizational level. Participate in technical design. Measure the impact of team and set clear expectations and goals. Manage activities of two or more sections or departments, supervising costs, methods, and staffing. Work effectively with cross functional partners and stakeholders to set and achieve optimal outcomes. Partner with leadership to influence and drive org design, contribution and prioritization. Telecommute from anywhere in the U.S. permitted.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Engineering, Applied Sciences, Mathematics, Physics, or related field, and two years of work experience in the job offered or in a computer-related occupation. Requires two years of experience in the following: Software engineering work experience including hands-on technical management building infrastructure core components Coding in one of the following languages: C++, Java, Javascript, Python, or PHP Architecting, developing, and shipping software products and/or services Building products including front end technologies or backend systems Unix or Linux Scaling high performance, high throughput systems",
    "preferred_qualifications": "",
    "compensation": "$289,786/year to $325,270/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "683940971432625": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/683940971432625",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and 2 years of experience in the job offered or a computer-related field Requires 2 years of experience in the following: 1. Coding in at least one of the following industry-standard languages: C, C++, Java, or C# 2. Building large-scale infrastructure applications 3. Creating web applications using at least one of the following: Python, PHP, or Ruby 4. Relational databases 5. SQL and 6. Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$184,000/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "735993272822151": {
    "title": "Leadership Sourcer, Infrastructure",
    "URL": "https://www.metacareers.com/jobs/735993272822151",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "As a member of Meta’s Infrastructure team, which includes Data Center, Network, Hardware, TPM, Capacity, SOE, Production Engineering, Connectivity Labs, IT and Security, work closely with our Recruiters and Hiring Managers to develop creative strategies to find the best talent globally. Engage with senior level hiring partners at Director and VP level at Meta to deeply understand technical requirements of the roles, the functions, and how the roles fit into the organization. Team with Coordinators, Recruiters, HRBPs, and Recruiting Leadership to manage an efficient model of operation. Strategize different ways to build talent pipelines for senior level technical talent and senior level organizational leaders by executing on tactical research, referral generation, events, and sourcing campaigns. Find, engage, and activate passive candidates through the use of Boolean, LinkedIn and creative search techniques. Screen resumes and interview candidates to determine fit and sell passive candidates. Regularly track pipeline activity by reviewing weekly metrics and conversation rates to share with internal stakeholders. Recommend and drive improvements that impact global pipeline areas. Telecommuting is permitted from anywhere in the United States.",
    "minimum_qualifications": "Bachelor’s degree (or foreign equivalent) in Business Administration, Human Resources, Information Technology, Financial Management, or related field, and 2 years of work experience in job offered or in a recruiting-related occupation Experience must include 2 years in the following: Researching and sourcing candidates as part of a search firm or in-house recruiting team Candidate engagement Technical and industry experience with target companies, conferences, and open source communities Implementing targeted external sourcing initiatives Forming strong partnerships with business leaders, human resources, compensation and other key stakeholders Influencing hiring decisions and driving strategic closing strategies resulting in low decline ratio Planning and defining recruitment models to fulfill staffing needs Owning the full recruitment cycle, including sourcing, interviewing, negotiating, offering and closing out candidates for assigned requisitions Communicating with business partners and management regarding recruitment strategies and results",
    "preferred_qualifications": "",
    "compensation": "$226,024/year to $237,600/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "739429985783998": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/739429985783998",
    "location": "New York, NY • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications, and systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems, and be able to drive the overall direction / expansion of the assigned area. Demonstrate proficiency in data analysis (including definition of success metrics for teams and products), programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate large scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Provide feedback and take action on incremental improvements of development standards. Drive complex projects from inception to completion, working cross-functionally across various roles. Set technical direction for products and platforms, helping the team, organization and company unlock greater impact. Provide technical leadership across several engineering teams, helping the teams set and hit goals, including mentoring other engineers and aligning them with opportunities for growth and impact.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL, and Implementing web interfaces using the following: JavaScript, HTML, and CSS",
    "preferred_qualifications": "",
    "compensation": "$302,134/year to $339,130/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "775922555205195": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/775922555205195",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and 2 years of experience in the job offered or a computer-related field Experience must include 2 years of experience in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational (including SQL) and Non-Relational Databases DevOps, implementing network protocols and managing Linux/Unix operating systems Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$190,732/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "777660251912858": {
    "title": "Data Scientist, Analytics",
    "URL": "https://www.metacareers.com/jobs/777660251912858",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop and monitor product metrics to ensure product quality as well as targets for the product team. Design, implement and interpret complex statistical experiments for Meta products and users. Research and Development projects to guide future product development and investment. Quantify risk and mitigations that may impact existing Meta products using statistical tools. Collect, organize, interpret, and summarize statistical data in order to contribute to the design and development of Meta products. Apply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how our users interact with both our consumer and business products. Partner with Product and Engineering teams to solve problems and identify trends and opportunities. Inform, influence, support, and execute our product decisions and product launches. May be assigned projects in various areas including, but not limited to, product operations, exploratory analysis, product influence, and data infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions.",
    "minimum_qualifications": "PhD Degree (or foreign equivalent) in Computer Science, Agricultural and Applied Economics, Engineering, Mathematics, Physics, Applied Sciences, or related field Position also requires completion of a university-level course/research project/internship/thesis in the following: 1. Performing quantitative analysis including data mining on highly complex data sets 2. Data querying language: SQL 3. Scripting language: Python 4. Statistical or mathematical software including one of the following: R, SAS, or Matlab 5. Applied statistics or experimentation, such as A/B testing, in an industry setting 6. Machine learning techniques 7. ETL (Extract, Transform, Load) processes 8. Relational databases 9. Large-scale data processing infrastructures using distributed systems 10. Quantitative analysis techniques, including one of the following: clustering, regression, pattern recognition, or descriptive and inferential statistics",
    "preferred_qualifications": "",
    "compensation": "$218,284/year to $235,400/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "791068003786389": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/791068003786389",
    "location": "New York, NY • Full Time",
    "responsibilities": "Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebook's products create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Bachelor’s degree (or foreign equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics or related field and 2 years of experience in the job offered or in a computer-related occupation Experience must include 2 years in the following Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) C, C++, C#, or Java Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Distributed systems including sharding, consistency, and availability Algorithms",
    "preferred_qualifications": "",
    "compensation": "$193,000/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "798102063089673": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/798102063089673",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Lead and coordinate team efforts on project planning, execution, and monitoring, facilitating collaboration with cross-functional partners for smooth project delivery. Provide mentorship and guidance to fellow engineers, fostering professional growth and skill development within the team. Analyze product data to identify potential areas of opportunity, driving the enhancement of existing products and systems or the initiation of new projects.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Electrical and Computer Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field Position also requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL and Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$222,703/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "811851477893450": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/811851477893450",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large, distributed components that run Facebook. Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebook's products create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem-solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Bachelor's degree (or foreign equivalent degree) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field Position also requires completion of a university-level course, research project, internship, or thesis in the following: Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) C, C++, C#, or Java Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Distributed systems including sharding, consistency, and availability, AND Algorithms",
    "preferred_qualifications": "",
    "compensation": "$203,350/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "814604064258223": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/814604064258223",
    "location": "New York, NY • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or Python Testing software applications through unit testing Object-Oriented Programming concepts Building complex relational databases and SQL, AND Data structures and algorithms",
    "preferred_qualifications": "",
    "compensation": "$184,187/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "820278877089617": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/820278877089617",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Design and develop cutting-edge Generative AI-powered tools for advertisers, leveraging advanced machine learning models, Large Language Models (LLMs), and econometric techniques to drive business growth and innovation. Collaborate with cross-functional teams to integrate Generative AI solutions into existing advertising platforms, ensuring seamless user experiences and optimal performance. Develop and maintain reliable, efficient, and scalable backend computing architectures and models to power Generative AI tools, utilizing expertise in system design, data analysis, and causal inference. Ensure the security, integrity, and compliance of all systems and data, adhering to Meta's high standards for data protection and privacy. Enhance ranking algorithms for fairness, personalization, and Small and Medium-sized Businesses (SMBs) empowerment, using econometric theory, machine learning methods, and data analysis to optimize algorithmic performance. Conduct research and experimentation to identify areas for improvement and develop innovative solutions to complex problems. Design and conduct experiments to analyze advertiser user behavior, identifying key business needs and decision-making patterns using causal inference, machine learning, and econometric techniques. Contribute to knowledge development by presenting findings and sharing insights with internal stakeholders and the broader academic community. Apply advanced data analysis and machine learning techniques to large datasets, extracting insights and developing predictive models that inform business decisions and drive growth. Utilize LLMs, natural language processing (NLP), and computer vision to analyze and generate content, optimizing advertising campaigns and improving user engagement. Design and develop recommendation systems that leverage Generative AI, machine learning, and collaborative filtering to provide personalized advertising experiences for users. Integrate GenAI-powered recommendation systems with existing advertising platforms, ensuring seamless user experiences and optimal performance. Continuously evaluate and refine recommendation systems to ensure they meet evolving user needs and preferences. Collaborate with cross-functional teams, including product management, design, and engineering, to ensure the successful development and deployment of Generative AI-powered tools and systems. Communicate complex technical concepts and research findings to non-technical stakeholders, providing clear and actionable insights that inform business decisions.",
    "minimum_qualifications": "Ph.D. (or foreign degree equivalent) in Information Technology Management, Computer Science, Economics, Statistics, or a related field, and 6 months of experience in the job offered or in a computer-related occupation Experience must include 6 months of experience in the following: Machine learning,econometrics, and statistical modeling Large language model development and implementation Causal inference techniques,including instrumental variables,regression discontinuity, and difference-in-differences Programming in Hack, Python, Java, C++, R, and Julia Machine learning frameworks, including Tensor Flow and PyTorch Generative AI technologies, including GANs, VAEs,and LLMs Data analysis and visualization using pandas, NumPy,and Matplotlib Cloud infrastructure environments, including AWS and Google Cloud Platform Software development principles, including design patterns, testing methodologies, and version control systems",
    "preferred_qualifications": "",
    "compensation": "$203,350/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "821341880415328": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/821341880415328",
    "location": "New York, NY • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field. Requires completion of a university-level course/research project/internship/thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL and Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$182,002/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "826294256590500": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/826294256590500",
    "location": "Remote, US • Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for algorithmic planning software services that model for general computing and generative Al. Develop a strong understanding of algorithmic planning, as it pertains to optimizing the capacity layout of Meta data centers (Gigawatt scale) to fulfill capacity commitments to product organizations. (SL to drive business outcomes and maintain competitiveness in the Al space). Leverage understanding of computing architecture and workload characteristics to optimize utilization of heterogenous hardware for use-cases including IO/memory-bound, massively distributed, Al inference, Al training. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Telecommute from home is permitted.",
    "minimum_qualifications": "Requires a bachelor’s degree in computer science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Building large-scale, distributed infrastructure applications Experience in linear optimization and integer programming Understanding and implementing adaptive and learning algorithms Computational intelligence Optimization of computing system performance Experience in C/C++ multi-threaded programming",
    "preferred_qualifications": "",
    "compensation": "$221,075/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "828192116348015": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/828192116348015",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run applications. Build new features and improve existing products. Work on problems of diverse scope and design core, backend software components. Handle large-scale data storage, synchronization and coordination of large server cluster, and provide a runtime environment for front end code. Receiving little instruction on day-to-day work, code using primarily CIC++, Java, PHP and Hack. Interface with other teams to incorporate their innovations and vice versa. Conduct design and code reviews. Analyze and improve efficiency, scalability, and stability of various system resources. Complete medium to large features (each with many tasks) independently without guidance. Identify and drive changes as needed for assigned codebase, product area and/or systems.",
    "minimum_qualifications": "Requires a Master's Degree (or foreign equivalent) in Digital Arts, Computer Science, Engineering, Mathematics, Analytics, or related field and 36 months of experience in the job offered or in a related occupation Experience must include 36 months involving the following: Coding in one of the following industry-standard languages: C, C++, Java, or C# Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other 'nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Build highly-scalable performant solutions Data processing, programming languages, databases, networking, operating systems and Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "828663199660129": {
    "title": "Product Marketing Manager",
    "URL": "https://www.metacareers.com/jobs/828663199660129",
    "location": "Austin, TX • Menlo Park, CA • Seattle, WA • New York, NY • San Francisco, CA • Full Time + 4 more • Full Time - Hide",
    "responsibilities": "Lead market assessment, quantitative analysis, qualitative feedback, and represent the requirements of the market internally with Product Management and Engineering Understand advertiser needs/requirements and product risk areas in order to prioritize recommendations to product, engineering, and design teams for new and existing products Coordinate cross-functional projects across Meta that build new innovative solutions for advertisers/marketers to ensure that products and solutions are incorporated into the platform in a consistent and strategic manner Ensure the right level of alignment, consistency and flexibility in approach across regional and vertical teams, with the goal of scaling impact while meeting market-specific needs Own go-to-market strategy for a portfolio of products and solutions by coordinating with cross-functional teams to develop client communications, product documentation, and positioning Coordinate successful go-to-market activations across multiple internal sales and partnerships teams by crafting effective messaging for a variety of audiences and enabling go-to-market teams at scale",
    "minimum_qualifications": "8+ years of professional experience in technology or internet technology, ad-tech, strategic marketing, product management, or management consulting Experience collaborating across cross-functional teams and enrolling the necessary leadership support to drive resolution in the context of competing perspectives Analytical, data driven decision-maker with experience using deductive reasoning to simplify and communicate complex issues Organizational and people skills and experience setting priorities, problem-solving, multitasking and working independently in a dynamic, rapidly changing workplace Communication experience that is effective with technical, business, and external stakeholders Bachelor's Degree in Business, Marketing or Creative discipline",
    "preferred_qualifications": "MBA or other relevant advanced degree Experience in a product marketing capacity (partnering closely with product management, product marketing and/or engineering to represent market/customer requirements and supporting product launches) Experience coordinating go-to-market for products with global reach end-to-end, including sales enablement and authoring positioning/narrative",
    "compensation": "$128,000/year to $186,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "998357492128826": {
    "title": "Software Engineer, Machine Learning",
    "URL": "https://www.metacareers.com/jobs/998357492128826",
    "location": "Sunnyvale, CA • Bellevue, WA • Redmond, WA • Austin, TX • Menlo Park, CA • Seattle, WA • Burlingame, CA • Washington, DC • Boston, MA • New York, NY • San Francisco, CA • Remote, US • Full Time + 11 more • Full Time - Hide",
    "responsibilities": "Collaborate with cross-functional teams (product, design, operations, infrastructure) to build innovative application experiences Implement custom user interfaces using latest programming techniques and technologies Analyze and optimize code for quality, efficiency, and performance, and provide feedback to peers during code reviews Set direction and goals for teams, lead major initiatives, provide technical guidance and mentorship to peers, and help onboard new team members Architect efficient and scalable systems that drive complex applications Identify and resolve performance and scalability issues, and drive large efforts to reduce technical debt Work on a variety of coding languages and technologies Establish ownership of components, features, or systems with expert end-to-end understanding",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 8+ years of programming experience in a relevant language OR 4+ years experience with a PhD Demonstrated experience driving change within an organization and leading complex technical projects Experience utilizing data and analysis to explain technical problems and provide detailed feedback and solutions",
    "preferred_qualifications": "Masters degree or PhD in Computer Science or a related technical field Experience with frameworks like TensorFlow, PyTorch, or Scikit-learn Knowledge of NLP techniques, including text preprocessing, tokenization, and sentiment analysis Understanding of information retrieval concepts, such as indexing, querying, and ranking Demonstrated grasp of data structures and algorithms, including graph theory and optimization techniques",
    "compensation": "$85.10/hour to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1075389717795087": {
    "title": "Software Engineer (Technical Leadership) - Machine Learning",
    "URL": "https://www.metacareers.com/jobs/1075389717795087",
    "location": "Sunnyvale, CA • Bellevue, WA • Menlo Park, CA • Seattle, WA • Burlingame, CA • Washington, DC • Remote, US • New York, NY • San Francisco, CA • Full Time + 8 more • Full Time - Hide",
    "responsibilities": "Drive the team's goals and technical direction to pursue opportunities that make your larger organization more efficient Effectively communicate complex features and systems in detail Understand industry & company-wide trends to help assess & develop new technologies Partner & collaborate with organization leaders to help improve the level of performance of the team & organization Identify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas Lead long term technical vision and roadmap for large cross-company efforts Suggest, collect and synthesize requirements and create an effective feature roadmap Identify and resolve performance and scalability issues, and drive large efforts to reduce technical debt",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 12+ years of programming experience in a relevant language OR 8+ years experience with a PhD Proven track record of planning multi-year roadmap in which short-term projects ladder to the long-term mission Experience driving large cross-functional/industry-wide engineering efforts Experience utilizing data and analysis to explain technical problems and provide detailed feedback and solutions Experience communicating and working across functions to drive solutions Experience mentoring/influencing executive stakeholders across organizations",
    "preferred_qualifications": "Masters degree or PhD in Computer Science or a related technical field Experience with frameworks like TensorFlow, PyTorch, or Scikit-learn Knowledge of NLP techniques, including text preprocessing, tokenization, and sentiment analysis Understanding of information retrieval concepts, such as indexing, querying, and ranking Demonstrated experience with data structures and algorithms, including graph theory and optimization techniques",
    "compensation": "$213,000/year to $293,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1110649067932732": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1110649067932732",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Master's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field. Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS and Conducting design and code reviews",
    "preferred_qualifications": "",
    "compensation": "$229,501/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1126631239534969": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/1126631239534969",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run applications. Build new software features and improve existing products. Work on software problems of moderate scope. Push code, and drive the development of the systems behind company products. Create web applications that reach billions of people. Build high-volume servers, and be a part of a team to connect people around the globe. Develop relevant product area, codebase, and systems. Demonstrate proficiency in data analysis, programming and software engineering, and apply mathematical principles or statistical approaches to solve software engineering problems. Produce high quality code with good test coverage, while using modern abstractions and frameworks. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Requires a Master’s degree(or foreign degree equivalent) in Computer Science, Engineering, Mathematics, Statistics, Data Science, or a related field Completion of one graduate-level course, research project, or internship involving the following: Coding in one of the following industry- standard languages: C, C++, C#, Java, or JavaScript Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Core web technologies: HTML, CSS, or JavaScript Algorithms Data processing, programming languages, databases, networking, operating systems, computer graphics, or human-computer interaction",
    "preferred_qualifications": "",
    "compensation": "$203,350/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1152765116215474": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1152765116215474",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL, AND Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1210835817550650": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/1210835817550650",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field Requires completion of at least one graduate-level course, research project, or internship in each of the following: 1. Coding in at least one of the following industry-standard languages: C, C++, Java, or C# 2. Building large-scale infrastructure applications 3. Creating web applications using at least one of the following: Python, PHP, or Ruby 4. Relational databases 5. SQL 6. Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$178,360/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1287018999842645": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1287018999842645",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. Research, design, and develop new algorithms and techniques to improve the efficiency and performance of Meta’s platforms. Design and implement large-scale distributed software systems to serve large numbers of complex requests simultaneously and without failure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Suggest, collect, and synthesize system requirements from stakeholders. Exercise judgment within defined procedures and practices to determine appropriate action. Identify and drive changes as needed for assigned codebase, product area and/or systems. Conduct design and code reviews. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS Algorithms, data structures, or systems software Data management, programming languages, databases, operating systems Distributed systems",
    "preferred_qualifications": "",
    "compensation": "$178,360/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1301927895064625": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/1301927895064625",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product areas, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to a specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, or a related field. Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Applying principles of human-computer interaction to design user-centric interfaces for large-scale applications Creating web applications using at least one of the following: Python, PHP, Ruby, Node.js or React.js Relational databases and SQL and Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1316236549965510": {
    "title": "Data Analyst, Global Partnerships & Content",
    "URL": "https://www.metacareers.com/jobs/1316236549965510",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Apply expertise in quantitative analysis and the presentation of data in developing an authoritative view on the value that Meta’s products deliver to both Meta and partners (creators, media publishers etc.). Collaborate directly with other teams to leverage analyses to inform, influence, support, and execute product and business strategy decisions. Advocate for partner-growth centric approach to inform product strategy while working cross-functionally across the Family of Apps, as well as with Product Management and Data Science. Contribute to technical day-to-day feedback on analyses. Proactively participate in discussions about product growth with executives and stakeholders while ensuring that analyses lead to clear, actionable, recommendations and impactful decisions.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Mathematics, Statistics, Data Analytics, Applied Sciences, Computer Engineering, or a related field, and five years of progressive, post-baccalaureate work experience in the job offered or in a quantitative analysis-related occupation Requires five years of experience in the following: Designing, monitoring and analyzing key performance indicators (KPIs) to make performance-related determinations Experience designing or developing performance tracking dashboards using SQL, Excel or Tableau Experience designing data warehouses involving large data sets Client relationship management, including experience collaborating with representatives of cross-functional departments Sales or product performance analysis in regional or international markets Performing project management based on analysis of business or technical requirements and Experience overseeing data warehousing initiatives or operations and formulating data-driven product or business solutions",
    "preferred_qualifications": "",
    "compensation": "$232,928/year to $245,520/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1337757251264424": {
    "title": "Product Specialist",
    "URL": "https://www.metacareers.com/jobs/1337757251264424",
    "location": "Burlingame, CA • Full Time",
    "responsibilities": "Plan, initiate, and manage information technology projects for web-based products and platforms. Lead the ideation, technical development, and launch of innovative tools, platforms, and/or products. Drive product development with teams of world-class engineers and designers. Work closely with cross-functional teams to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), and guide the team through key milestones. Integrate usability studies, research, and market analysis into product requirements to improve engineer productivity and enhance user satisfaction. Define and analyze metrics that inform the success of products. Identify and track key performance metrics.",
    "minimum_qualifications": "Bachelor's degree (or foreign equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences or related field and 2 years of experience in the job offered or in a computer-related occupation Experience must include 2 years in the following: Product management or product design Technical architecture of complex and highly scalable web applications or media products Designing simple and intuitive user interfaces Creating examples through wire frames and mock ups Developing social products, technologies, or platforms Working in a technical environment with a broad, cross functional team Delivering technical presentations Analyzing complex, large-scale data sets and making decisions based on data Gathering requirements across diverse areas and users, and converting and developing them into a product solution and Technical experience with analytical tools, methodologies, and design",
    "preferred_qualifications": "",
    "compensation": "$136,000/year to $154,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1342752504229017": {
    "title": "Software Engineer, Android",
    "URL": "https://www.metacareers.com/jobs/1342752504229017",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Research, design, develop, and test operating systems-level software, compilers, and network distribution software for user interfaces, infrastructure, and/or tools supporting applications on Android using the Android SDK. Work closely with product and design teams to build new and innovative application experiences for Android. Work on problems of moderate scope and implement custom native user interfaces using the latest Android programming techniques. Receiving general instructions on routine work and detailed instructions on new projects or assignments, build reusable Android software components for interfacing with back-end platforms. Resolve a variety of issues by analyzing and optimizing UI and infrastructure application code for quality, efficiency, and performance.",
    "minimum_qualifications": "Requires a Master’s degree in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field Requires completion of a university-level course, research project, internship, or thesis in the following: Object-oriented software development Building Android applications in Java using Android SDK AOSP (Android Open Source Project) Android internals or frameworks services Coding in Java Building maintainable and testable codes bases including API design and unit testing techniques Multithreading programming and mobile memory management Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Build highly-scalable performant solutions Data processing, programming languages, databases, networking, operating systems, computer graphics, or human-computer interaction Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems Distributed systems",
    "preferred_qualifications": "",
    "compensation": "$187,590/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1346516503854562": {
    "title": "Systems Integration Engineer",
    "URL": "https://www.metacareers.com/jobs/1346516503854562",
    "location": "Fremont, CA • Full Time",
    "responsibilities": "Lead new product introduction and associated processes for the successful launch of new hardware platforms into our data centers globally. Lead architecture reviews with hardware engineering teams to analyze and develop diagnostic coverage plans for both hardware and software. Lead hardware reviews and drive system Design for Serviceability requirements to ensure form, fit and function for new hardware development in our existing data center environment/architecture. Lead the development and execution of Data Center readiness tooling validation testing based on tooling development plans. Early engagement with design development teams (both internal and external) to drive improvements and influence hardware and tooling architecture. Collaborate with cross functional teams & development partners to deliver aligned new hardware platform roadmaps and gain agreement on implementation milestones. Collaborate with cross functional partners in Meta’s Data Center Operations team to understand infrastructure deployment and operational requirements. Collaborate with Production Engineers, Hardware Validation Engineers, Tooling Automation Engineers, and Data Center Operations Engineers to build thorough test strategy and test plans for validating the software needed for Data Center Operations. Work with ODM/OEM vendors as needed to define the product specifications, development plans & test plans. Capturing lessons learned for issues in Production and creating test cases to address those issues in future hardware platforms. Experience triaging, testing, developing, and debugging hardware platforms. Demonstrate technical skills and experience creating documentation for users of all levels.",
    "minimum_qualifications": "Requires Master’s degree (or foreign equivalent) in Industrial and Systems Engineering, Mechanical Engineering, Optical Engineering, Physics, Electronics, or a related field Requires graduate-level course, research project, or internship involving the following : Modeling and Simulation: Simio and FlexSim, Queueing theory, Discrete event simulation (warehouse optimizations) Lean Six Sigma green belt: lean manufacturing, statistical process control, statistical analysis tools (minitab) Advanced Engineering Analytics: (Data modeling, programming, data visualization, System Architecture and Integration) using Python Electronics Packaging: domain knowledge of semiconductor manufacturing industry at various levels of packaging, theory and applications of surface mount technology and associated abnormalities Business Intelligence Tools: PowerBI and Kibana Computational Tools: practical code-writing for scientific and engineering problems using Mathematica, Julia, and VBA Statistical analysis and methodologies Enterprise Systems Engineering: Lean Manufacturing and Project Management Supply chain network optimization and Inventory Optimization and AI model development for Natural Language Processing",
    "preferred_qualifications": "",
    "compensation": "$167,792/year to $221,100/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1356292036188674": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/1356292036188674",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run Facebook. Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebook's products, create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receiving general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Master’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field and 2 years of experience in the job offered or in a computer-related occupation Requires 2 years of experience in the following: Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Build highly-scalable performant solutions Data processing, programming languages, databases, networking, operating systems, computer graphics, or human-computer interaction Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems Distributed systems",
    "preferred_qualifications": "",
    "compensation": "$184,522/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1394859142645404": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1394859142645404",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign equivalent degree) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and 2 years of work experience in the job offered or a computer-related field Requires 2 years of experience in the following: Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) Building large-scale infrastructure applications Creating web applications using at least one of the following: PHP (or its variant), or Ruby Relational databases and SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS and Linux, UNIX, or other *nix-like OS including file manipulation and simple commands",
    "preferred_qualifications": "",
    "compensation": "$181,030/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1413733767036677": {
    "title": "Software Engineer (Product)",
    "URL": "https://www.metacareers.com/jobs/1413733767036677",
    "location": "San Francisco, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions. Work independently, use available resources to get unblocked, and complete tasks on schedule by exercising strong judgment and problem solving skills. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. In connection with these duties, may apply knowledge of the following: Coding in industry-standard languages like C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using Python, PHP, or Ruby Relational databases and SQL and Implementing web interfaces using JavaScript, HTML, or CSS.",
    "minimum_qualifications": "Requires a Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Engineering, or a related field Requires Completion of a university-level course, research project, internship, or thesis in each of the following: C, C++, C#, or Java Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript and Algorithms",
    "preferred_qualifications": "",
    "compensation": "$222,772/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1422260905538035": {
    "title": "Software Engineer, Machine Learning",
    "URL": "https://www.metacareers.com/jobs/1422260905538035",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Research, design, develop, and test operating systems-level software, compilers, and network distribution software for massive social data and prediction problems. Have industry experience working on a range of classification and optimization problems, e.g. payment fraud, click-through or conversion rate prediction, click-fraud detection, ads/feed/search ranking, text/sentiment classification, collaborative filtering/recommendation, or spam detection. Working on problems of moderate scope, develop highly scalable systems, algorithms and tools leveraging deep learning, data regression, and rules based models. Suggest, collect, analyze and synthesize requirements and bottleneck in technology, systems, and tools. Develop solutions that iterate orders of magnitude with a higher efficiency, efficiently leverage orders of magnitude and more data, and explore state-of-the-art deep learning techniques. Receiving general instruction from supervisor, code deliverables in tandem with the engineering team. Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU).",
    "minimum_qualifications": "Requires a Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field and 2 years of experience in the job offered or in a computer-related occupation Requires 2 years of experience in the following: 1. Machine Learning Framework(s): PyTorch, MXNet, or Tensorflow 2. Machine learning, recommendation systems, ranking systems, computer vision, natural language processing, data mining, or distributed systems 3. Translating insights into business recommendations 4. Hadoop/HBase/Pig or MapReduce/Sawzall/Bigtable/Spark 5. Scripting languages such as Perl, Python, PHP, or shell scripts 6. Python, PHP, or Haskell 7. Relational databases and SQL 8. Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) 9. Linux, UNIX, or other *nix-like OS including file manipulation and simple commands 10. Building highly-scalable performant solutions 11. Data structures and algorithms",
    "preferred_qualifications": "",
    "compensation": "$173,425/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1435030534236356": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/1435030534236356",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run Facebook. Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebook's products create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Requires a Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field and 2 years of experience in the job offered or in a computer-related occupation Requires 2 years of experience in the following: 1. Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) 2. C, C++, C#, or Java 3. Python, PHP, or Haskell 4. Relational databases and SQL 5. Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) 6. Linux, UNIX, or other *nix-like OS including file manipulation and simple commands 7. Core web technologies: HTML, CSS, or JavaScript 8. Building highly-scalable performant solutions 9. Distributed systems including sharding, consistency, and availability and 10. Algorithms",
    "preferred_qualifications": "",
    "compensation": "$182,239/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1474556086999861": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1474556086999861",
    "location": "New York, NY • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences or related field and 1 year of experience in the job offered or a computer-related field Experience must include 1 year in the following: 1. Coding in at least one of the following industry-standard languages: C, C++, Java, or C# 2. Building large-scale infrastructure applications 3. Creating web applications using at least one of the following: Python, PHP, or Ruby 4. Relational databases 5. SQL 6. Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$226,064/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1478519960019672": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/1478519960019672",
    "location": "Seattle, WA • Full Time",
    "responsibilities": "Research, design, develop, and test network distribution and operating systems-level software specifically for large-scale distributed components powering critical systems. Develop and optimize load balancing, ensuring robust functionality for highly scalable and distributed environments. Enhance and build features for traffic management systems, focusing on efficient routing and resource allocation through custom load-balancing mechanisms utilizing eBPF and XDP. Drive the architecture and code development of web applications and services reaching millions, creating high-volume, scalable servers. Develop deep expertise in specialized codebases and distributed systems, emphasizing low-level networking and performance optimization. Produce high-quality code, following strict testing standards and leveraging modern software engineering frameworks. Collaborate and work independently, troubleshoot efficiently, and exercise advanced problem-solving skills to resolve complex network and load-balancing challenges. Adhere to development and release standards to handle progressively complex tasks. Actively provide and seek feedback in alignment with performance standards.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Engineering, Applied Sciences, or a related field Requires completion of an university-level course, one research project, or one internship involving the following Coding in at least two industry-standard languages (e.g., Java, Python, C++, or Rust) Proficiency in C, C++, and Python Linux network programming, event-driven programming, multithreaded programming, and system-level and application-level programming Database management with relational databases and SQL, focusing on data-intensive systems Use of software development tools, including code editors (VIM, VSCode) and version control systems (Git) Linux or UNIX-based OS usage, including command-line proficiency and file manipulation for networking and distributed systems Core web technologies (HTML, CSS, JavaScript) for building front-end interfaces Distributed systems design principles, including sharding and consistency models Algorithms for network protocols, load balancing, and performance optimization In-house and open-source software development, with collaboration and version control in public and private repositories Traffic management problem-solving, including issue diagnosis and resolution in load balancing and service continuity Data analysis for system monitoring and optimization, including statistical validation and anomaly detection Network packet analysis using tcpdump, xdpdump, Wireshark, and similar tools for traffic inspection and debugging Containerization technologies and large-scale cluster management systems for orchestration and infrastructure management Automated monitoring and alerting systems based on performance metrics, including error rates and packet drops, for proactive system health management",
    "preferred_qualifications": "",
    "compensation": "$176,361/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1488694159129948": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1488694159129948",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. Be able to conduct A/B tests to measure (1) metrics impacts of coded improvements versus the production, and (2) metrics difference between test variants. Demonstrate skillful use of SQL and data analysis tools to explain the cause of such metric moves. When newly developed product logic or user interface regresses product performance (measured by latency and timeout), be able to look into the product UI or infra, identify the root cause, and optimize product performance. May be assigned to specific group focused on product or infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions. Work independently, use available resources to get unblocked, and complete tasks on schedule by exercising strong judgment and problem solving skills. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Master's degree (or foreign equivalent) in Computer Engineering, Electrical Engineering, Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS Leveraging frameworks including experience in at least one of the following: React or React Native Conducting design and code reviews A/B testing and experiment result analysis Performance optimization of large systems",
    "preferred_qualifications": "",
    "compensation": "$178,360/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1497441068210884": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1497441068210884",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Perform full stack web or mobile application development with a variety of coding languages. Create consumer products and features using internal programming language Hack. Implement web or mobile interfaces using XHTML, CSS, and/or JavaScript. Work closely with Product Manager to define feature specifications and build products leveraging frameworks such as React and React Native. Work closely with operations and infrastructure to build and scale back-end services. Build report interfaces and data feeds. Conduct design and code reviews. May be assigned to specific group focused on product or infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions. Complete medium to large features (each with many tasks) independently without guidance. Identify and drive changes as needed for assigned codebase, product area, or systems.",
    "minimum_qualifications": "Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field, and five years of progressive, post-baccalaureate work experience in the job offered or in a computer-related occupation Requires five years of experience in the following Full stack web/mobile application development in at least one of the following industry-standard languages: C, C++, Java, or C# Relational databases and SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS Leveraging frameworks including experience in at least one of the following: React or React Native and Conducting design and code reviews",
    "preferred_qualifications": "",
    "compensation": "$225,077/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1499416524706534": {
    "title": "Software Engineer (Fullstack)",
    "URL": "https://www.metacareers.com/jobs/1499416524706534",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Triage and resolve issues raised by art production vendors. Carry out feature design and development of the vendor portal. Facilitate daily scripts jobs that are crucial for safeguarding asset integrity. Provide support for user feedback groups, addressing user queries related to asset or release operations. Assist in triaging and redirecting asset, technology and process questions to the appropriate teams. Coordinate the release content schedule across various asset production teams. Assist in release content management to ensure all intended content and hotfixes are included for a release.",
    "minimum_qualifications": "Bachelor’s degree (or foreign equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics or related field Requires completion of one university-level course, one research project, or one internship involving the following: PHP and Hack C++ Python React framework Large scale Entity storage infrastructure and frameworks Large scale Object storage infrastructure and frameworks Triage and resolve coding issues",
    "preferred_qualifications": "",
    "compensation": "$176,361/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1543873090311947": {
    "title": "Software Engineer (Android)",
    "URL": "https://www.metacareers.com/jobs/1543873090311947",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Research, design, develop, and test operating systems-level software, compilers, and network distribution software for user interfaces, infrastructure, and/or tools supporting applications on Android using the Android SDK. Work closely with product and design teams to build new and innovative application experiences for Android. Work on problems of moderate scope and implement custom native user interfaces using the latest Android programming techniques. Receiving general instructions on routine work and detailed instructions on new projects or assignments, build reusable Android software components for interfacing with back-end platforms. Resolve a variety of issues by analyzing and optimizing UI and infrastructure application code for quality, efficiency, and performance.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Computer Science, Engineering, or a related field. Requires completion of an undergraduate- level course, research project, or internship involving the following: Object-oriented software development Coding in Java Building maintainable and testable codes bases including API design and unit testing techniques Multithreading programming and mobile memory management Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Distributed systems including sharding, consistency, and availability and Algorithms",
    "preferred_qualifications": "",
    "compensation": "$185,644/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1653546779365383": {
    "title": "Technical Program Manager",
    "URL": "https://www.metacareers.com/jobs/1653546779365383",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Please note: this role is centered on the coordination/management of a technology product or program and does not involve direct people management, management of a department, or management of departmental operations. Cross-functional coordination for a technology a product or program for the entire lifecycle including: analysis, design, development, testing, implementation, and post implementation activities for various company technology products and projects. Coordinate internal and external process improvements across multiple teams and functions and measure impact by defining meaningful metrics to meet company growth goals. Prioritize products and projects based on impact level and leverage data to drive prioritization decisions. Foster a culture of data driven decision-making throughout the entire product life cycle. Map dependencies and relationship between products, projects, and technologies throughout stages of product modification and upgrades. Identify upcoming risks, issues, and bottlenecks and resolve cross-team issues. Create better, more efficient workflows. Establish excellent working relations with all stakeholders with an emphasis on maximizing team members’ potential, providing day-to-day coordination and quality assurance for products, projects, and tasks.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Business Administration, Information Systems or related field and 5 years of experience in the job offered or in a related occupation Requires 5 years of experience in the following: Analytical and problem- solving experience with large-scale systems Software engineering, systems engineering, or technical product/program management experience Delivering tech programs or products from inception to delivery User needs, gathering requirements, and defining scope Operating autonomously across multiple teams, demonstrated critical thinking, and thought leadership Working with technical management teams to develop systems, solutions, and products Organizational, coordination and multi-tasking experience Risk management and mitigation strategies, AND Long term and quarterly planning for multiple large programs (portfolio)",
    "preferred_qualifications": "",
    "compensation": "$266,870/year to $277,545/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1981978412536338": {
    "title": "Software Engineer, Android",
    "URL": "https://www.metacareers.com/jobs/1981978412536338",
    "location": "New York, NY • Full Time",
    "responsibilities": "Research, design, develop, and test operating systems-level software, compilers, and network distribution software for user interfaces, infrastructure, and/or tools supporting applications on Android using the Android SDK. Work closely with product and design teams to build new and innovative application experiences for Android. Work on problems of moderate scope and implement custom native user interfaces using the latest Android programming techniques. Receiving general instructions on routine work and detailed instructions on new projects or assignments, build reusable Android software components for interfacing with back-end platforms. Resolve a variety of issues by analyzing and optimizing UI and infrastructure application code for quality, efficiency, and performance. Deliver tasks and projects on Android that are critical to the team’s goals (including product goals, PREQ goals, etc.). Drive projects forward on Android by leading XFN conversations, unblocking other engineers, data analysis, future iterations, etc. Write consistently high-quality, clean, and well-documented Android code that is easily readable and extensible. Make contributions to improve the Android components or systems to facilitate easier development of new features.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field Requires completion of a university-level course, research project, internship, or thesis in the following: Object-oriented software development Coding in C/C++, and Java Building maintainable and testable codes bases including API design and unit testing techniques Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions and Algorithms",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2034066770739059": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/2034066770739059",
    "location": "New York, NY • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run applications. Build new features and improve existing products. Work on problems of moderate scope. Push code, drive the development of the systems behind our products, create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgment and problem-solving skills. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with company Performance Philosophy.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in one of the following industry-standard languages: C, C++, C#, Python, Java, or Javascript Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Distributed systems including sharding, consistency, and availability and Algorithms",
    "preferred_qualifications": "",
    "compensation": "$181,274/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2171625553651170": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/2171625553651170",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "Help build the next generation of systems behind Facebook's products, create web and/or mobile applications that reach over two billion people, and build high volume servers to support content. Harness passion for technology and undergraduate-level knowledge, and help build highly scalable performant solutions. Develop undergraduate-level knowledge of algorithms and core computer science concepts and ability to apply that knowledge to real world systems with support and guidance from direct supervisor. With solutions provided by a supervisor utilize ability to apply them to production problems and contribute to architectural decisions. Employ specialty knowledge across the following areas: data processing, programming languages, databases, networking, and operating systems. Utilize knowledge of data base management system software, development environment software, object oriented development software, program testing software, operating system software, and various programming languages. Utilize knowledge of computer hardware and software, including applications and programming, and of systems architecture and components, including networking and storage. Telecommuting is permitted from anywhere in the US.",
    "minimum_qualifications": "Requires a Bachelor's degree(or foreign equivalent) in Computer Science, Engineering, Applied Sciences, Mathematics, Physics, or a related field and 6 months of experience in the job offered or in a related occupation Experience must include 6 months involving the following: Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript and Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems",
    "preferred_qualifications": "",
    "compensation": "$203,350/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2227074447704966": {
    "title": "Product Growth Analyst",
    "URL": "https://www.metacareers.com/jobs/2227074447704966",
    "location": "San Francisco, CA • Full Time",
    "responsibilities": "Apply expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how users interact with both consumer and business products. Identify the opportunities most important for growth to remove barriers for product adoption, retention, engagement, and/or monetization. Partner with growth-focused engineering teams to execute on projects based on factors identified to accelerate the growth and adoption of Facebook’s products. Understand funnels, ecosystems, user behaviors, and long-term trends in the adoption of Facebook’s products to identify opportunities for step-changes and angle changes in growth. Define and analyze metrics that inform the success of products. Communicate the state of business, experiment results, and opportunities to product teams. Influence and inform product teams through presentation of data-based recommendations. Lead the product understanding process using data to identify opportunities to remove friction and accelerate growth and market adoption of products. Lead the ideation and execution of product changes that drive growth. Drive consensus and prioritize the road-map of the growth-focused engineering team to drive a ruthless focus on the most impactful ideas. Partner with product designers to ensure that designs incorporate known best practices, remove friction, and will be effective at increasing product adoption in the market. Analyze the results of experiments, and learn from and iterate on those experiments by identifying additional opportunities to drive growth. Communicate and simplify concepts to build buy-in with the engineering team. Establish shared vision across the company for growth product optimizations by building consensus on priorities leading to major product improvements. Optimize funnels to reduce friction and drive the best possible experience for users. Lead product adoption efforts to effectively promote high retention experiences. Work collaboratively with product teams – such as product management, engineering, design, data science, and data engineering – to define product strategy and hit business targets.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Statistics, Economics, Mathematics, Mathematical Economics, Engineering or a related field and 4 years of experience in the job offered or in a related occupation: Experience must include 4 years in the following 1. Quantitative analysis 2. Data manipulation and analysis using relational databases including SQL, Teradata, Hive, or Snowflake 3. Statistics, including hypothesis testing, product experimentation, regressions, and experimentation logic and biases 4. Funnel/website optimization or outbound communication channels like email or push notifications 5. Product optimization 6. Making analytical, data-driven decisions and communicating the results of analyses 7. Social media content moderation systems and product development",
    "preferred_qualifications": "",
    "compensation": "$229,320/year to $257,400/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2300590627079497": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/2300590627079497",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run Facebook. Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebooks products create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Bachelor’s degree (or foreign equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field Requires completion of an university-level course, one research project, or one internship involving the following: 1. Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) 2. C, C++, C#, or Java 3. Python, PHP, or Haskell 4. Relational databases and SQL 5. Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) 6. Linux, UNIX, or other *nix-like OS including file manipulation and simple commands 7. Core web technologies: HTML, CSS, or JavaScript 8. Building highly-scalable performant solutions 9. Distributed systems including sharding, consistency, and availability 10. Algorithms",
    "preferred_qualifications": "",
    "compensation": "$141,697/year to $158,400/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2598684763799901": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/2598684763799901",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run Facebook. Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebook's products create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field Requires completion of a university-level course, research project or internship involving the following: Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) C, C++, C#, or Java Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Distributed systems including sharding, consistency, and availability Algorithms",
    "preferred_qualifications": "",
    "compensation": "$132,912/year to $158,400/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3766783516791396": {
    "title": "Data Scientist",
    "URL": "https://www.metacareers.com/jobs/3766783516791396",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Collect, organize, interpret, and summarize statistical data in order to contribute to the design and development of Facebook products. Apply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how our users interact with both our consumer and business products. Partner with Product and Engineering teams to solve problems and identify trends and opportunities. Inform, influence, support, and execute our product decisions and product launches. May be assigned projects in various areas including, but not limited to, product operations, exploratory analysis, product influence, and data infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action.",
    "minimum_qualifications": "Requires Bachelor's degree( Foreign degree equivalent accepted)in Statistics, Mathematics, Data Analytics, Computer Science, Engineering, Information Systems, Applied Sciences, or a related field and Completion of an undergraduate-level course, research project, or internship involving the following: Performing quantitative analysis including data mining on highly complex data sets Data querying language(s) including SQL Scripting language(s) including Python Statistical or mathematical software including one of the following: R, SAS, or Matlab Applied statistics or experimentation, such as A/B testing, in an industry setting Machine Learning techniques ETL (Extract, Transform, Load) processes and Relational databases",
    "preferred_qualifications": "",
    "compensation": "$182,583/year to $196,900/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "4270768036477668": {
    "title": "Software Engineer, Machine Learning",
    "URL": "https://www.metacareers.com/jobs/4270768036477668",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Research, design, develop, and test operating systems-level software, compilers, and network distribution software for massive social data and prediction problems. Have industry experience working on a range ranking, classification, recommendation, and optimization problems, e.g. payment fraud, click-through or conversion rate prediction, click-fraud detection, ads/feed/search ranking, text/sentiment classification, collaborative filtering/recommendation, or spam detection. Working on problems of diverse scope, develop highly scalable systems, algorithms and tools leveraging deep learning, data regression, and rules based models. Suggest, collect, analyze and synthesize requirements and bottleneck in technology, systems, and tools. Demonstrates good judgment to develop solutions that iterate orders of magnitude with a higher efficiency, efficiently leverage orders of magnitude and more data, and explore stateof-the-art deep learning techniques. Receiving little instruction from supervisor, code deliverables in tandem with the engineering team. Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU).",
    "minimum_qualifications": "Requires Bachelor's degree(Foreign degree equivalent accepted) in computer Science, Engineering, Applied Sciences, Mathematics, Physics, or related field Requires completion of an undergraduate-level course, research project, or internship involving the following: Machine Learning Framework(s): PyTorch, MXNet, or Tensorflow Machine learning, recommendation systems, ranking systems, computer vision, natural language processing, data mining, or distributed systems Hadoop/HBase/Pig or MapReduce/Sawzall/Bigtable/Spark Scripting languages such as Perl, Python, PHP, or shell scripts Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Building highly-scalable performant solutions Distributed systems including sharding, consistency, and availability Data structures and algorithms",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "24491525577214706": {
    "title": "Network Production Engineer",
    "URL": "https://www.metacareers.com/jobs/24491525577214706",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Design and implement new network architectures. Participate in technical decisions to improve the network landscape. Help create and improve both existing and future alerting and monitoring systems. Develop and optimize processes and documentation as well as perform network configuration changes and optimizations across a multivendor, multiprotocol environment. Work on performance measurement to ensure improved efficiency and will create process automation via scripting. Build out both Meta’s datacenter and network footprint. Diagnose and correlate network problems, identify root causes, and develop/implement remediation strategies. Scale Meta’s global network by building new infrastructure, analyzing and implementing new architectures, and develop and create of new operational procedures. Be responsible for deploying, implementing, and supporting a variety of network equipment. Configure and add capacity to server load balancers. Configure and add rack-switch capacity in the data center and add peers within established policy framework. Configure and add core switch and router interfaces and line cards as well as turn up data-center capacity in rack denominations. Perform fault isolation and trouble resolution on network hardware, software, and circuits. Maintain technical and training documentation, develop automation and tooling as needed. Design, deploy, and support large-scale service provider, datacenter, and enterprise network infrastructure. Configure and troubleshoot IP routing/switching technologies and protocols.",
    "minimum_qualifications": "Master's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and two years of work experience in job offered or computer-related occupation Requires two years of experience in the following: UNIX or Linux operating system fundamentals TCP/IP network fundamentals Coding in at least one of the following higher-level programming languages: PHP, Python, C++, or Java Software frameworks and APIs Configuring and maintaining applications using at least one of the following: web servers, load balancers, relational databases, storage systems, or messaging systems Network protocols including at least one of the following: NFS, DHCP, NTP, SSH, DNS, or SNMP Network Management tools like DHCP, NTP, SSH, DNS, or SNMP and Developing network protocols and management framework",
    "preferred_qualifications": "",
    "compensation": "$218,402/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "24779800361628759": {
    "title": "Software Engineer, iOS",
    "URL": "https://www.metacareers.com/jobs/24779800361628759",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various mobile software services. Work closely with product and design teams to build new and innovative application experiences for the iOS platform. Implement custom native user interfaces using the latest iOS programming techniques and development tools. Build reusable iOS software components for interfacing with our back-end platforms. Analyze and optimize UI and infrastructure application code for quality, efficiency, and performance. Work on problems of diverse scope where analysis of data requires evaluations of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions. Complete medium to large features (each with many tasks) independently without guidance. Identify and drive changes as needed for assigned codebase, product area, or systems.",
    "minimum_qualifications": "Master's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and three years of work experience in job offered or a computer-related occupation Requires three years of experience in the following: Object-oriented software development Building complex applications for the iPhone,iPad and other iOS based products using Objective-C, Swift or C++ with the iOS SDK Building maintain a bleand testable code bases, including API design and unit testing techniques Multi threading programming and mobile memory management Experience in both Objective-C and Swift Building large-scale infrastructure applications Relational databases and SQL Linux or Unix Algorithms One of the following client-server communication patterns: REST, Graph QL, gRPC Mobile architecture patterns that can scale to a large number of programmers and teams in one code base (MVVM, VIPER, modularization), AND Dependency injection and scoped access to shared resources",
    "preferred_qualifications": "",
    "compensation": "$231,936/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "25102037922766428": {
    "title": "Data Engineer",
    "URL": "https://www.metacareers.com/jobs/25102037922766428",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Architect, implement and deploy new data models and data processes in production. Perform data analysis to generate business insights. Interface with Engineers, Product Managers and Product Analysts to understand product goals and data needs. Build data expertise and own data quality for allocated areas of ownership. Manage data warehouse plans for a product or a group of products. Support critical data processes running in production.",
    "minimum_qualifications": "Requires a Bachelor’s degree (or foreign degree equivalent) in Computer Science, Mathematics, or related technical field, and 2 years of experience in the job offered or a related occupation Requires 2 years of experience in the following: 1. Programming in Python or Java 2. SQL 3. Database systems 4. ETL Pipeline tools (similar to the open source tool Airflow) 5. Visualization 6. Experimentation and related setups",
    "preferred_qualifications": "",
    "compensation": "$190,000/year to $196,900/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}