{
  "839315238495818": {
    "title": "Data Engineering Leader, Analytics (Monetization)",
    "URL": "https://www.metacareers.com/jobs/839315238495818",
    "location": "Sunnyvale, CA • Bellevue, WA • Menlo Park, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Mission and Strategy: Proactively drive the vision for BI and Data Warehousing across a product vertical and execute plans to achieve it Team Building: Build and scale a high-quality BI and Data Warehousing team Cross-Functional Collaboration: Establish relationships with Data Scientists, Product Managers, and Software Engineers to understand and meet data needs Data Warehouse Management: Lead data warehouse plans and ensure alignment with product vertical goals Data Model and Pipeline Development: Lead the design, building, and launching of new data models and pipelines in production Data Quality Assurance: Ensure data quality across the product vertical and related business areas Dashboard and Visualization Delivery: Manage the delivery of impactful dashboards and data visualizations Service Level Agreements: Define and manage SLAs for all data sets and processes in production Possess in depth data infrastructure and architecture skills, a proven track record of leading and scaling data engineering teams, operational expertise, project management leadership, and a vision for how data engineering can proactively improve companies Define processes to achieve operational efficiency, including project management and system reliability",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Project management experience Data architecture experience Experience in SQL or similar languages 9+ years of experience in BI and Data Warehousing 2+ years of experience managing managers Communication and leadership experience, with experience initiating and driving projects Experience scaling and managing 10+ person teams Development experience in at least one object-oriented language (Python, Java, etc.)",
    "preferred_qualifications": "Spark Experience in a consumer web or mobile company Advanced Degree in Computer Science, Math, Physics, or other technical fields Experience with data sets, Hadoop, and data visualization tools",
    "compensation": "$206,000/year to $281,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}