{
  "680427178434281": {
    "title": "Software Engineer, Infrastructure",
    "URL": "https://www.metacareers.com/jobs/680427178434281",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "Design core, backend software components. Code using primarily PHP, Hack, Python, and C++. Interface with other teams to incorporate their innovations and vice versa. Conduct design and code reviews. Analyze and improve efficiency, scalability, and stability of various system resources. Establish self as an owner of a particular component, feature, or system with expert end-to-end understanding. Successfully completes projects at large scope while maintaining a consistent high level of productivity. Telecommuting from anywhere in the US allowed.",
    "minimum_qualifications": "Requires a Master’s degree (or foreign degree equivalent)in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, Information Systems, or related field and three years of work experience in the job offered or in a computer-related occupation Requires three years of experience in the following: Coding in PHP, Hack, Python, and C++ Conducting design and code reviews Building large-scale infrastructure applications Owning a particular component, feature, or system Building and shipping high quality work and achieving high reliability Utilizing data and analysis to explain technical problems and provide detailed feedback and solutions",
    "preferred_qualifications": "",
    "compensation": "$199,611/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "807871371965757": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/807871371965757",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Perform full stack web or mobile application development with a variety of coding languages. Create consumer products and features using internal programming language Hack. Implement web or mobile interfaces using XHTML, CSS, and/or JavaScript. Work closely with Product Manager to define feature specifications and build products leveraging frameworks such as Reach and React Native. Work closely with operations and infrastructure to build and scale back-end services. Build report interfaces and data feeds. Conduct design and code reviews. May be assigned to specific group focused on product or infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions. Complete medium to large features (each with many tasks) independently without guidance. Identify and drive changes as needed for assigned codebase, product area, or systems. Telecommuting is permitted from anywhere in the U.S.",
    "minimum_qualifications": "Requires a Bachelors degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field and 48 months of experience in the job offered or related occupation Requires 12 months experience in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Full stack web/mobile application development in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS Leveraging frameworks, including experience in at least one of the following: React or React Native and Conducting design and code reviews and, Working in the augmented reality space, building, maintaining and interacting with related APIs and augmented reality effects",
    "preferred_qualifications": "",
    "compensation": "$203,350/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "812831231160114": {
    "title": "Software Engineer, iOS",
    "URL": "https://www.metacareers.com/jobs/812831231160114",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various mobile software services. Work closely with product and design teams to build new and innovative application experiences for the iOS platform. Implement custom native user interfaces using the latest iOS programming techniques and development tools. Build reusable iOS software components for interfacing with our back-end platforms. Analyze and optimize UI and infrastructure application code for quality, efficiency, and performance. Telecommuting is permitted from anywhere in the U.S.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field Requires completion of an university-level course, one research project, or one internship involving the following: Object-oriented software development Building complex applications for the iPhone, iPad and other iOS based products using Objective-C, Swift or C++ with the iOS SDK Building maintainable and testable code bases, including API design and unit testing techniques Multithreading programming and mobile memory management One of the following programming languages: Objective-C, Swift, C, or C++ Building large-scale infrastructure applications Relational and Non-Relational databases Linux or Unix Algorithms Build cross-platform applications with React Native",
    "preferred_qualifications": "",
    "compensation": "$229,501/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "815456620930878": {
    "title": "Software Engineer (Systems)",
    "URL": "https://www.metacareers.com/jobs/815456620930878",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run applications. Build new features and improve existing products. Work on problems of moderate scope. Push code, drive the development of the systems behind our products, create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgment and problem solving skills. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with company Performance Philosophy.",
    "minimum_qualifications": "Master's degree (or foreign equivalent) in Computer Science, Engineering, Robotics, Applied Sciences, Mathematics, Physics or related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in one of the following industry-standard languages: C, C++, Java, or C# Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Build highly-scalable performant solutions Data processing, programming languages, databases, networking, operating systems, computer graphics, or human-computer interaction Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems Distributed systems",
    "preferred_qualifications": "",
    "compensation": "$203,350/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1467908294432841": {
    "title": "Machine Learning Engineer",
    "URL": "https://www.metacareers.com/jobs/1467908294432841",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU). Develop highly scalable classifiers, ranking models, regression systems, or tools to support recommendation and personalization use cases through leveraging machine learning, data regression, and rules based models. Suggest, collect and synthesize requirements and create effective feature roadmaps. Collaborate closely with the engineering team to deliver high-quality, production-ready code. Promote ML best practices by monitoring and analyzing model performance via experiments and offline evaluations, and contribute ideas for continuous improvements.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field Experience must include completion of one coursework, research project, or internship involving the following: Developing and debugging in C, C++, and Java Scripting languages such as Python,Perl, or shell scripts SQL for data analysis and model evaluation Relational databases, data manipulation, and analysis using tools such as NumPy, and Pandas Developing and training models using PyTorch or equivalent modern deep learning frameworks Applying deep learning models in focus areas such as recommendation systems,NLP, computer vision, or multi modal learning Demonstrated ability to build and test models, conduct experiments, and interpret results in a collaborative, cross-functional environment involving engineering, research, and data teams Strong computer science fundamentals, with knowledge of distributed systems,computer architecture, network programming, operating systems, and low-level performance optimization Strong mathematical foundation in probability theory, linear algebra, multivariable calculus, stochastic processes, and optimization methods used in machine learning",
    "preferred_qualifications": "",
    "compensation": "$178,360/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1543572269989477": {
    "title": "Network Production Engineer",
    "URL": "https://www.metacareers.com/jobs/1543572269989477",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Design, develop, and operate large-scale network systems to support AI training jobs/workloads. Research and deploy new technologies and network topologies to evolve and scale AI networks, collaborating closely with hardware, software, and datacenter teams. Qualify and test new network products. Implement optimized network monitoring strategies and systems. Participate in AI network on-call rotations to learn from real world production challenges and take the lessons to improve current and future generation products. Analyze data to diagnose and identify root causes to network issues. Write and review code, develop documentation, and debug the hardest problems on some of the largest and most complex systems in the world. Build, manage and maintain multi-vendor, multi-protocol data center and backbone networks. Mentor and onboard members of the team. Deliver tech-talks across teams for knowledge sharing and for driving strong XFN collaboration.",
    "minimum_qualifications": "Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Network Engineering, Telecommunications or a related field and 2 years of experience in the job offered or in a similar occupation Requires 2 years of experience in the following: AI technologies and associated network technologies (IB/RDMA/RoCE Networks) Network protocol fundamentals for L2/L3/L4 (MAC, TCP/IP, BGP, etc.) Network hardware design and of forwarding and data planes AI training workloads and demands they exert on networks Designing, deploying and operating datacenter networks at scale UNIX or Linux operating system fundamentals Coding in one of the following higher-level programming languages: Python, C++, Go or Rust Network automation software, leveraging software defined networking principles",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1546003949906913": {
    "title": "Data Engineer",
    "URL": "https://www.metacareers.com/jobs/1546003949906913",
    "location": "New York, NY • Full Time",
    "responsibilities": "Conceptualize and own the data architecture for multiple large-scale projects, while evaluating design and operational cost-benefit tradeoffs within systems. Create and contribute to frameworks that improve the efficacy of logging data, while working with data infrastructure to triage issues and resolve. Collaborate with engineers, product managers, and data scientists to understand data needs, representing key data insights visually in a meaningful way. Define and manage Service Level Agreements for all data sets in allocated areas of ownership. Determine and implement the security model based on privacy requirements, confirm safeguards are followed, address data quality issues, and evolve governance processes within allocated areas of ownership. Design, build, and launch collections of sophisticated data models and visualizations that support multiple use cases across different products or domains. Solve our most challenging data integration problems, utilizing optimal Extract, Transform, Load (ETL) patterns, frameworks, query techniques, sourcing from structured and unstructured data sources. Assist in owning existing processes running in production, optimizing complex code through advanced algorithmic concepts. Optimize pipelines, dashboards, frameworks, and systems to facilitate easier development of data artifacts. Influence product and cross-functional teams to identify data opportunities to drive impact. Mentor team members by giving/receiving actionable feedback.",
    "minimum_qualifications": "Bachelor's degree (or foreign equivalent) in Computer Science, Engineering, Mathematics or related field Requires completion of one undergraduate-level course, one research project, or one internship involving the following Features, design, and use-case scenarios across a big data ecosystem Custom ETL design, implementation, and maintenance Object-oriented programming languages Schema design and dimensional data modeling Writing SQL statements Analyzing data to identify deliverables, gaps, and inconsistencies Managing and communicating data warehouse plans to internal clients MapReduce or MPP system Python Working closely with ML engineers, and experimentation at scale ML architectures (deep learning) and ways to improve model performance (feature engineering, hyperparameter optimization, large models)",
    "preferred_qualifications": "",
    "compensation": "$214,002/year to $235,400/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1572653756951098": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/1572653756951098",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run our applications. Build new features and improve existing products. Work on problems of moderate scope. Push code, drive the development of the systems behind our products, create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receiving general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgment and problem solving skills. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with company Performance Philosophy.",
    "minimum_qualifications": "Requires a Master's degree (or foreign equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field and 24 months of experience in the Job offered or in a computer-related occupation Requires 24 months of experience in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Data processing, programming languages, databases, networking, operating systems, computer graphics, or human-computer interaction Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems Distributed systems",
    "preferred_qualifications": "",
    "compensation": "$223,459/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3007741006080058": {
    "title": "Data Engineer, Product Analytics",
    "URL": "https://www.metacareers.com/jobs/3007741006080058",
    "location": "Burlingame, CA • Full Time",
    "responsibilities": "Manage and execute data warehouse plans for a product or a group of products to solve well-scoped problems. Identify the data needed for a business problem and implement logging required to ensure availability of data, while working with data infrastructure to triage issues and resolve. Collaborate with engineers, product managers and data scientists to understand data needs, representing key data insights in a meaningful way. Build data expertise and leverage data controls to ensure privacy, security, compliance, data quality, and operations for allocated areas of ownership. Design, build and launch new data models and visualizations in production, leveraging common development toolkits. Independently design, build and launch new data extraction, transformation and loading processes in production, mentoring others around efficient queries. Support existing processes running in production and implement optimized solutions with limited guidance. Define and manage SLA for data sets in allocated areas of ownership.",
    "minimum_qualifications": "Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Computer Engineering, or a related field Requires education and/or experience in each of the following: 1. SQL 2. ETL 3. Data modeling 4. Schema design and dimensional data modeling 5. Programming languages: Python, C++, C#, and/or Scala 6. Dashboarding & Visualization 7. Telemetry and Logging design",
    "preferred_qualifications": "",
    "compensation": "$175,420/year to $196,900/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}