{
  "2085498252200262": {
    "title": "Research Scientist Intern, Generative AI Digital Characters (PhD)",
    "URL": "https://www.metacareers.com/jobs/2085498252200262",
    "location": "Sausalito, CA • Internship",
    "responsibilities": "Design and implementation of prototypes with the emphasis on quality and speed of execution Proposal and execution of experiments Collaboration with and support of other researchers across various disciplines Communication of research agenda, progress, and results Planning and drafting of possible publication",
    "minimum_qualifications": "Currently has, or is in the process of obtaining, a PhD in Computer Vision, Computer Graphics, Machine Learning or related fields Experience with Generative AI Experience with geometry reconstruction (e.g. 3D gaussian splatting) 2+ years of experience with Python or PyTorch Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment Interpersonal skills: cross-group and cross-culture collaboration",
    "preferred_qualifications": "Intent to return to degree-program after the completion of the internship Experience with unified generative text-to-image and text-to-video models Experience in at least one of the following areas: facial rigging and animation, 3D gaussian splatting, autoregressive meshing, inverse rendering Proven track record of achieving results as demonstrated in accepted papers at top computer vision, computer graphics or machine learning related conferences such as CVPR, SIGGRAPH, ECCV, ICCV, NeurIPS, or relevant conference",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}