{
  "1161692358829189": {
    "title": "Design Verification Engineer",
    "URL": "https://www.metacareers.com/jobs/1161692358829189",
    "location": "Sunnyvale, CA • Redmond, WA • Austin, TX • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Define and implement verification plans, and build test benches for block, IP, sub-system, and SoC level verification Develop functional tests based on verification test plan Drive Design Verification to closure based on defined verification metrics on test plan, functional and code coverage Collaborate with cross-functional teams like Design, Model, Emulation and Silicon validation teams towards ensuring the highest design quality Debug, root-cause and resolve functional failures in the design, partnering with the Design team",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta 2+ years of hands-on experience in SystemVerilog/UVM methodology or C/C++ based verification 2+ years experience in block/IP/sub-system and/or SoC level verification based on SystemVerilog UVM/OVM based methodologies Experience in EDA tools and scripting (Python, TCL, Perl, Shell) used to build tools and flows for verification environments",
    "preferred_qualifications": "Experience with revision control systems like Mercurial(Hg), Git or SVN Experience in architecting and implementing Design Verification infrastructure and executing the full verification cycle Experience in development of Universal Verification Methodology (UVM) based verification environments from scratch Experience verifying ARM/RISC-V based sub-systems and SoCs Experience verifying CPU/GPU designs Experience in one or more of the following areas: SystemVerilog Assertions (SVA), Formal, and Emulation Track record of 'first-pass success' in Application-Specific Integrated Circuit (ASIC) development cycle",
    "compensation": "$114,000/year to $166,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1994121491434542": {
    "title": "Research Engineer, Language - Content and User Understanding Team",
    "URL": "https://www.metacareers.com/jobs/1994121491434542",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Build Multi-Modal LLM backbones Prepare human-labeled or auto-generated data for pre-training and fine-tuning Fine-tune/RLHF for downstream content understanding and user understanding tasks Model evaluation with human labeling or auto judge",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Research experience in machine learning, deep learning, and/or natural language processing Experience with developing machine learning models at scale from inception to business impact Programming experience in Python and hands-on experience with frameworks such as PyTorch Understanding of architectural patterns of large scale software applications",
    "preferred_qualifications": "",
    "compensation": "$70.67/hour to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2939243283130351": {
    "title": "Software Engineer - Storage (Technical Leadership)",
    "URL": "https://www.metacareers.com/jobs/2939243283130351",
    "location": "Bellevue, WA • Fremont, CA • Full Time",
    "responsibilities": "Effectively communicate complex features and systems in detail Drive the team's goals and technical direction to pursue opportunities that make your larger organization more efficient Understand industry & company-wide trends to help assess & develop new technologies Partner & collaborate with organization leaders to help improve the level of performance of the team & organization Identify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas Lead long term technical strategy and roadmap for large cross-company efforts Suggest, collect and synthesize requirements and create an effective feature roadmap",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Experience leading projects with industry-wide impact Vast experience communicating and working across functions to drive solutions Significant experience in mentoring/influencing engineers across organizations Proven track record of planning multi-year roadmap in which shorter-term projects ladder to the long term mission Experience in driving large cross-functional/industry-wide engineering efforts 8+ years coding experience in C, C++, Java and/or C# 8+ years experience building server applications",
    "preferred_qualifications": "Experience with operating system internals, filesystems, programming language design, compilers",
    "compensation": "$213,000/year to $293,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3036799263192501": {
    "title": "Threat Management Investigator",
    "URL": "https://www.metacareers.com/jobs/3036799263192501",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "You will provide investigative expertise to support a variety of cross-functional internal Meta clients – headquarters and regional offices – within the Meta Company for threat assessment and investigations purposes with the goal of supporting the safety and security of our people, assets, and reputation The global presence of Meta and the nature of Global Security operations require the Threat Management Team to be available 24/7 to manage relationships, collect and analyse relevant information, and communicate to executives and stakeholders as needed regarding risks as they develop You will work as part of a global team, be responsible for overseeing the development, execution and quality control of Threat Management projects, and manage strategic investigations operations as directed You will work cross-functionally and partner closely with other Global Security and Meta internal teams",
    "minimum_qualifications": "8+ years of work experience in investigative disciplines Practical experience in problem-solving skills Experience working with highly confidential information Experience completing multiple tasks simultaneously and functioning with minimal supervision Experience working in both individual and team environments Proven experience in communication, with the experience to engage effectively with clients, team members, and stakeholders Proven experience in problem-solving and decision-making skills, with the ability to think critically and perform proficiently under high-pressure situations",
    "preferred_qualifications": "Proven experience working with high-profile individuals or in high-risk environments Experience conducting threat assessments and developing comprehensive risk management plans Experience working within Privacy regulations, locally and internationally Previous law enforcement/government agency and/or background in working within a corporate environment",
    "compensation": "$111,000/year to $163,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}