{
  "729435826172450": {
    "title": "Operations Program Manager",
    "URL": "https://www.metacareers.com/jobs/729435826172450",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Drive key changes to programs to achieve future state objectives which could include processes, documentation, measurement, etc Interface with product teams across Meta to ensure QPs meet our standards and incorporate all best practices Ideate and implement process improvements to drive employee year savings Clearly communicate with teams and handle pushback with grace while enforcing QP governance Provide regular feedback collected from internal customers to our QP product team to continuously improve the product and meet our customer's needs",
    "minimum_qualifications": "Experience with internal marketing platforms Experience using Microsoft Excel and PowerPoint BA/BS in Computer Science, Math, Physics, Engineering, Statistics or other technical field or 3+ years equivalent technical work experience Experience flourishing in a deadline-focused and ambiguous environment 3+ years of project or program management experience Knowledge with numbers and proficient in doing basic analysis Experience working with and enforcing brand guidelines Capacity to stay well organized and focused on the finer details in a time-sensitive role Demonstrated experience making effective decisions and communicating clearly to cross functional teams",
    "preferred_qualifications": "",
    "compensation": "$94,000/year to $136,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "807895135485725": {
    "title": "Manager, Partner Engineering, Incubation",
    "URL": "https://www.metacareers.com/jobs/807895135485725",
    "location": "San Francisco, CA • Full Time",
    "responsibilities": "Scale the team by attracting and mentoring people at various levels of experience to grow a high-performing team around business and team needs Build new products and improve existing ones in collaboration with Meta product engineering teams and cross-functional partners to meet business needs Communicate across functions, influence the roadmap and product development Partner with appropriate stakeholders to make ongoing program and project decisions, leverage insights from the team, and make recommendations and/or decisions when issues arise Design and build extensible systems and improve current frameworks that support future projects, including: designing sophisticated launch-plan strategies and shipping production level code focused on long-term maintainability Serve as a technology/business subject matter expert within the team and provide consultation on domain-level projects Bring unique insights from industry, verticals and audience segments to fill a void that exists in our platform Help partners to be successful on the platform through consulting or building both 0 to 1 and scaled solutions Manage team performance, including coaching for career growth, and create a healthy team environment Effectively communicate team goals, seek out information needed for the team to be impactful and provide resources required to achieve goals while removing roadblocks along the way Set clear expectations for all team members, hold them accountable to agreed upon goals, and provide guidance on how it maps to their work Conduct Code reviews and provide thoughtful, meaningful, and constructive feedback Willingness to travel 20% of the time",
    "minimum_qualifications": "12+ years of software engineering experience, including 5+ years of experience managing a team of engineers B.S. or M.S. in Computer Science or equivalent degree Experience with designing, building, and iterating on scalable AI & agentic software platforms applications and taking products from a nascent state to a level of maturity Experience building consensus within large cross-functional organizations Experience proactively identifying and executing organizational, product improvements across several teams Experience in translating technical concepts into language for audiences, including software engineers, business and technical leaders Experience designing and integrating with APIs Experience developing and effectively managing relationships with external and internal partners",
    "preferred_qualifications": "Expertise building and leading Agentic AI systems, ad tech, and social media landscape globally Experience working in a startup or similar early stage company Experience managing a distributed team with multiple roles Hands on experience with agile software development methodologies",
    "compensation": "$210,000/year to $285,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "853399627211096": {
    "title": "System Coexistence Validation Engineer",
    "URL": "https://www.metacareers.com/jobs/853399627211096",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Execute validation strategies for products integrating hardware, software, and content throughout all stages of consumer product development, from initial design through post-launch support Perform product and system testing, collaborating with cross-functional teams to establish priorities and ensure effective implementation of test plans Deliver results from various device testing domains, including functional, performance, new feature, and regression testing Facilitate collaboration across engineering, program management, and other technical teams to design, develop, and implement rigorous system tests for prototype and production hardware Formulate and execute comprehensive validation plans, organizing validation efforts efficiently and reporting status using internal tools and progress trackers Analyze large datasets and distill findings into clear, actionable summaries for stakeholders at all levels Help define, monitor, and communicate key performance indicators for system performance and product validation",
    "minimum_qualifications": "Bachelor’s degree in Computer Science, Software Engineering, Electrical Engineering or or equivalent industry experience 2+ years of systems validation or systems engineering experience in consumer electronics or related industries Experience with system verification and validation testing methodologies and concepts for hardware products Proficiency in debugging and analysis using metrology, system logs, customer feedback, or software traces Proven technical communication skills",
    "preferred_qualifications": "Master of Science in Electrical Engineering, Computer Science or related field 4+ years of work experience in systems validation or systems engineering for consumer electronics products Experience with scripting and automation in C/C++, Python, or other scripting languages. Automate test execution and test data processing Experience with setting up, handling stability test racks and test campaigns Experience with coexistence and stress rack testing. Push performance boundaries and discover corner failures Experience interacting with test equipment vendors and knowledge of state-of-the-art test equipment Experience managing lab equipment selection and budgeting to support next-generation interface protocols",
    "compensation": "$111,000/year to $164,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1148191640825141": {
    "title": "Research Scientist Manager - ML Modeling & Applied Research",
    "URL": "https://www.metacareers.com/jobs/1148191640825141",
    "location": "Burlingame, CA • New York, NY • Full Time",
    "responsibilities": "Build cutting-edge machine learning and signal processing models (event detection, sequence-to-sequence, signal separation, time series regression, etc.) to advance neuromotor interface capabilities Collaborate with engineering and Human-Computer Interactions (HCI) teams to deploy models that leverage fundamental scientific knowledge into new technology and user experiences Use quantitative research methods to define, iterate upon and advance key areas of our research agenda Develop research-grade code for deployment in research prototypes. Work across organizational boundaries to solve our biggest problems",
    "minimum_qualifications": "8+ years of experience working autonomously to design, execute, interpret, and present ML research outcomes 4+ years of experience as technical lead for a project of 4 or more individuals 2+ years of direct management experience, managing Researchers or Engineers Experience in the analysis and modeling of high dimensional time series, such as neural signals, multi-channel audio recordings, multi-modal/multi-sensor signals, robotic sensory signals, financial time series, video, or other sensor modalities Experience bringing machine learning-based products from research to production Experience with interdisciplinary and/or cross-functional collaboration Experience with large scale cluster computing for machine learning modeling Experience developing end-to-end ML pipelines, including: dataset preprocessing, model development and evaluation, and software integration Experience in software engineering in industry Must obtain work authorization in country of employment at the time of hire and maintain ongoing work authorization during employment PhD in one of the following fields: deep learning, artificial intelligence, machine learning, computer science, robotics, computer vision, computational neuroscience, signal processing, speech and language technologies, or related fields",
    "preferred_qualifications": "Experience with real-time signal processing and/or human-computer interaction Proficiency with quantitative methods (mathematics, statistics) and experience learning new technical knowledge and skills rapidly Research-oriented software engineering skills, including fluency with libraries for scientific computing (e.g. SciPy ecosystem) and machine learning (e.g., PyTorch, TensorFlow, Scikit-learn, Pandas) Experience with scientific communication tools (Jupyter, Matplotlib)",
    "compensation": "$177,000/year to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1165711501711092": {
    "title": "Privacy Strategic Program Manager",
    "URL": "https://www.metacareers.com/jobs/1165711501711092",
    "location": "Menlo Park, CA • Seattle, WA • New York, NY • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Develop and iterate on programs that support the biggest company product and compliance priorities. In some cases, this requires standing up a new program where none exists Collaborate with stakeholders at all levels to organize and operationalize a complex set of priorities while tracking and reporting goals and outcomes Hold program stakeholders accountable for delivery of goals and outcomes Report out on the current and future state of the program for which you are responsible",
    "minimum_qualifications": "2+ years of experience working with data privacy regulations or compliance 4+ years of experience working in program management at a large tech company",
    "preferred_qualifications": "6+ years of experience working with data privacy regulations or compliance 6+ years of experience running large scale cross-organizational programs",
    "compensation": "$101,000/year to $152,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1193856719278401": {
    "title": "Software Engineering Manager - Horizon Engine",
    "URL": "https://www.metacareers.com/jobs/1193856719278401",
    "location": "Bellevue, WA • Burlingame, CA • Full Time",
    "responsibilities": "Lead and manage a team of software engineers to deliver high-quality products and solutions Collaborate with cross-functional teams to drive technical innovation Develop and implement technical strategies to achieve business objectives Foster an environment of continuous learning, growth, and improvement",
    "minimum_qualifications": "8+ years of, or PhD + 4 years of software engineering work experience, including hands on technical management Demonstrated experience recruiting, building, structuring, and leading technical organizations, including performance management Bachelor of Science/Masters in Computer Science or equivalent practical experience Experience supporting, coaching, mentoring, and developing software engineers 2+ years of experience in managing a team of engineers with varied skill levels",
    "preferred_qualifications": "Demonstrated experience leading one or more real-time engine components (e.g. Simulation, Performance, Networking, Audio, Assets) for a AAA engine (Unreal, Frostbite, Unity 3D, or other/proprietary AAA) Experience building for multiple hardware platforms (e.g. PC, Console, MR/VR, Cloud, mobile) Experience with performance optimization of real-time applications Experience developing SDKs or shared technology that balances the needs of multiple shipping products",
    "compensation": "$177,000/year to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1213006054221601": {
    "title": "Research Scientist Intern, Computational Photography (PhD)",
    "URL": "https://www.metacareers.com/jobs/1213006054221601",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Support research activities focused on computational photography, end-to-end camera system optimization, and low-level vision tasks Participate in the development of proof of concept and prototype visual sensing systems Interact with cross-functional engineering teams to demonstrate novel imaging systems and camera hardware",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a PhD in the fields of Computer Science, Electrical Engineering, Machine Learning, Computer Architecture, or related field 2+ years of coding experience with programming languages such as Python/C++ Advanced experience with computer vision (CV) and modern deep learning research, including algorithm development and optimization Experience in metasurfaces design Demonstrated understanding and hands-on experience with computational imaging including but not limited to: image denoising, HDR imaging, super-resolution, deblurring, frame interpolation, etc Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Experience with lightweight machine learning on embedded systems, including model optimization and deployment Experience with the full machine vision pipeline spanning cameras, ISPs, and high-level algorithms Proven track record of achieving significant results in CV and ML research, as well as nanophotonics, as demonstrated by publications, grants, or fellowships Intent to return to degree-program after the completion of the internship/co-op",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1402069198101727": {
    "title": "Technical Program Manager, Communications Measurement Team",
    "URL": "https://www.metacareers.com/jobs/1402069198101727",
    "location": "Los Angeles, CA • Foster City, CA • Menlo Park, CA • Burlingame, CA • Washington, DC • New York, NY • San Francisco, CA • Fremont, CA • Mountain View, CA • Full Time + 8 more • Full Time - Hide",
    "responsibilities": "Drive campaign measurement projects end-to-end in partnership with Communications Create data pipelines and other analytical solutions that help us track and record metrics that are relevant to campaign measurement and audience engagement Query large data sets using SQL and create data pipelines in other programming languages such as Python or R Conduct statistical analyses to identify trends and patterns in campaign performance Develop and maintain dashboards to communicate findings to stakeholders effectively and in a scalable manner Develop analytical best practices and standardize reporting templates for use within the team",
    "minimum_qualifications": "Bachelor's Degree in a technical or research-oriented field such as engineering, data science, social science, or related fields (with focus on research - e.g. data journalism) 5+ years of work experience in quantitative research, statistics, or data analysis Experience in marketing analytics or social media measurement Experience in leveraging AI-driven tools in data pipelines, analysis, or classification Effective communication skills, with knowledge to present findings to non-technical stakeholders Experience in working with large datasets and using SQL or similar tools for data extraction and manipulation Experience with statistical analysis, relational databases, and/or object-oriented programing languages Experience with data visualization tools such as Tableau, Power BI or similar platforms Experience in managing multiple projects and meeting deadlines in a fast-paced environment",
    "preferred_qualifications": "Advanced technical degree or graduate degree in business, marketing, or related fields Experience with data visualization tools such as Tableau, Power BI or similar platforms On-the-job experience in communications, public relations, marketing, or working with public-facing teams",
    "compensation": "$150,000/year to $213,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1430516021433534": {
    "title": "Software Engineer, Audio",
    "URL": "https://www.metacareers.com/jobs/1430516021433534",
    "location": "Bellevue, WA • Redmond, WA • Menlo Park, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Collaborate in a team environment across multiple scientific and engineering disciplines, making the architectural tradeoffs required to rapidly deliver software solutions Create clean readable code, debug complex problems, prioritize ruthlessly and get things done with a high level of efficiency Learn constantly, dive into new areas with unfamiliar technologies, and embrace the ambiguity of problem solving Develop audio software for a variety of consumer products and devices",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 5+ years software development experience in industry settings or PhD with 2+ years of experience 3+ years relevant audio software engineering experience in industry settings C or C++ experience, including use of C++11/14/17 features Communication experience and demonstrated experience working across disciplines to drive optimal solutions",
    "preferred_qualifications": "Proven track record of innovation as demonstrated by products shipped, publications and/or patents Proven experience in technical communication with peers, partners, and non-technical cohorts MS or PhD in Electrical Engineering, Computer Science or equivalent Solid understanding in fundamentals of Digital Signal Processing (DSP) and Machine Learning (ML) Experience developing GenAI systems Experience with scientific programming languages such as MATLAB, Python or similar Experience in any of the following areas: Small footprint ML, Differential DSP, Echo/Noise reduction, Spatial Processing, Hearing Aids Expertise in audio signal processing both classical and machine learning techniques",
    "compensation": "$70.67/hour to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1604051480563991": {
    "title": "Site Logistics Operations Lead",
    "URL": "https://www.metacareers.com/jobs/1604051480563991",
    "location": "DeKalb, IL • Altoona, IA • Full Time",
    "responsibilities": "Lead Site Logistics Operations through project assignment, resource alignment, and prioritization, while coordinating with IBOS manager Oversee logistics operations at assigned data center site to ensure operations are performed within the IBOS 4S standards (Safety, Security, SOX compliance, Stakeholders) Serve as the main point of contact for the IBOS team at their respective data center, partnering with cross-functional teams and driving the Circle of Leadership discussion from IBOS. Partner with stakeholders external to your assigned data center and serve as the IBOS POC for projects, pilots, and initiatives. Gather and share feedback from improvement efforts across IBOS and present to leadership as needed Facilitate an environment allowing Logistics Operations Specialists to conduct all day-to-day aspects of material movement including: shipping and receiving, inventory management, and cycle counting of all consigned and Meta-owned inventory throughout the region Oversee and monitor third party logistics team performance at respective data center partner with third party team to implement process improvements and best practices to drive safe, efficient, and compliant operations Ensure production and monthly audits are in compliance with all SLA requirements, ensuring all inventory controls across the data center Oversee month- and quarter-end DC Asset Audit requirements ensuring appropriate financial reporting across the region Monitor inventory reconciliation processes to identify risk, manage obsolescence, and reserve appropriately Manage suppliers, materials, and inventory in a manner consistent with the requirements of Meta Manage and develop ongoing metrics and KPIs to measure site logistics performance and escalate concerns appropriately Work closely with all stakeholder teams across the site to understand business requirements, implement new processes, and contribute to ongoing process improvements Resolve site issues and coordinate appropriate escalation Actively monitor operations dashboards and index reports to drive improvement Lead site IBOS analysts such that they can run daily operations and site projects with minimal direction Implement creative ideas keeping IBOS operating costs to a minimum Gather and analyze feedback from their data center regarding needed changes/improvements/revamps of proposed and existing tools, processes, workflows Partner with Environmental Health and Safety to guarantee compliance with all Federal, State, and Local safety requirements Partner with other Site Logistics Operations Leads within IBOS to share best practices and influence operations across the fleet to drive continuous improvement and efficiency efforts. Communicate up, down, and across IBOS and cross-functional teams to ensure operational alignment Utilize reporting and other forms of data to gauge performance of the logistics team Identify waste in order to streamline processes and reduce excess materials Strive to refine and develop all logistics processes aligning with best practices and other analytical positions 10% travel required",
    "minimum_qualifications": "Bachelor’s degree in supply chain, operations management, business management and/or any other related field, or equivalent work experience 7+ years experience in data center logistics, production IT or similar environment 7+ years experience in business analysis/program management Experience in as-is/to-be business process mapping, gap analysis, requirements elicitation and data analysis Experienced in cross-functional collaboration across multiple teams Experience working independently and managing time Experience handling project management responsibilities (prioritization, planning, scheduling, status reporting) Communication, problem-solving, and interpersonal experience Knowledge in Supply Chain process from Procure-to-Pay",
    "preferred_qualifications": "Understanding of a start-up environment Adaptive learner, positive attitude, and focused on customer service",
    "compensation": "$113,000/year to $163,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1641361157240567": {
    "title": "Research Scientist Intern, Image sensor design and characterization (PhD)",
    "URL": "https://www.metacareers.com/jobs/1641361157240567",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Investigate and propose novel pixel architectures and sensor architectures Perform pixel schematic/layout design and simulation in advanced process nodes Architect and design readout and processing circuits to achieve ultra-low power consumption Characterize image sensors and experiment with new image sensor operation schemes Collaboration with and support of other researchers across various disciplines Communication of research agenda, progress and results",
    "minimum_qualifications": "Currently has or is in the process of obtaining a Ph.D. degree in the fields of Electrical Engineering, Computer Science, or related field Research experience in one or more of the following aspects of Image Sensors: Device physics and fabrication, Analog/mixed signal circuit design, Imaging systems (camera, ISP, algorithm) Experience with analog/mixed-signal circuit design CAD tools such as Cadence Virtuoso Successful tape-out and hands-on bench testing experience Simulation and modeling experience with scripting languages such as Python, Matlab Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "3+ years of experience in circuit design Tape out experience with advanced technology nodes Image signal processing experience (noise reduction, HDR processing) Proven track record of achieving significant results as demonstrated by grants, or fellowships, as well as first-authored publications in major conferences and journals such as IISW, IEDM, VLSI, ISSCC, JSSC, TED",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2123526018183277": {
    "title": "Design Program Manager, Edits",
    "URL": "https://www.metacareers.com/jobs/2123526018183277",
    "location": "New York, NY • San Francisco, CA • Full Time",
    "responsibilities": "Drive product initiatives forward that have multiple stakeholders, competing deadlines, and many moving parts Prioritize, assess tradeoffs, propose clear solutions and communicate effectively Define and manage initiatives that improve product team efficiency and impact Facilitate meetings to drive progress against goals and objectives and establish clear next steps and owners, while resolving blocks that impede progress Proactively assess risk, raise flags and resolve issues before they become problems for larger teams Support the management team with effective team communication, proactive problem solving and information distribution Define and measure impact of programs and initiatives both qualitatively and quantitatively Collaborate cross-functionally with product management, engineering, product design, user experience research and content design strategy to ensure a smooth product development process",
    "minimum_qualifications": "Minimum of 2+ years of experience working with product teams or programs (or other equivalent fields) from roadmapping through delivery Track record of operating under your own initiative and with minimal oversight Experience creating programs that drive impactful change Experience using data to identify problems and communicate solutions with measurable results",
    "preferred_qualifications": "Familiarity with Edits and/or tools, content, and workflows that are designed for or shaped by creators",
    "compensation": "$101,000/year to $152,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2228915710964414": {
    "title": "Research Scientist Intern, Robotics Dexterous Manipulation (PhD)",
    "URL": "https://www.metacareers.com/jobs/2228915710964414",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Explore forward-looking ways and novel robotic architectures to advance dynamic in-hand manipulation, generalizable dexterous and functional manipulation (rigid to deformable objects in-hand to against the environment) Research novel sensors, robotic systems architectures, planning and control algorithms that involve tactile and multimodal vision and perception, dexterous manipulation and collision avoidance Develop machine learning models and end-to-end applications for robotics, dexterous manipulation, and contextual understanding Invent novel paradigms for robotics sensing and intelligence, leveraging a variety of sensing and machine perception modalities (images, video, audio, tactile, etc.) Develop efficient models deployable to robotic systems, integrate research into full system-level robotic prototypes",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a PhD degree in Computer Science, Electrical Engineering, Machine Learning, Robotics or related field Research experience in at least one of the following research areas: robot learning, dexterous manipulation, control theory, optimization algorithms, representation learning, self-supervised learning, multimodal learning, vision-language-action (VLA) models, reinforcement learning, imitation learning, robotics policy development, computer vision, egocentric perception, embodied AI and/or LLMs Experience in C/C++ and Python and deep learning frameworks (e.g., PyTorch, TensorFlow) Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as Robotics (RSS, ICRA, IROS, CoRL, T-RO, IJRR), Machine Learning (NeurIPS, ICML, ICLR, AAAI, JMLR), and Computer Vision (CVPR, ICCV, ECCV, TPAMI) Experience with research and development of humanoid robots and dexterous robot hands Experience with embedded systems and communication protocols Experience with robotics frameworks such as Robot Operation System (ROS), along with experience working with robotic simulations and real-world robots Experience bringing-up and debugging prototype/scientific software-hardware systems (e.g., robotics platforms, multi-camera sensing/tracking solutions, wearable sensing systems) Experience working and communicating cross-functionally in a team environment Intent to return to degree program after the completion of the internship/co-op",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2471900343171573": {
    "title": "Product Designer, Meta",
    "URL": "https://www.metacareers.com/jobs/2471900343171573",
    "location": "Menlo Park, CA • Seattle, WA • New York, NY • San Francisco, CA • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Work to complete projects at the level of whole features within a well scoped domain Design flows and experiences that are incredibly simple and elegant for our supported platforms Design new experiences or layouts that evolve or define visual systems Give and solicit feedback from other designers in order to continually raise our bar for quality Partner with product managers, engineers, UX researchers and content strategists to iterate and oversee the user experience of a product from conception until launch",
    "minimum_qualifications": "Bachelor's degree in Design, Human-Computer Interaction, Computer Science, or a related field 2+ years designing software products with a focus on user experience, interaction, and visual design that meet business objectives Experience utilizing research and data to inform product strategy Demonstrates strategic product thinking and effective communication skills Familiarity with prototyping tools and building low-fidelity mock ups",
    "preferred_qualifications": "Experience showcasing your end-to-end design process across multiple projects, that include interaction and visual design artifacts and high-fidelity prototypes Experience connecting your work with other related initiatives across the company",
    "compensation": "$110,000/year to $159,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "25709120678693120": {
    "title": "Strategic Sourcing Manager - Marketing",
    "URL": "https://www.metacareers.com/jobs/25709120678693120",
    "location": "Austin, TX • Menlo Park, CA • New York, NY • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Develop multi-year category plans aligned with Business and Global Strategic Sourcing priorities Use industry trends, relevant data analysis, internal spend data and requirements to create strategies that will proactively identify optimization opportunities to help our Business meet their goals Lead the development and execution of sourcing plans and supplier spend management strategies, including handling of complex sourcing projects and contract negotiations that optimize value to the company Leverage advanced analytics and procurement technology to drive data-informed sourcing strategies and identify optimization opportunities Develop effective collaborative relationships with key business partners to understand their needs and become a trusted partner to strategically manage their spend and supplier relationships Establish supplier positioning and manage strategic relationships with key suppliers, including influencing their processes, resource decisions, performance management and policies to create mutually beneficial and sustainable partnerships Develop collaborative partnerships across Finance, Operations, HR, Privacy and Legal teams and act as the collaborator to bring teams together and influence a Meta-wide solution Maintain accurate and complete records, work with various business groups to simplify processes. Contribute to implementation, planning, and change management of process improvement initiatives across Global Strategic Sourcing Ensure adherence to procurement policies and manage the remediation and resolution of sourcing issues. Provide regular communication and training on procurement processes and systems to stakeholders and suppliers Act as procurement subject matter expert in consulting with the business to identify, develop and deploy best practice procurement, category management and supplier management",
    "minimum_qualifications": "Bachelor’s degree in business, marketing, supply chain, procurement, finance, management or related field 7+ Years of experience in Sourcing & Procurement for Marketing, Creative Marketing or Agency Operations for a brand/client side or related discipline Demonstrated success in sourcing, negotiating, and delivering complex contracts, with expert negotiation skills in both financial and business matters Experience using data analysis, industry trends, relevant data, and internal spend data to create strategies and identify optimization opportunities Proven track record of implementing category, strategic sourcing and process improvement initiatives History of building and leveraging relationships with business leaders and supplier executives to achieve business goals Previous experience driving change, managing conflict, unifying different perspectives, decision-making, securing support, and building consensus to achieve goals Demonstrated experience exceeding the demands of various internal stakeholders across multiple business units and regions Experience using varying types of communication to effectively convey complex ideas and strategies to C-level executives Experience working in a self-directed environment, maintaining a focus on teamwork and interpersonal communication, in ambiguous situations",
    "preferred_qualifications": "Experience working in creative marketing or agency operations for a brand/client side Experience supporting Marketing teams to build marketing business and staffing models Experience working at an advertising agency in creative, agency operations, or account management Experience developing and executing strategic sourcing category plans Experience working in a high-growth environment Understanding of various international markets and the experience managing and navigating the complexities of global sourcing strategies Familiarity with relevant software or technology used in sourcing and procurement Certifications or advanced degrees in procurement, supply chain management, or a related field",
    "compensation": "$137,000/year to $195,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}