{
  "2045208722903157": {
    "title": "Global Head of Innovation Endorsements",
    "URL": "https://www.metacareers.com/jobs/2045208722903157",
    "location": "Los Angeles, CA • Menlo Park, CA • New York, NY • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Negotiate long-term and/or surgical endorsement partnerships with top talent and/or creators/influencers on behalf of one/more of Instagram, Facebook, Reality Labs, Meta Superintelligence Labs, WhatsApp and Messenger. Develop a framework for integrating talent/endorsement priorities from product, marketing & partnerships teams across Meta’s apps and platforms, generating alignment on investments and trade-offs Organize Meta’s cross-functional forums for navigating key decisions related to talent/endorsement investments Analyze markets, targets, trends and synthesize recommendations into actionable plans & strategy",
    "minimum_qualifications": "15+ years experience in talent endorsement deal negotiations Subject matter expertise in endorsement/sponsorship/commercial-tie-in deals with content, social media, events, product integrations and traditional marketing campaign components Knowledge of social media, digital business models and internet/consumer technology Experience managing multiple tasks under timelines, and experience executing across a quickly evolving products Demonstrated fluency in the most complex business and legal issues and partner relations Skill in communication & consensus-building Experience building & presenting pitch & briefing materials BS or BA",
    "preferred_qualifications": "Experience working for big brands, major agency(ies) and/or big tech Entrepreneurial, persistent, and resourceful, with the experience learning quickly about new technologies Experience successfully navigating a fast-paced, highly ambiguous environment MBA or JD",
    "compensation": "$296,000/year to $356,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}