{
  "1125214756383194": {
    "title": "Software Engineer, iOS",
    "URL": "https://www.metacareers.com/jobs/1125214756383194",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and test software applications or systems for various mobile software services. Work closely with product and design teams to build new and innovative application experiences for the iOS platform. Implement custom native user interfaces using the latest iOS programming techniques and development tools. Build reusable iOS software components for interfacing with our back-end platforms. Analyze and optimize UI and infrastructure application code for quality, efficiency, and performance. Work on problems of diverse scope where analysis of data requires evaluations of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions. Complete medium to large features (each with many tasks) independently without guidance. Identify and drive changes as needed for assigned codebase, product area, or systems. Seek out ways to improve the components or systems to facilitate easier development of new features. Lead small projects or small teams of people (including activities like running team meetings, writing project status reports, etc). Have a consistently high level of productivity across many projects and develop a track record of successfully completing projects of large scope. Establish yourself as a strong owner of a particular component, feature or system and have an expert end-to-end understanding.",
    "minimum_qualifications": "Master's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field. Requires completion of a university-level course, research project, internship, or thesis in the following: Java, Python, and Object-Oriented Programming Algorithms and Data Structures Relational databases and SQL Concurrent programming Distributed systems Core web technologies: HTML, CSS, JavaScript, React or Nodejs API styles, software architecture, and human-computer interaction Software testing and security Integrated Development Environments and revision control systems including GIT File Manipulation, console commands, or shell scripting Applying algorithms and core computer science concepts to real-world systems",
    "preferred_qualifications": "",
    "compensation": "$224,197/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1335302334612265": {
    "title": "Software Engineer, iOS",
    "URL": "https://www.metacareers.com/jobs/1335302334612265",
    "location": "Seattle, WA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various mobile software services. Work closely with product and design teams to build new and innovative application experiences for the iOS platform. Implement custom native user interfaces using the latest iOS programming techniques and development tools. Build reusable iOS software components for interfacing with our back-end platforms. Analyze and optimize UI and infrastructure application code for quality, efficiency, and performance.",
    "minimum_qualifications": "Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and 2 years of experience in the job offered or in a computer-related occupation Requires 2 years of experience in the following: 1. Object-oriented software development 2. Building complex applications for the iPhone, iPad and other iOS based products using Objective-C, Swift or C++ with the iOS SDK 3. Building maintainable and testable code bases, including API design and unit testing techniques 4. Multithreading programming and mobile memory management 5. Experience in both Objective-C and Swift 6. Building large-scale infrastructure applications 7. Relational databases and SQL 8. Linux or Unix 9. Algorithms 10. One of the following client-server communication patterns: REST, GraphQL, gRPC 11. Mobile architecture patterns that can scale to a large number of programmers and teams in one codebase (MVVM, VIPER, modularization, etc.) and 12. Dependency injection and scoped access to shared resources",
    "preferred_qualifications": "",
    "compensation": "$217,791/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2010209116439181": {
    "title": "Electrical Engineer",
    "URL": "https://www.metacareers.com/jobs/2010209116439181",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Responsible for the power circuit design, simulation, validation, and characterization across multiple products ensuring their successful delivery. Evaluate and enable innovative solutions for cost, size, efficiency, safety, and reliability. Generates design documentations, perform schematic capture and power delivery network simulation both pre and post board layout, prototype bring-up and design validation. Will find the root-cause and solve technical issues during new product development and in field escalations. Characterizes power consumption, battery run time, battery charging/discharging curve at each NPI build. Writes scripts to collect power, compute, thermal measurements and drive every mA of power out of the system cross-functionally.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Electrical Engineering, Computer Engineering, or related field and 4 years of experience in the job offered or in an electrical engineering-related occupation Experience must include 4 years of experience in the following: 1. Designing for HDI flexible or rigid substrates for high volume cost optimized applications 2. Electrical engineering fundamentals 3. Feasibility studies and tradeoff analysis for technology and component down selection 4. Development of electrical circuit designs for complex subsystems 5. Schematic entry in one or more industry standard tools i.e. Cadence, Mentor Graphics, or Altium 6. Conducting and documentation for cross functional design reviews 7. Bringup, debugging, and manufacturing support 8. Oscilloscopes, high speed digital test equipment, logic analyzers, and function generators 9. Scripting for basic tooling/automation in one or more programming languages including: Python, Javascript, or C/C++ 10. Experience in one or more of the following areas: audio processing, vision/camera solutions, motion sensors (IMU), high speed circuit design, FPGA programming (VHDL/Verilog), microcontrollers, microprocessors, or firmware",
    "preferred_qualifications": "",
    "compensation": "$164,000/year to $189,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2604676553242807": {
    "title": "Business Engineer",
    "URL": "https://www.metacareers.com/jobs/2604676553242807",
    "location": "New York, NY • Full Time",
    "responsibilities": "Build new products and improve existing ones in collaboration with Meta product engineering teams to meet business needs. Actively seek out and apply knowledge of products, technologies and business to build solutions to solve for problems at scale. Independently break down coding projects into tasks and partner with all applicable teams and partners to meet pre-established goals. Ship and launch production level code in manageable pieces, with relevant descriptions, test plans, documentation, unit integration tests. Conduct code reviews and provide constructive feedback while quickly actioning feedback from code reviews conducted of your code. Maintain relationships with partner teams and clients (internal and external) and present technical opportunities in a consulting capacity. Assist in on-boarding of new team members.",
    "minimum_qualifications": "Requires a Bachelor's degree(Foreign equivalent accepted) in computer Science, Computer Engineering, Information Systems, or a related field in the job offered or in a computer-related occupation Requires 2 years of experience involving the following: 1. Communicating with both technical and non-technical (business/marketing/sales) audiences 2. Working as a software engineer, solutions architect, or partner/sales engineer 3. Working with global teams 4. Writing and shipping reliable, scalable, and efficient code 5. Software development, building software developed in Python, PHP, C/C++, Ruby, C#, or Java and 6. Writing SQL",
    "preferred_qualifications": "",
    "compensation": "$189,380/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "24815572374770459": {
    "title": "Product Manager",
    "URL": "https://www.metacareers.com/jobs/24815572374770459",
    "location": "New York, NY • Full Time",
    "responsibilities": "Plan, initiate, and manage information technology projects for web-based products and platforms. Lead the ideation, technical development, and launch of innovative tools, platforms, and/or products. Drive product development with teams of world-class engineers and designers. Work closely with cross-functional teams to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), and guide the team through key milestones. Integrate usability studies, research, and market analysis into product requirements to improve engineer productivity and enhance user satisfaction. Define and analyze metrics that inform the success of products. Identify and track key performance metrics. Strategically evolve and grow existing products and services to constantly deliver a better user experience.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and 5 years of progressive, post-baccalaureate experience in the job offered or in a computer-related occupation Experience must include 5 years in the following: Managing delivery of at least 1 hardware/software product Technical architecture of complex and highly scalable web applications or media products Designing simple and intuitive user interfaces Creating examples through wire frames and mock ups Developing social products, technologies, or platforms Delivering technical presentations Analyzing complex, large-scale data sets and making decisions based on data Gathering requirements across diverse areas and users, and converting and developing them into a product solution Technical experience with analytical tools, methodologies, and design",
    "preferred_qualifications": "",
    "compensation": "$207,550/year to $232,100/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}