{
  "775338825466689": {
    "title": "Executive Administrative Partner",
    "URL": "https://www.metacareers.com/jobs/775338825466689",
    "location": "Bowling Green, OH • Full Time",
    "responsibilities": "Coordinate internal and external meetings for up to three leaders Manage hectic and complex calendars Facilitate site meetings through agenda collection, action item tracking, and note taking Collaborate on arranging and structuring leadership visits to the site Prepare expense reports and purchase requisitions Coordinate travel arrangements Organize space planning, strategic offsite events, and team all-hands meetings Plan and execute team engagement events Build cross-functional relationships between teams Be a culture carrier for the local data center Participate in the global data center admin community General administrative duties",
    "minimum_qualifications": "3+ years of relevant experience providing administrative support to 1 or more executives 3+ years of relevant experience coordinating travel logistics on behalf of 1 or more executives 3+ years of relevant calendar management and expense report management experience for 1 or more executives Experience balancing competing priorities Experience with Microsoft Office and Google Suite",
    "preferred_qualifications": "BA/BS Event planning experience Experience collaborating with and partnering closely with other administrative professionals and key cross functional partners Experience maintaining confidentiality and discretion in all partnerships Experience in prioritizing multiple assignments quickly Experience in multitasking and changing direction quickly",
    "compensation": "$31.88/hour to $47.50/hour + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "790702797114385": {
    "title": "Electrical Engineering Intern",
    "URL": "https://www.metacareers.com/jobs/790702797114385",
    "location": "Sunnyvale, CA • Redmond, WA • Internship",
    "responsibilities": "Become familiar with hardware architecture and design Work on operational theory of circuits, power electronics, and/or signal integrity Develop test plans, execute validation, and publish findings to team Partner with team peers on development, validation, and/or measurement",
    "minimum_qualifications": "Currently has, or is in the process of obtaining, a Bachelor's or Master’s degree in Electrical Engineering, Computer Engineering, or related field Experience with electrical test lab equipment (e.g. Oscilloscope, Analyzers, DMM, Power Supply, etc.) Experience with troubleshooting and diagnosing hardware issues at board level Experience with circuit design and analog fundamentals Experience with algorithms and signal processing Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment Intent to return to degree program after completion of the internship",
    "preferred_qualifications": "Basic experience of Machine Learning Detail oriented, collaborative, and communication skills Experience in signal integrity or high-speed communication interfaces",
    "compensation": "$6,688/month to $11,467/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "796977383153845": {
    "title": "Marketing Analyst",
    "URL": "https://www.metacareers.com/jobs/796977383153845",
    "location": "Menlo Park, CA • New York, NY • San Francisco, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Build data expertise and leverage data controls to ensure privacy, security, compliance, data quality, and operations for allocated areas of ownership Collaborate with marketers, engineers and data scientists to understand data needs for marketing effort, representing key data insights in a meaningful way Intake on audience needs for marketing campaigns and apply contextual knowledge in order to scope data requests, synthesize insights, and recommend marketing signals to key business partners in collaboration with others Focus on impact and propose metrics to understand success of marketing initiatives Perform data analysis and reporting for marketing to advertisers, agencies and partners in our B2B ecosystem Design and build reporting and visualizations for marketing programs, leveraging campaign delivery data across all marketing channels Recognize patterns and changing requirements to identify opportunities to build new analytics and reporting capabilities to support program evaluation and operations Apply expertise in data analytics to identify business relevant insights and develop executive level presentations to influence marketing strategy Manage multiple concurrent projects that require inputs from cross-functional stakeholders while balancing impact on business needs Proactively manage stakeholder expectations and resolve issues in a timely manner Leverage data analysis tools, such as Python, R, SQL, Tableau, and spreadsheets to develop reports, understand trends, and extract insights",
    "minimum_qualifications": "BA/BS in Engineering, Data Science, or related field with 6+ years (or MBA/MA/MS with 5+ years) practical experience in Analytics, Marketing, Operations, Business, Economics, Statistics, or a related fields 6+ years of data analysis, quantitative / qualitative research, experience gathering and evaluating data and validating hypotheses 4+ years of SQL, data modeling and advanced querying 3+ years of program management, directing tasks and managing multiple streams of work 3+ years of experience in data visualization tools (for example, Tableau) and spreadsheets (complex formulas, pivots, macros, etc.) 3+ years of storytelling with data, communicating technical results to technical and non-technical audiences Experience engaging directly with executive stakeholders and managing relationships",
    "preferred_qualifications": "Experience with Business-to-Business landscape and/or online marketing and advertising Experience working effectively through ambiguity and adversity, quickly adjusting to new conditions Proven experience in architecting, documenting, and implementing complex systems, and skilled at clearly defining system components that address long-term challenges",
    "compensation": "$124,000/year to $176,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "851590257218593": {
    "title": "Research Engineer - Neuromotor Interfaces",
    "URL": "https://www.metacareers.com/jobs/851590257218593",
    "location": "Burlingame, CA • New York, NY • Full Time",
    "responsibilities": "Research and develop Deep Learning or other computational models with at least one of Computer Vision, and EMG signal processing Design methods, tools and infrastructure to analyze and leverage rich multimodal data sets Collaborate with research scientists and research engineers to develop innovative deep learning models that define the next generation EMG-based AR/VR interaction techniques Define short-term research goals, informed by practical engineering concerns Help transition and deliver our work from research into product Adapt standard machine learning methods to best utilize modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU)",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 5+ years experience with developing machine learning models at scale from inception to business impact Research experience in machine learning and deep learning Experience with architectural patterns of large scale software applications Programming experience in Python and hands-on experience with frameworks such as PyTorch Masters degree in Computer Science, Computer Engineering, or relevant technical field",
    "preferred_qualifications": "First-author publications at peer-reviewed AI conferences (e.g. NeurIPS, CVPR, ICML, ICLR, ICCV, ACL) Experience with rapid prototyping and disciplined software development processes Experience with productizing new research results Ph.D. degree and publications in machine learning, signal processing, electrical engineering, computer science, statistics, physics, or related fields",
    "compensation": "$85.10/hour to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1082512670465895": {
    "title": "Research Scientist Intern, Holography (PhD)",
    "URL": "https://www.metacareers.com/jobs/1082512670465895",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results. Present research results and contribute to research that can be applied to Meta product development. Develop next generation AR/VR displays with an emphasis on advanced simulations and experimental optics prototyping to prove new concepts and understand the factors that impact them. Collaborate with the larger Meta Reality Labs Research team to explore novel solution spaces for AR/VR devices. Explore the application of at least one of the following: digital holography, wave optics, diffraction optics, spatial light modulation, polarization optics, illumination, optical system design.",
    "minimum_qualifications": "Currently has or is in the process of obtaining a Ph.D. degree in Optical Science, Optical Engineering, Electrical Engineering, Physics, or relevant technical field Must obtain work authorization in country of employment at the time of hire and maintain ongoing work authorization during employment 2+ years of experience in at least one of the following areas: holography, diffractive optics, wave optics, optical system prototyping 2+ years of experience with experimental optics and conducting laboratory work, including demonstrated ability to construct proof-of-concept systems and evaluate performance Familiarity with at least one scientific programming language (e.g., MATLAB, Python, etc) Intent to return to the degree program after the completion of the internship/co-op",
    "preferred_qualifications": "Experience working and communicating cross functionally in a team environment 2+ years of experience with optical design programs such as Zemax OpticStudio, Code V, LightTools, FRED, or similar 2+ years of experience working with holographic materials, spatial light modulators, and interferometric exposure tools Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as CLEO, SPIE Photonics West, FiO+LS, OSA, or similar",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1124376506565938": {
    "title": "Associate General Counsel, Special Investigations",
    "URL": "https://www.metacareers.com/jobs/1124376506565938",
    "location": "Menlo Park, CA • Washington, DC • New York, NY • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Conduct internal investigations across the globe of matters relating to anti-corruption, cyber security, anti-money laundering, securities, competition law, international trade and fraud and other areas involving potential criminal and regulatory liability Retain and manage outside counsel relating to investigation matters Ensure investigations result in remediations that maintain an environment of compliance and make Meta’s robust compliance infrastructure even stronger",
    "minimum_qualifications": "J.D. degree (or foreign equivalent) Active membership in at least one US state bar and eligibility to obtain registered in-house counsel status (if required by the State Bar in the assigned work location) 5+ years of legal experience as a practicing attorney, including at a law firm and/or in-house or government experience 5+ years relevant experience conducting investigations Demonstrates experience assessing risk Effective communication skills Demonstrate business judgment and client counseling skills",
    "preferred_qualifications": "Experience and background in conducting internal investigations Experience building relationships and working in a cross functional team to address complex legal challenges Demonstrated knowledge of tech-regulatory landscape, authorities and frameworks",
    "compensation": "$198,000/year to $266,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1157729173089484": {
    "title": "Product Content Engineer",
    "URL": "https://www.metacareers.com/jobs/1157729173089484",
    "location": "Menlo Park, CA • New York, NY • San Francisco, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Prioritize fast execution across content optimization experiments and analyses with the goal of delivering insights and recommendations to improve both user and creator experiences on-platform Understand technical product needs and translate those into actionable direction and readouts for a content-focused cross-functional team Understand Meta’s strategic and competitive position and deliver content strategies and product solutions that are aligned with our mission and recognized best in the industry Perform data exploration and analysis to produce actionable insights and reports for our content, engineering, strategy, and product teams Integrate content and market analysis into product requirements to improve engineer output and enhance both creator and user satisfaction Manage efforts to drive improved performance from creators in North American markets through cross-functional projects with Search, Ranking, Product, and Partnerships to drive top-line goals Define emergent opportunities and drive impact via execution in highly ambiguous areas. Agile support and flexibility is required",
    "minimum_qualifications": "8+ years of experience with digital content strategy, journalism, production, linguistics and relevant skills 1+ years working with GenAI products, prompt engineering, annotation, and/or content labeling and analysis Expertise in developing and implementing high-quality datasets, annotations, and evaluation metrics that drive the training and improvement of generation models Experience working independently and autonomously Previous experience collaborating with product and technical teams Proven knowledge of industry trends and news Experience leading and collaborating on XFN projects to build products, respond to urgent needs, preempt issues and address concerns in collaborative and timely fashion",
    "preferred_qualifications": "5+ years of work experience in product management, data analytics, or content operations in a leading content platform 2+ years of experience working closely with ranking teams Demonstrated expertise in data science or data analysis with proven experience in creating queries, generating complex spreadsheets, and building dashboards Proficiency in SQL-based languages, and experience with Python or R preferred Professional working fluency in multiple languages, especially Spanish or Portuguese preferred Experience in data visualization and tools such as Tableau",
    "compensation": "$159,000/year to $223,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1187622009934903": {
    "title": "NPI Program Manager",
    "URL": "https://www.metacareers.com/jobs/1187622009934903",
    "location": "Menlo Park, CA • Fremont, CA • Full Time",
    "responsibilities": "As single-threaded owner for Meta’s Supply Chain organization, apply hands-on program management skills and techniques to drive overall schedule, build & test readiness, factory readiness, material readiness, and risk management, internal and external escalations and program communications to achieve on-time and on-quality execution of NPI builds for AI compute, storage and network hardware programs Act as primary liaison between Meta’s Supply Chain organization and all internal and external partners for covered programs Drive build readiness including all Supply Chain deliverables and daily build issue debug cadence across Meta’s Supply Chain and internal and external engineering and manufacturing partners Drive manufacturing, test and material readiness, infrastructure Own program risk identification, mitigation, management and communication across Meta’s Supply Chain organization Own overall program communication strategy and execution across Meta’s supply chain organization and internal and external partners Drive factory ramp readiness with internal and external engineering and manufacturing partners Own and drive program escalations across Meta internal and external teams and partners Identify operational pain points and improvement opportunities across internal and external processes and workflows and drive improvements across multiple teams and functions 50% domestic and international travel is required",
    "minimum_qualifications": "Bachelor's degree in a directly related field, or equivalent practical experience 6+ years of relevant work experience with in computer hardware and/or networking manufacturing, shop floor control, supply chain execution, manufacturing testing and product lifecycle management tools and processes Experience in NPI product life-cycle, program management including program kickoff, stakeholder influence & strategy, workstream prioritization, driving cross-functional execution and establishing working relationships across multi-disciplinary teams Technical background in engineering or manufacturing in AI, compute, or networking space Effective demonstrated skill to adapt, take initiative and thrive in ambiguity Knowledge of manufacturing-specific roles & responsibilities throughout NPI phases including HW, SW, manufacturing, product, process, test & quality engineering, reliability, and quality assurance Knowledge of supply chain-specific roles & responsibilities throughout NPI phases including procurement, planning, product lifecycle management, materials management, demand and supply planning, and logistics Knowledge of PLM concepts including BOMs, ECO / MCO, deviations, part substitutions, effectivity date management, quality management systems Proven communication and presentation skills",
    "preferred_qualifications": "M.S. in hardware engineering, manufacturing engineering or a related technical discipline, or equivalent experience Knowledge of manufacturing test processes & systems, including quality inspections, automated server, storage and integrated rack testing Experience completing Total Cost of Ownership (TCO) analysis and ensuring project costs meet or better budget objectives Experience sourcing and managing global (Asia, EU, LATAM) suppliers and manufacturing partners Experience with activities around RFQ package creation, source selection, specification creation, cost analysis, and price negotiation with appropriate team members Experience executing commercial sourcing agreements Experience with risk management and disaster & recovery best practices related to hardware manufacturing facilities, processes and goals Experience with data center hardware architecture and deployment Bilingual (English/Spanish) preferred",
    "compensation": "$134,000/year to $196,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1188975483108033": {
    "title": "Research Scientist Intern, Nano-photonics Design (PhD)",
    "URL": "https://www.metacareers.com/jobs/1188975483108033",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Develop next generation AR displays with the use of optical and electromagnetic simulations and lead prototyping efforts to prove proof of principle concepts. Collaborate with the larger Meta Reality Labs Research team to explore novel solution space for AR devices. Explore applications of active photonic integrated circuits and similar nano-photonic devices in simulatoin or with experiments to develop a near eye display. Publish research results in internal organizations, conferences, patents and contribute to research that can be applied to Meta product development.",
    "minimum_qualifications": "Currently has or is in the process of obtaining a PhD degree in Physics, Mathematics, Optical Science and Engineering, Electrical Engineering, Computational Imaging, Material Sciences or relevant technical field Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment 2+ years experience in at least two of the following areas of optical research: Fundamental electromagnetics, Wave optics, polarization optics, geometrical optics, Ray tracing, Optical bench top experiments 2+ years experience with wave optics and geometric optics design programs 2+ years experience with experimental optics and conducting laboratory work (i.e., demonstrated ability to construct proof-of-concept systems and to evaluate performance) Intent to return to a degree-program after the completion of the internship/co-op",
    "preferred_qualifications": "Experience working and communicating cross functionally in a team environment Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading conferences such as CLEO, SID, SPIE, Optica, etc Experience with nano-photonics solvers (e.g. RCWA, FDFD) and simulation software (Lumerical, meep, or similar) Experience with inverse design for photonic devices",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1308237554316280": {
    "title": "Product Content Engineer",
    "URL": "https://www.metacareers.com/jobs/1308237554316280",
    "location": "Menlo Park, CA • New York, NY • San Francisco, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Prioritize fast execution across content optimization experiments and analyses with the goal of delivering insights and recommendations to improve both user and creator experiences on-platform Understand technical product needs and translate those into actionable direction and readouts for a content-focused cross-functional team Understand Meta’s strategic and competitive position and deliver content strategies and product solutions that are aligned with our mission and recognized best in the industry Perform data exploration and analysis to produce actionable insights and reports for our content, engineering, strategy, and product teams Integrate content and market analysis into product requirements to improve engineer output and enhance both creator and user satisfaction Manage efforts to drive improved performance from creators in North American markets through cross-functional projects with Search, Ranking, Product, and Partnerships to drive top-line goals Define emergent opportunities and drive impact via execution in highly ambiguous areas. Agile support and flexibility is required",
    "minimum_qualifications": "5+ years of experience with digital content strategy, online creation, production, or the short form video creator and content ecosystem Expertise with creators and production tools, and in spurring creator inspiration Experience working independently and autonomously Previous experience collaborating with product and technical teams Proven knowledge of industry trends and news, including knowledge of the creator ecosystem Experience leading and collaborating on XFN projects to build products, respond to urgent needs, preempt issues and address concerns in collaborative and timely fashion",
    "preferred_qualifications": "3+ years of work experience in product management, data analytics, or content operations in a leading content platform 1+ years working with GenAI products, video generation, prompt engineering, annotation, and/or content labeling and analysis 1+ years of experience working closely with ranking teams Demonstrated expertise in data science or data analysis with proven experience in creating queries, generating complex spreadsheets, and building dashboards Proficiency in SQL-based languages, and experience with Python or R preferred Professional working fluency in multiple languages, especially Spanish or Portuguese preferred Experience in data visualization and tools such as Tableau",
    "compensation": "$129,000/year to $187,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1309311757185034": {
    "title": "Sensor Electrical Engineer",
    "URL": "https://www.metacareers.com/jobs/1309311757185034",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Collaborate with cross functional teams and external partners to push the boundaries of technologies and deliver capacitive touch based sensors in battery operated products Lead efforts to integrate new sensor modalities into high volume consumer products through all stages of product development (from prototyping, design through mass production) Leverage analog, circuit design, and optoelectronics fundamentals to build, debug, and validate prototypes Apply electrical engineering fundamentals to convert reference designs into custom product solutions. Design schematics, supervise board/Flexible Printed Circuit (FPC) layouts, and actively participate in design reviews to support sensors integration into product Optimize sensor architecture, sensor component selection and sensing system design Work closely with Contract Manufacturer / Joint Development Manufacturer CM/JDM resources to leverage their engineers and maximize the focus of internal resources on adding value to and differentiating our product Perform lab measurements and factory tests as needed to validate the design and resolve any issues Drive the resolution of technical issues by working with the cross-functional teams: Electrical, Mechanical, Software, Quality, Reliability as well as the various CM/JDM teams",
    "minimum_qualifications": "Bachelor’s degree in Electrical Engineering, Physics, Mathematics, or related field (or equivalent experience) with 6+ years work experience in Electrical Engineering 4+ years of experience in consumer electronics or related fields 4+ years of experience in embedded or mobile system design, sensing technologies and architecture, circuit design, board bring-up and product NPI experience Experience to integrate capacitive touch sensing technologies in a product Experience leading technical teams, cross-functional groups and vendors Experience with hands-on hardware bring-up, debugging, and functional verification",
    "preferred_qualifications": "Demonstrated experience to bring new technologies to product Experience performing bench level power measurements coupled with analytical experience Knowledge of the relationship between physical layout and electrical performance Experience communicating novel concepts to broad audience succinctly and in simple terms Experience in modeling, developing test scripts and firmware Proficiency with data collection and analysis tools including JMP, Python, LabView, MATLAB and other scripting languages",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1344094953788126": {
    "title": "Manufacturing Technical Manager",
    "URL": "https://www.metacareers.com/jobs/1344094953788126",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Develop holistic manufacturing process flow, line layout, FA process flow, repair and rework process flow, headcount, and machine quantity during New Product Introduction (NPI) builds Collaborate with cross-functional team to drive Surface Mount Technology (SMT) and FATP Equipment & Fixture schedule and line readiness Manage Major Issue List and facilitate technical discussion to resolve open issues, driving FACA to meet yield targets Drive line cost savings through Capex & MVA reduction by utilizing yield bridge, UPH and OEE optimization Drive development and implementation of repair and rework process flows International travel to supplier sites, up to 25%",
    "minimum_qualifications": "Proven program/project management experience from NPI to high-volume MP Experience working with international contract manufacturers Background in process development, bring-up, and qualification, including Final Assembly, Test, Packout, and SMT processes Knowledge of Design of Experiments and analytical problem-solving approaches Cross-functional collaboration skills Concise and clear communication",
    "preferred_qualifications": "Experience with manufacturing equipment DFM review Knowledge on mechanical tolerance analysis Understanding of display optical metrology and calibration is a plus Experience with scripting and data analysis using tools such as Python, JMP and Tableau",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1387889642858746": {
    "title": "Director, Vendor Operations",
    "URL": "https://www.metacareers.com/jobs/1387889642858746",
    "location": "Austin, TX • New York, NY • Full Time",
    "responsibilities": "Functional leader for Meta Small Business Sales’ Vendor Operations team, reporting to the VP, Small Business Group Responsible for managing a central team in charge of vendor partner strategy, operational excellence, risk and compliance, vendor communications and change management. Strategy: Define SBG’s global call center partnership strategy aligned to business priorities - including partner selection, global footprint strategy, vendor goaling/incentives and operating model. Leads executive level relationship and operations management with vendors in partnerships with VP. Business Operations: Reimagine and own Meta’s global business rhythm with vendors, driving partner-level accountability.. Operational Excellence: Oversee team responsible for developing contract standards, processes, audit strategy and compliance/remediation approaches. Responsible for collaborating with cross-functional partners on security operations and risk mitigation. Tooling & Site Stability: Partner with product to ensure stable and productive use of agent and vendor tech stack. Comms & Change Management: Oversees global communications strategy across all altitudes of partner stakeholders. Responsible for managing globally consistent change management process. Partner with Sales to define contract standards and operationalize global strategies driving workforce health, productivity and training. Partner with Sales to deeply understand commercial strategy and business requirements - think outside the box on solutions and Close collaboration with Sourcing, Legal, Product, and Sales. Responsible for defining and delivering against a functional roadmap, inform adjacent functions impacting delivery.",
    "minimum_qualifications": "12+ years of experience in scaled operations and vendor management for large, outsourced organizations Operations expertise. Experience spearheading and evolving operational strategy and execution in a hyper dynamic environment. Experience beyond customer support call center operations - specifically sales and customer success oriented operations Influential strategist and leader. Ability to set, communicate, and lead through a vision with senior stakeholders, including external partners Proven business analytics skills. Experience evaluating data to understand trends, developing frameworks and analyses to guide strategy and implementation Change agent. Experience leading initiatives involving large-scaled organizational transformations. Grasp of the organizational dynamics that influence adoption of process changes Effective manager and influencer. Experience leading and inspiring dispersed teams towards a common goal with a high bar for execution Expert communicator. Ability to distill complex ideas simply through a variety of mediums and to zoom in/out based on audience",
    "preferred_qualifications": "",
    "compensation": "$227,000/year to $296,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1464744531425363": {
    "title": "Business Development Manager, GenAI Partnerships",
    "URL": "https://www.metacareers.com/jobs/1464744531425363",
    "location": "Los Angeles, CA • Menlo Park, CA • Seattle, WA • New York, NY • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Defining, negotiating, and closing high-impact partnerships for Meta's AI products and technologies Managing relationships with partners, identifying new opportunities, and growing partnership success Working closely with product and engineering teams to define priorities and identify key opportunities Managing external and internal cross-functional teams when integrating products or technologies with external partners Conducting market research and analysis to identify trends and opportunities in the AI industry Working cross-functionally with legal, marketing, finance, product, and engineering teams to negotiate deal terms, drive special projects, advocate internally for partners, and educate on industry trends Providing regular reports and updates on partnership activity and performance",
    "minimum_qualifications": "Bachelor's degree 7+ years of work experience including in business development, strategy or related fields Experience leading cross-functional teams to orchestrate and complete deals, including experience interpreting legal documents and working with attorneys to complete agreements Experience in developing and driving business strategies and initiatives with executive stakeholders Experience in working closely with product and engineering teams Experience developing working relationships inside and outside an immediate team or partner organization Analytical and problem-solving skills Knowledge of the AI ecosystem and competitive landscape including the technology, what other companies are doing, industry alliances and broader government and regulatory positions Demonstrated track record of navigating cross-functional teams to achieve your goals",
    "preferred_qualifications": "Experience in AI products and technologies such as AI models, use-cases, and systems Experienced in negotiating complex deals Experience in managing and driving AI initiatives from inception to launch successfully with partners Experience in a deadline-focused and highly ambiguous start-up environment Demonstrated presentation and communication skills",
    "compensation": "$159,000/year to $223,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1500930227895266": {
    "title": "Marketing Analyst",
    "URL": "https://www.metacareers.com/jobs/1500930227895266",
    "location": "Menlo Park, CA • New York, NY • San Francisco, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Build data expertise and leverage data controls to ensure privacy, security, compliance, data quality, and operations for allocated areas of ownership Collaborate with marketers, engineers and data scientists to understand data needs for marketing effort, representing key data insights in a meaningful way Intake on audience needs for marketing campaigns and apply contextual knowledge in order to scope data requests, synthesize insights, and recommend marketing signals to key business partners in collaboration with others Focus on impact and propose metrics to understand success of marketing initiatives Perform data analysis and reporting for marketing to advertisers, agencies and partners in our B2B ecosystem Design and build reporting and visualizations for marketing programs, leveraging campaign delivery data across all marketing channels Recognize patterns and changing requirements to identify opportunities to build new analytics and reporting capabilities to support program evaluation and operations Apply expertise in data analytics to identify business relevant insights and develop executive level presentations to influence marketing strategy Manage multiple concurrent projects that require inputs from cross-functional stakeholders while balancing impact on business needs Proactively manage stakeholder expectations and resolve issues in a timely manner Leverage data analysis tools, such as Python, R, SQL, Tableau, and spreadsheets to develop reports, understand trends, and extract insights",
    "minimum_qualifications": "BA/BS in Engineering, Data Science, or related field with 5+ years (or MBA/MA/MS with 4+ years) practical experience in Analytics, Marketing, Operations, Business, Economics, Statistics, or a related fields 5+ years of data analysis, quantitative / qualitative research, experience gathering and evaluating data and validating hypotheses 3+ years of SQL, data modeling and advanced querying 3+ years of program management, directing tasks and managing multiple streams of work 3+ years of experience in data visualization tools (for example, Tableau) and spreadsheets (complex formulas, pivots, macros, etc.) 3+ years of storytelling with data, communicating technical results to technical and non-technical audiences Experience engaging directly with executive stakeholders and managing relationships",
    "preferred_qualifications": "Experience with Business-to-Business landscape and/or online marketing and advertising Experience working effectively through ambiguity and adversity, quickly adjusting to new conditions Proven experience in architecting, documenting, and implementing complex systems, and skilled at clearly defining system components that address long-term challenges",
    "compensation": "$104,000/year to $146,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1509815147009453": {
    "title": "Research Scientist Intern, Optical System Design (PhD)",
    "URL": "https://www.metacareers.com/jobs/1509815147009453",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results. Publish research results and contribute to research that can be applied to Meta product development. Develop next generation AR/VR displays with an emphasis on advanced simulations and prototyping to prove new concepts and understand the perceptual impact of those concepts. Collaborate with larger Meta Reality Labs Research team to explore novel solution space for AR/VR devices. Explore the application of at least one of the following: geometrical optics, diffraction optics, polarization optics, illumination, optical system design. This position will have an emphasis of advanced simulations and prototyping to prove new concepts and the perceptual impact of those concepts.",
    "minimum_qualifications": "Currently has or is in the process of obtaining a Ph.D. degree in Optical Science, Optical Engineering, Opto-Mechanics, Electrical Engineering, Physics, Computational Imaging or relevant technical field Must obtain work authorization in country of employment at the time of hire and maintain ongoing work authorization during employment 2+ years experience in at least one of the following areas of optical research: geometry optics, aberration theory, optical system prototyping 2+ years experience with lens design in optical design programs such as Zemax OpticStudio, Code V or similar 2+ years experience with scientific programming languages (e.g., MATLAB, Python, and Mathematica) Intent to return to degree program after the completion of the internship/co-op",
    "preferred_qualifications": "Experience working and communicating cross functionally in a team environment Experience in freeform optics Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences 2+ years of experience in system-level prototyping work, including hands-on prototyping of bench-top optical components Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as JOSA, SPIE, OSA, IEEE, CLEO, or similar",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2027525051336328": {
    "title": "Data Analyst, Global Operations",
    "URL": "https://www.metacareers.com/jobs/2027525051336328",
    "location": "Austin, TX • New York, NY • Full Time",
    "responsibilities": "Partner with operations, data science, engineering, and product teams to address complex business challenges through AI-first analytical strategies and solutions Build, maintain, and optimize scalable data pipelines, dashboards, automated reports, and self-service tools for teams across Meta Champion the adoption and integration of AI tooling within analytics workflows, educating and uplifting team proficiency in modern solutions and innovative thinking Communicate complex insights clearly to technical and non-technical stakeholders, influencing decisions and business outcomes Continuously explore and experiment with emerging technologies and automation methods to advance the team’s analytics offerings",
    "minimum_qualifications": "7+ years of experience in analytics, operations, product, engineering, or related fields—ideally within deadline focused tech environments or consulting Bachelor’s degree in a quantitative discipline such as Computer Science, Data Science, Statistics, Mathematics, Operations Research, or equivalent practical experience Advanced proficiency in SQL, and experience with Python, for data analysis and automation Proven experience building and deploying scalable data pipelines and productionizing dashboards using BI tools (e.g., Tableau) Track record of proactively using AI tools to drive productivity and innovation across projects and teams (bonus for championing AI adoption and education within teams) Solid understanding of statistical analysis with practical application to real-world business problems Demonstrated ability to independently manage analytics projects end-to-end, from problem definition to business adoption and impact measurement",
    "preferred_qualifications": "Master’s degree or higher in a quantitative discipline such as Data Science, Statistics, Mathematics, Computer Science, or a related field Hands-on experience with AI/ML model development, deployment, and/or integration",
    "compensation": "$150,000/year to $213,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2028027941278088": {
    "title": "Head of Immersive Video Production, Reality Labs",
    "URL": "https://www.metacareers.com/jobs/2028027941278088",
    "location": "Los Angeles, CA • Burlingame, CA • Remote, US • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Lead, mentor, and inspire a multidisciplinary team of producers, production and post-production staff, and technical leads, fostering a standard of creative quality, innovation, and operational rigor Champion best practices in both traditional and immersive video production, including stereoscopic 3D, live services, and interactive formats Supervise the end-to-end production pipeline for a varied slate of Film/TV, music, and sports projects. Work in close partnership with development teams to take projects from development and greenlight into active execution, from pre-production through delivery Manage timelines, milestones, and budgets for multiple concurrent projects, ensuring on-time and on-budget delivery Supervise and collaborate with internal teams, external production companies, and vendors to deliver high-quality, boundary-pushing content experiences Lead the planning and execution of live productions, including concerts, sports events, and special broadcasts, ensuring seamless technical and creative delivery Develop and implement workflows for live event capture, post-production, and distribution across Meta platforms Act as a key liaison between production, creative, product, business development, marketing, and legal teams to ensure seamless integration and distribution of content Communicate creative and technical needs, risks, gaps, and opportunities clearly and persuasively to both technical and non-technical stakeholders Influence and align key partners across Meta to support the content mission and operational needs Identify and implement opportunities to improve production processes, operational efficiency, and content quality by developing and sharing best practices, utilizing metrics, and incorporating cross-functional feedback Drive problem-solving and unblock teams and partners as needed, thriving in a time-sensitive, deadline-focused environment Maintain and grow relationships within the entertainment, music, sports, and film/TV industries to support content development and partnership opportunities Stay abreast of industry trends, emerging technologies, and gen pop shifts to inform content strategy and innovation",
    "minimum_qualifications": "12+ years of experience in content production, with a significant portion in a leadership role managing complex, multi-format content slates (including film/TV and live event production) 5+ years of experience managing and mentoring production teams in a deadline-focused environment Technical proficiency in production, including experience with stereoscopic 3D, immersive 180, and/or interactive content Proven track record of delivering high-quality, boundary-pushing content at scale, from concept through launch Analytic and imaginative problem-solving skills Bachelor’s Degree or equivalent experience Experience in both traditional and cutting-edge video production, drive for innovation, collaboration skills, and proven success delivering compelling consumer experiences at scale",
    "preferred_qualifications": "Background in film/TV, sports or music business, with active industry relationships Experience leading live productions for concerts, sports, or major broadcast events Understanding of the content industry, current market, and gen pop trends Experience collaborating with product, engineering, and platform teams to deliver integrated consumer experiences",
    "compensation": "$232,000/year to $298,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2204752920357512": {
    "title": "Detection & Response Security Engineer, Threat Intelligence",
    "URL": "https://www.metacareers.com/jobs/2204752920357512",
    "location": "Bellevue, WA • Menlo Park, CA • Washington, DC • New York, NY • Remote, US • Full Time + 4 more • Full Time - Hide",
    "responsibilities": "Influence and align the team’s vision and strategy. Collaboratively prioritize and deliver specific multi-year roadmaps and projects Build, cultivate, and maintain impactful relationships with intelligence stakeholders to identify and facilitate solutions to increase the impact of the team's work Refine operational metrics, key performance indicators, and service level objectives to measure Intelligence research and services Lead cross-functional projects to improve the security posture of Meta’s infrastructure, such as red team operations, surface detection coverage expansion and vulnerability management discussions Track threat clusters posing threats to Meta’s infrastructure and employees, and identify, develop and implement countermeasures on our corporate network Investigate, mitigate, and forecast emerging technical trends and communicate effectively with actionable suggestions to different types of audiences Work closely with incident responders to provide useful and timely intelligence to enrich ongoing investigations Improve the tooling of threat cluster tracking and intelligence data integration to existing systems",
    "minimum_qualifications": "8+ years threat intelligence experience B.S. or M.S. in Computer Science or related field, or equivalent experience Be a technical and process subject matter expert regarding Security Operations and Threat Intelligence services Experience developing and delivering information on threats, incidents and program status for leadership Expertise with campaign tracking techniques and converting tracking results to long term countermeasures Expertise with threat modeling frameworks, such as Diamond Model or/and MITRE ATT&CK framework Experience intelligence-driven hunting to spot suspicious activities in the network and identify potential risks Proven track record of managing and executing on short term and long term projects Ability to work with a team spanning multiple locations/time zones Ability to prioritize and execute tasks with minimal direction or oversight Ability to think critically and qualify assessments with solid communications skills Coding or scripting experience in one or more scripting languages such as Python or PHP",
    "preferred_qualifications": "Experience recruiting, building, and leading technical teams, including performance management Experience close collaborating with incident responders on incident investigations Experience in threat hunting including leveraging intelligence data to proactively identify and iteratively investigates suspicious behavior across networks and systems Familiarity with malware analysis or network traffic analysis Familiarity with nation-state, sophisticated criminal, or supply chain threats Familiarity with file-based or network-based rules and signatures for detection and tracking of complex threats, such as YARA or Snort Experience in one or more query languages such as SQL Experience authoring production code for threat intelligence tooling Experience conducting large scale data analysis Experience working across the broader security community",
    "compensation": "$177,000/year to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2335209993603506": {
    "title": "Research Scientist Intern, Imaging and Computer Vision (PhD)",
    "URL": "https://www.metacareers.com/jobs/2335209993603506",
    "location": "Sunnyvale, CA • Redmond, WA • Internship",
    "responsibilities": "Develop novel algorithms for image processing, computer vision, and multimodal data fusion. Design and prototype new architectures for real-time image and video processing in AR/VR systems. Develop machine learning models that interact efficiently with specialized imaging hardware, optimizing for performance, energy efficiency, and scalability. Perform image and video quality evaluations using both objective and subjective methods. Build new tools and workflows for evaluating and improving visual quality and computational efficiency of vision systems. Collaborate with hardware teams to co-design algorithms that leverage specialized accelerators or custom silicon for optimized performance. Conduct cutting-edge research to publish at top-tier conferences and workshops in imaging, computer vision, and machine learning. Communicate results and progress to both technical and non-technical stakeholders",
    "minimum_qualifications": "Currently has, or is in the process of obtaining, a PhD degree in Computer Science, Electrical Engineering, machine learning, computer vision or related field Experience in developing and implementing advanced algorithms for imaging, computer vision, or machine learning applications Experience in Python and/or MATLAB, and C++ Familiarity with machine learning frameworks such as PyTorch, TensorFlow, or other related tools Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Intent to return to degree-program after the completion of the internship/co-op Proven track record of achieving significant results, as demonstrated by first-authored publications at leading workshops or conferences in imaging, computer vision, or machine learning (e.g., CVPR, ICCV, ECCV, NeurIPS, ICML) Experience with designing computer vision algorithms optimized for specialized hardware such as GPUs, DSPs, or custom ASICs Strong understanding of image and video quality metrics and evaluation methodologies Experience with software-hardware co-design and developing models that interact with low-level system components Ability to design new tools for data processing, visualization, and performance evaluation Familiarity with state-of-the-art techniques in computational imaging, video compression, 3D reconstruction, or AR/VR applications Experience working and communicating cross functionally in a team environment",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2578176955882259": {
    "title": "Data Engineer, Analytics (University Grad)",
    "URL": "https://www.metacareers.com/jobs/2578176955882259",
    "location": "New York, NY • Full Time",
    "responsibilities": "Architect, implement and deploy new data models and data processes in production Perform data analysis to generate business insights Interface with Engineers, Product Managers and Product Analysts to understand product goals and data needs Build data expertise and own data quality for allocated areas of ownership Manage data warehouse plans for a product or a group of products Support critical data processes running in production",
    "minimum_qualifications": "Programming knowledge in Python or Java Knowledge of SQL Knowledge of database systems Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta",
    "preferred_qualifications": "Experience thriving in a fast-paced work environment Curious, self-driven, analytical and excited to play with data Experience in collaborating with individuals and organizations",
    "compensation": "$46.63/hour to $134,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3130961047064766": {
    "title": "Research Scientist Intern, Multimodal Contextual AI (PhD)",
    "URL": "https://www.metacareers.com/jobs/3130961047064766",
    "location": "Sunnyvale, CA • Redmond, WA • Internship",
    "responsibilities": "Build and characterize experimental HW+SW systems on AR devices and device prototypes Develop embedded firmware and software in RTOS and mobile operating systems, e.g. AOSP Collaborate with other researchers and engineers across various disciplines",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a PhD in Computer Science, Electrical Engineering, or a related field Programming and simulation experience with languages such as C/C++ and Python Experience with computer architecture and HW/SW co-design and co-optimization Must obtain work authorization in the country of employment at the time of hire, and maintain on-going work authorization during employment",
    "preferred_qualifications": "Experience in HW+SW system prototyping using embedded device prototypes and FPGAs Experience in operating systems, drivers, and embedded firmware development Experience working in a machine learning framework, e.g. PyTorch Experience working and communicating cross functionally in a team environment Demonstrated embedded software experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub) Intent to return to degree-program after the completion of the internship/co-op Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as CVPR, ECCV/ICCV, SIGGRAPH, or similar",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "4265549827104472": {
    "title": "Camera And Depth Electrical Engineer",
    "URL": "https://www.metacareers.com/jobs/4265549827104472",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Own electrical development of highly complex subsystems or moderately complex systems under the direction of a technical lead Design schematics, direct board layout, conduct design reviews and draft design documentations Conduct feasibility studies and analysis to evaluate new technologies and components. Propose innovative solutions to enhance product performance and features Manage bring up and debug, support manufacturing and assembly build Collaborate in a team environment and work across engineering disciplines to develop systems and manage trade offs across electronics, mechanics, optics, sensors, haptics, firmware and software Evaluate vendor reference design and transform these into custom solutions which meet product and form factor constraints Work in a distributed team environment Contribute to building and sustaining internal community through recruitment and mentorship Work autonomously and take initiative to manage individual and team priorities Travel both domestically and internationally",
    "minimum_qualifications": "Bachelor's degree in Electrical Engineering or related field 6+ years of experience in electrical engineering, hardware engineering or related experience Proficiency in electrical design software (e.g., Altium, Cadence) Understanding of and demonstrated experience in electrical design principles, circuit analysis, and electronics manufacturing processes Experience working with complex board designs PCB/FPC/RFPC (Printed Circuit Board/Flexible Printed Circuit/Rigid-Flex Printed Circuit) Experience working with one of these technologies: digital signal processing, real-time image processing, display engineering, camera modules, mobile SoC (System on Chip) and PMIC (Power Management Integrated Circuit) or Battery Management System Experience working with one of these technologies: use of oscilloscopes, high speed digital test equipment, logic analyzers, or function generators",
    "preferred_qualifications": "MS or PHD in Electrical Engineering or Computer Engineering Experience with designing the following electrical subsystems: power regulators, high speed digital signal integrity (MIPI CPHY and MIPI DPHY), SOC and micro-controllers, serial-communication protocols (I2C, I3C, SPI, and LVDS) Experience with customized Integrated Chip design or Sensor Chip design Experience using scripting languages like Matlab/Python/C++ for data analysis. Experience running firmware commands to drive prototype platforms Experience designing for HDI flexible and rigid substrates for high volume cost optimized applications Experience with camera or depth sensor or auto-focus electrical design Experience developing modules or systems in high volume consumer electronic products Experience partnering with software or firmware teams to define and verify HW design maturity across test cases Experience working with PCB, FATP, Joint Development Manufacturer (JDM), Original Design Manufacturer (ODM), Contract Manufacturer (CM), Module Integrator (MI) partners",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "24772600842382404": {
    "title": "Software Engineer, HW/SW Co-Design Engineer",
    "URL": "https://www.metacareers.com/jobs/24772600842382404",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Utilize extensive understanding of CPUs (x86/ARM) to identify key platform resource bottlenecks. Collaborate closely with software product teams to re-architect services, improve performance through algorithm redesign, reduce resource consumption, Develop representative benchmarks (in C++, Python, and/or Hack) to capture fleet requirements and drive early evaluation of upcoming platforms. Drive fleet-wide detailed workload analysis and keep ahead of evolving business needs and its impact to compute fleet Identify novel hardware/software co-design opportunities based on industry trends and new paradigms. Conduct pathfinding activities to quantify the value proposition for Meta and drive roadmap definition Influence vendor hardware roadmap and broader ecosystem to align with Meta's requirements Partner with Product Engineering and Infrastructure Engineering teams to find the optimal way to deliver the hardware roadmap into production and drive adoption",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta Experience with programming and scripting languages such as C, C++, Java, PHP, Python 5+ years of experience with hardware architecture, compute technologies and/or storage systems",
    "preferred_qualifications": "Master’s degree or PhD in Computer Science, or a related technical field Demonstrated Architectural understanding of CPU, Memory subsystems, Accelerators, Networking, Flash and/or HDD Storage systems Experience with large-scale infrastructure, distributed systems, full stack analysis of server applications",
    "compensation": "$70.67/hour to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "24987492994238898": {
    "title": "Software Engineering, SW Specialist",
    "URL": "https://www.metacareers.com/jobs/24987492994238898",
    "location": "Los Angeles, CA • New York, NY • Full Time",
    "responsibilities": "Architect efficient and reusable systems that drive complex realtime interactive software Build technologies that empower developers to create compelling experiences Optimize and debug real-time systems to ensure smooth performance Influence design, drive engineering implementation and enhance the quality of new and existing technology Lead collaboration with multi-functional teams to achieve successful product outcomes Utilize your specialized expertise to mentor, educate and up level engineers you collaborate with across teams",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 7+ years software development experience in industry settings or PhD with 4+ years of experience 3+ years developing features within 3D real-time interactive software in industry settings Experience with systems programming languages such as C++, Rust, or similar languages Proven problem-solving skills and experience working independently and collaboratively Effective communication and interpersonal skills",
    "preferred_qualifications": "Experience in shipping products to millions of customers or have started a new line of product Experience with Unity 3D or Unreal Experience in UX design or game design",
    "compensation": "$85.10/hour to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}