{
  "656064080423668": {
    "title": "Mechanicals Program Manager",
    "URL": "https://www.metacareers.com/jobs/656064080423668",
    "location": "Sunnyvale, CA • Seattle, WA • Full Time",
    "responsibilities": "Drive day-to-day tooling, molding and secondary operation activities to meet the overall program objectives with a heavy focus on plastic/metal tooling release, tooling trial schedule oversight, post molding CNC and coating operations including assembly and testing Create and maintain program schedules, track program progress, risk identification and mitigation, prioritization of work tasks for the Mechanical Operations team Assist in directing internal and external resources to execute programs successfully Collaborate with engineering, operations, and our supply base partners to meet schedule, quality and volume targets Work with cross functional partner teams to drive engineering build and mass-production readiness for Mechanical Components Help to drive Failure Analysis Corrective Action and yield improvements International travel up to 20%",
    "minimum_qualifications": "Minimum of 8 years of experience in manufacturing of mechanical components in the Plastics Molding and Tooling industry Minimum of 5 years of project management experience Experience in launching high cosmetic, consumer electronics products Experience working with a global supply chain and a background in project coordination with Asia-based manufacturers, remotely and onsite Working knowledge of GD&T, data analysis and statistics Proven bottom line project management experience (Planning, Cost, & Delivery) Demonstrated experience to operate in ambiguous, deadline focused environment with minimal supervision",
    "preferred_qualifications": "Experience with root cause analysis of plastic and metal part defects Data analysis using JMP PMP Certification Proven experience with insert molding, 2 shot molding, MIM, stamping and die-casting Working knowledge of plastic resins, metal removal processes and post molding operations, coatings, sub-assembly and testing",
    "compensation": "$134,000/year to $196,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "803681775701053": {
    "title": "Research Scientist Intern, Multimodal Eye Tracking Algorithms (PhD)",
    "URL": "https://www.metacareers.com/jobs/803681775701053",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Participate in cutting-edge Computer Vision & Machine Learning research and development for VR/AR/MR related topics Collaborate with and support other researchers across various disciplines. Design and implement robust algorithms for multimodal eye-tracking systems Communicate research agenda, progress and results Publish research results in top-tier journals and at leading international conferences Document and present research progress and aim to publish findings at high-impact CV/ML conferences",
    "minimum_qualifications": "Currently has, or is in the process of obtaining, a PhD in Computer Science, Computer Vision, Machine Learning, or related field Knowledge in CV/ML, in one or more of the following domains: 3D computer vision, object detection and tracking, image/volume processing, optimization, calibration, 3D tracking, 3D pose estimation 2+ years of experience with Machine Learning for solving computer vision and/or computer graphics problems Experience with deep learning frameworks such as Pytorch and TensorBoard Experience with scientific programming languages such as Python Excellent interpersonal skills, cross-group and cross-culture collaboration Ability to communicate complex research in a clear, precise, and actionable manner Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Proven track record of achieving significant results as demonstrated by publications in top CV/ML conferences (e.g., CVPR, ICCV, ECCV, ICML etc.) or journals Demonstrated software engineering experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub) Experience working on high volume image data processing or synthesis Experience with one or more of the following: simultaneous localization and mapping (SLAM), sensor fusion, volumetric imaging Hands-on experience working with research grade lab prototypes to set up experiments, collect, and analyze data to validate hypotheses Broad, end-to-end understanding of all aspects of tracking objects in 3D space (i.e. hardware, firmware, software, algorithm, analysis, evaluation) Experience with basic optical systems, with an emphasis on the optics of the human eye Intent to return to a degree-program after the completion of the internship",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1092604736031865": {
    "title": "Enterprise Products, Release Manager",
    "URL": "https://www.metacareers.com/jobs/1092604736031865",
    "location": "New York, NY • Full Time",
    "responsibilities": "Manage product validation (User Acceptance Testing, Release Readiness Dogfooding) and post-launch support (Hypercare) Collaborate with engineering, product, and QA teams to develop and implement release strategies Manage critical product launches, financial close processes, server patches, and high-volume visible programs Ensure adherence to standards and governance set by EP for product releases Utilize release management tools and dashboards to track issues and bugs. Supporting Engineering with Sev. and UBN mitigation Lead change initiatives by designing, developing, and delivering change strategies and plans to work with the business to support consumers of the product Assess organizational readiness and stakeholder impacts to highlight adoptions risks, issues, dependencies and end-user reception of the product Develop and execute communications, training, and change management plans Build effective partnerships with internal and external stakeholders to drive adoption of EP Products Engage, advise, and inform key stakeholders at all levels Manage relationships with both technical and non-technical audiences Plan, prepare, and deliver key messages and supporting content to enable swift adoption of products",
    "minimum_qualifications": "Proven experience as a Release Manager, Change Manager, Program Manager or in a similar enterprise role Bachelor’s Degree and 5+ years of experience leading release and/or change initiatives Proficient understanding of software development lifecycle, agile methodologies, and change management frameworks (e.g., Prosci ADKAR) Experience with managing complex projects with numerous stakeholders Evidenced success with communication skills across numerous stakeholders Experience with release management and change management tools Experience working with all levels across an organization",
    "preferred_qualifications": "Leadership: Lead and motivate cross-functional teams in a dynamic environment Analytical Skills: Experience with risk assessment, resource optimization, and data-driven decision making Attention to Detail: Meticulous management of all elements of release and change processes Adaptability: Flexibility to manage changing priorities and tight deadlines Stakeholder Management: Experience building effective partnerships and driving adoption Experience managing multiple simultaneous initiatives on an enterprise scale Familiarity with communications planning, training development, and resistance management",
    "compensation": "$129,000/year to $185,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1146919463598484": {
    "title": "ASIC Engineer, Design Verification (University Grad)",
    "URL": "https://www.metacareers.com/jobs/1146919463598484",
    "location": "Sunnyvale, CA • Austin, TX • Full Time",
    "responsibilities": "Define and implement IP/SoC verification plans, build verification test benches to enable IP/sub-system/SoC level verification Drive design verification to closure based on defined verification metrics on test plan, functional and code coverage Debug, root cause and resolve functional failures in the design, partnering with the design team Collaborate with cross functional teams like Design, Model, Emulation and Silicon validation teams towards ensuring highest design quality",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta Knowledge of Verilog, VHDL or similar hardware description language Knowledge of Computer Architecture, Logic Design fundamentals, object oriented programming concepts Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Currently has, or is in the process of obtaining, a Master’s degree in Electrical Engineering, Computer Engineering, Computer Science or similar technical field Scripting experience with Python or Perl Knowledge in object oriented programming/UVM based verification environments Knowledge in CPU architectures like ARM/RISC-V",
    "compensation": "$114,000/year to $133,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1296282138059904": {
    "title": "Manufacturing Design Engineer - Mechanical",
    "URL": "https://www.metacareers.com/jobs/1296282138059904",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Work with design teams to understand design intent, provide input and suggestions accounting for manufacturability and process capability Provide thorough Design for Manufacturability assessments to anticipate issues, manage risks and influence designs at the early stages Work with Strategic Sourcing Managers to establish an optimal supply chain to manufacture Meta's products Develop industry leading processes to meet Meta's design, cost and quality requirements Work closely with suppliers to develop processes, troubleshoot issues, document and control critical parameters and scale production to meet all of Meta's requirements Design experiments, lead studies to collect the necessary data needed to drive decisions related to design, process, cost and supplier selection Travel up to 25% to supplier sites",
    "minimum_qualifications": "Bachelor’s degree in mechanical engineering, industrial engineering, or equivalent practical experience 7+ years of manufacturing or process development experience Experience with 1 or more of the following process areas: assembly, lamination, automation, CNC machining, blasting, polishing, laser processing, 3D printing, plastic injection molding, stamping, forging, softgoods and related manufacturing processes",
    "preferred_qualifications": "Experience manufacturing highly cosmetic, consumer electronics parts Extensive experience with assembly including electro-mechanical components Demonstrate hands-on experience with detailed failure analysis and troubleshooting skills Experience working with Asia-based contract manufacturers Experience working with high-volume consumer electronic products Experience developing supplier or equipment capabilities",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1307315947224407": {
    "title": "Finance Associate, Wearables",
    "URL": "https://www.metacareers.com/jobs/1307315947224407",
    "location": "Sunnyvale, CA • Burlingame, CA • Full Time",
    "responsibilities": "Manage all FP&A activities related to Wearables products that are in-market or launching next year for Cost of Goods Sold items for a growing portfolio including budgeting, forecasting and long-range planning Provide hands-on analytical support and develop actionable insights throughout the planning cycles and in monthly reviews, as well as for setting cost targets for new programs Understand, impact, and influence business investment decisions through detailed financial analysis Drive critical cost savings opportunities and long-term strategic implications of agreements Own ad hoc strategic and operational projects as required, and drive process and system improvements by partnering with cross functional owners Develop and enforce best practices and policies to manage these costs Lead data-driven decision making & analysis of product decisions and strategic roadmap investments Create business partnerships with various functions across the Reality Labs (RL) Provide insights to business partners through variance analysis, scenario based modeling and other analytical support as needed",
    "minimum_qualifications": "4+ years of financial analysis experience Bachelor's degree in Finance, Economics or equivalent Experience with FP&A activities especially around monthly close, forecast, annual and long-range planning processes Experience in financial modeling utilizing Excel, and PowerPoint and G-suite Experience developing analytical frameworks and communicating financial concepts to leadership Experience leading cross-functional projects with stakeholders, including product, accounting and operations teams Experience influencing leadership, thriving in ambiguity and managing multiple high priority projects in a fast paced environment",
    "preferred_qualifications": "Hardware Financial Modeling experience, with an understanding of consumer electronics manufacturing operations and costs MBA Experience with EPM, Hyperion and Essbase tools",
    "compensation": "$92,000/year to $135,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1321895439649970": {
    "title": "Operations Program Manager",
    "URL": "https://www.metacareers.com/jobs/1321895439649970",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Manage cross-functional execution of high-priority mass production initiatives for cutting-edge consumer electronics devices by integrating plans and communicating risk & status clearly and succinctly to management, calling out key issues and presenting options for resolution to Leadership Establish and lead on-site bring-up and integration activities, coordinating with both internal and external resources Drive supplier readiness activities to execute development builds leading up to ramp, development of process qualifications plans, and defining capacity and capex requirements, clearly identifying deliverables and dependencies Assesses, analyzes, consolidates, and communicates risk and status clearly and succinctly to management, calling out key issues and presenting options for resolution to the cross-functional executive team through the new product reviews and other executive forums Lead the tactical execution of go-to-market initiatives for our products by working closely with key cross-functional teams. Bring point of view to the team, informing and guiding decisions related to these initiatives Liaise across cross-functional teams to ensure product cost, manufacturability, reliability, product quality, and safety & compliance performance goals are met Drive Operations team towards factory readiness with manufacturing partners to support MP (line layout, automation, capacity, CapEx) Work with Product Cost Engineers to track and drive product cost targets throughout MP",
    "minimum_qualifications": "BS or higher in Business, Engineering, Supply Chain/Operations discipline or equivalent experience 5+ years' experience in an Operations-focused Program Management role for a Consumer Electronics device Proven problem solving and analytical skills, including advanced skills in Excel Knowledge of product features/specifications, manufacturing processes and the supply chain for consumer electronics products Experience working with and managing external suppliers and manufacturers Proven project management experience, including cross-functional stakeholder management Proven communication skills Experience navigating ambiguity in a fast-paced environment and prioritize multiple and competing work threads to maximizing impact",
    "preferred_qualifications": "Masters degree (e.g. MBA, Engineering, or other relevant field) with experience in management consulting, strategy, business operations, corporate strategy or similar discipline 7+ years' experience in an Operations-focused Program Management role for a Consumer Electronics device Experience leading development/delivery of multiple high-volume products Experience managing JDM’s with different models of engagement",
    "compensation": "$134,000/year to $196,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1322259479352002": {
    "title": "Digital Design Engineer",
    "URL": "https://www.metacareers.com/jobs/1322259479352002",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Responsible for top-level or block level µArchitecture definition and RTL implementation Contribute to chip-level integration, verification plan development and verification Define timing constraints, run synthesis and static timing analysis Support the test program development, chip validation and chip life until production maturity Work with FPGA/Emulation engineers to perform early prototyping Support hand-off and integration of blocks into larger SOC environments",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta 2+ years of experience as a Digital Design Engineer Experience in RTL coding, synthesis and/or SoC Integration Experience in digital design Micro-architecture Experience with at least 1 procedural programming language C, C++, Python, etc",
    "preferred_qualifications": "Master's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Experience with low power design and optimization to help meet the power requirements Experience in digital design Micro-architecture, SoC integration, ASIC architecture and graphics accelerators Experience in RTL implementation of Computer Graphics IP Experience with design synthesis and timing optimization",
    "compensation": "$114,000/year to $166,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}