{
  "688486867627172": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/688486867627172",
    "location": "New York, NY • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions. Work independently, use available resources to get unblocked, and complete tasks on schedule by exercising strong judgment and problem solving skills. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Requires a Master’s degree (or foreign equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field Requires a university-level course, research project or internship in the following: Coding in at least one of the following industry-standard languages: C++, Java, or Kotlin Building large-scale applications Relational databases SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, CSS and Building Android applications using Kotlin or Java",
    "preferred_qualifications": "",
    "compensation": "$143,406/year to $158,400/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1180308843976271": {
    "title": "Product Quality Engineer",
    "URL": "https://www.metacareers.com/jobs/1180308843976271",
    "location": "Austin, TX • Full Time",
    "responsibilities": "Develop holistic manufacturing process flow, line layout, FA process flow, repair and rework process flow, headcount, and machine quantity during New Product Introduction (NPI) builds Collaborate with cross-functional team to drive SMT and FATP Equipment & Fixture schedule and line readiness Manage Major Issue List and facilitate technical discussion to resolve open issues, driving FACA to meet yield targets Drive line cost savings through Capex & MVA reduction by utilizing yield bridge, UPH and OEE optimization Drive development and implementation of repair and rework process flows International travel to supplier sites, up to 25%",
    "minimum_qualifications": "BS or higher in Business, Engineering, Supply Chain/Operations discipline or equivalent experience Proven program/project management experience from NPI to high-volume MP Experience working with international contract manufacturers Background in process development, bring-up, and qualification, including Final Assembly, Test, Packout, and SMT processes Knowledge of Design of Experiments and analytical problem-solving approaches Cross-functional collaboration skills Concise and clear communication",
    "preferred_qualifications": "Demonstrated expertise in identifying, analyzing, and resolving complex technical issues within the hyperscaler manufacturing environment",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1315594233647855": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1315594233647855",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field Requires university-level coursework, research project or internship involving the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases SQL and Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$184,187/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1343339110782394": {
    "title": "Product Quality Engineer",
    "URL": "https://www.metacareers.com/jobs/1343339110782394",
    "location": "Austin, TX • Full Time",
    "responsibilities": "Drive product development activities for GPU server products throughout the product lifecycle (NPI to mass production) Develop test plans, and quality control processes for server hardware Analyze manufacturing and field data to identify trends, root causes, and corrective actions for quality issues Collaborate with design, sourcing and supplier teams to resolve technical issues and improve product quality Lead failure analysis investigations and drive continuous improvement initiatives Define and track key quality metrics Support supplier quality engineering and manage quality escalations with vendors",
    "minimum_qualifications": "Bachelor’s degree in Electrical Engineering, Mechanical Engineering, Computer Engineering, or related field 3+ years of experience in hardware quality engineering, preferably with server or data center hardware Understanding of GPU / CPU architectures, server systems, and hardware validation methodologies Familiarity with manufacturing processes, supplier management, and testing Problem-solving, communication, and cross-functional collaboration skills",
    "preferred_qualifications": "Experience with large-scale data center deployments or hyperscale server environments Prior experience working with GPU vendors and ODMs",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}