{
  "673811469130772": {
    "title": "Research Scientist Intern, Audio, Numerical Acoustics (PhD)",
    "URL": "https://www.metacareers.com/jobs/673811469130772",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Design, document, implement, integrate, and optimize novel algorithms to solve audio research problems Experimental design, implementation, and execution to evaluate new audio technologies Collaboration with and support of other researchers across audio and acoustic engineering disciplines Collaborate with other software engineers in the team to seamlessly integrate, solve, or optimize research and/or algorithms Communication of research agenda, progress, and results",
    "minimum_qualifications": "1+ years experience working with wave phenomena, acoustic simulation techniques, numerical modeling, applied numerical mathematics, physics-based modeling, or AI/deep learning applied to numerical methods Coding experience in one or more languages, including but not limited to: C/C++ (≥ v.11), CUDA C/C++, MPI, OpenMP, Python, or MATLAB Expertise in one or more of the below research areas: Numerical Simulation of Acoustics such as Raytracing and/or Wave-based modeling techniques, Spatial Rendering, Vibroacoustics, Verification and Validation (V&V) of mathematical models, augmenting numerical modeling with machine learning / deep learning techniques Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment Currently has, or is in the process of obtaining a PhD degree in the field of Acoustics, Computer Science, Mechanical Engineering, Electrical Engineering or related STEM fields",
    "preferred_qualifications": "Strong mathematical fundamentals, including linear algebra, computational physics, numerical methods, statistical analysis, computer graphics Experience with parallel computing, algorithm design, data structures, and/or large-scale data/compute systems Demonstrated experience with physical modeling (particularly in the context of waves and acoustics) with a strong, intuitive understanding of core physics concepts—including the physical interpretation of mathematical operators and the ability to connect mathematical formulations to real-world phenomena Proven experience with psychoacoustics, deep learning techniques, and/or DSP fundamentals Proven track record of achieving results as demonstrated in accepted papers in top conferences or journals such as DAFx, WASPAA, Journal of Computational Acoustics, JASA, JAES, Journal of Computational Physics, ICASSP, etc Experience working and communicating cross functionally in a team environment Intent to return to a degree-program after the completion of the internship/co-op",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "846283681303293": {
    "title": "Display Optical Engineer",
    "URL": "https://www.metacareers.com/jobs/846283681303293",
    "location": "Sunnyvale, CA • Redmond, WA • Full Time",
    "responsibilities": "Explore architectures and design spaces for optical systems through design and prototyping using novel and conventional techniques and components Develop and analyze system and subsystem components that are specified to meet the needs of advanced AR products Perform detailed system level analysis (i.e. optical modeling, tolerancing, and estimating size, weight, power to predict system performance etc.) Contribute to the process of design releases, prototyping and creation of related documentation Collaborate with internal teams for adoption of mature technologies",
    "minimum_qualifications": "Bachelors or Masters degree in the field of Optics, Optical Sciences, Optical Engineering, Physics, Electrical Engineering, Computer Sciences or a similar field, and/or equivalent work experience 2+ years of experience in applied research and/or product development 2+ years of experience with optical systems or similar Experience maturing optical systems from proof-of-concept to early low volume prototype or production Experience in scripting and/or system optimization and analysis tools Knowledge of optical design, modeling methods, and tools for imaging and illumination systems as well as tolerance analysis Experience working, communicating, and collaborating in a cross-functional environment",
    "preferred_qualifications": "Advanced degree in the field of Display Engineering, Optical engineering, Optics, Physics, Optics, or a relevant technical field Experience in driving execution of display engineering builds Experience in verifying and validating display performance, driving failure analysis of display/optical performance gap across display supply chain and driving corrective actions to improve performance and customer experience Experience with cross functional communication with both internal and external facing vendors including facilitating discussions in factories Optic Design: education in optic design simulation, tolerancing, and stray light modeling of display module or system Tools: Proficient in one or more simulation and analysis tools, such as ZEMAX, TracePro, Lighttools, CodeV, statistical tools JMP, Matlab, or similar programs Experience in image quality analysis and metric development Experience in bringing up first generation technologies into device form factors Experience with multiple full life cycle AR/VR product launches Experience with end to end display module development, from components to system and balancing the performance and cost 6-sigma experience (Green Belt or Black Belt) Optic Design: Experience in optic design simulation, tolerancing, and stray light modeling of display module or system Production Experience: Successful track record of delivering display modules or display systems into mass production Machine learning and AI experience: Experience of applying ML and AI to optical applications",
    "compensation": "$111,000/year to $164,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "852318853795958": {
    "title": "Program Manager, Integrity GRC",
    "URL": "https://www.metacareers.com/jobs/852318853795958",
    "location": "New York, NY • Full Time",
    "responsibilities": "Lead Risk Assessment Activities: Proactively identify, assess, and mitigate compliance and integrity risks across Meta’s platforms, including conducting statutory risk assessments Support Regulatory Audit Readiness: Manage audit readiness activities and coordinate responses to regulatory audits and requests for information, ensuring Meta’s compliance posture is well-documented and defensible Draft, Edit, and Review Regulatory Reports: Prepare, edit, and review regulatory and compliance reports, ensuring clarity, accuracy, and alignment with internal standards and external requirements. Maintain submission-ready documentation Monitor and Interpret Regulatory Changes: Maintain an understanding of the evolving global regulatory landscape impacting Meta’s Integrity functions, and translate regulatory changes into actionable project work and risk management deliverables Serve as Integrity GRC Subject Matter Expert: Act as a key connection point between Integrity Risk Management, Legal, Regulatory Offices, and business teams, providing guidance on risk management matters Drive Cross-Functional Collaboration: Build and maintain relationships with global stakeholders across Integrity, Legal, and business teams to ensure alignment and execution of compliance and risk management activities Ensure Regulatory and Policy Adherence: Ensure all activities and documentation adhere to internal standards and regulatory requirements, supporting Meta’s capacity to maintain legal and regulatory compliance Communicate Risk and Compliance Status: Establish streamlined communication models to provide regular updates, status reports, and feedback requests to stakeholders, ensuring transparency and cross-functional alignment Identify and Address Gaps: Identify gaps in strategy, systems, or processes related to risk management, and work with relevant teams to implement improvements Support Business Travel: Travel as needed (up to 10%) to support regulatory or risk management activities",
    "minimum_qualifications": "7+ years in risk management, compliance, or integrity roles within large, complex, or regulated organizations Experience in risk assessment to identify, evaluate, and mitigate compliance and integrity risks Knowledge of global regulatory frameworks relevant to technology, social media, or digital platforms Demonstrated experience working across legal, regulatory, and business teams Demonstrated communication skills, with experience presenting risk management topics to leadership and regulators Demonstrated ability to prepare, edit, and review reports, including regulatory, risk, and compliance documentation Program/project management experience, including prioritizing deliverables and driving cross-functional alignment Track record of process improvement, identifying and addressing gaps in risk management strategy, systems, or processes",
    "preferred_qualifications": "Relevant Professional Certifications: - Certified Information Systems Auditor (CISA) - Certified in Risk and Information Systems Control (CRISC) - Certified Compliance & Ethics Professional (CCEP) - Certified Internal Auditor (CIA) - Certified Information Privacy Professional (CIPP) - Artificial Intelligence Governance Professional (AIGP) – IAPP - Other recognized certifications in risk management, compliance, privacy, or audit Master’s degree in Business, Law, Risk Management, Public Policy, or a related field Experience working with international regulatory bodies or in a global business environment, especially in technology, social media, or digital platforms Familiarity with risk management and compliance tools, data analytics, reporting systems, and AI governance frameworks",
    "compensation": "$146,000/year to $203,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1365714305076405": {
    "title": "GTC Planning, Head of Channel Enablement Program Management",
    "URL": "https://www.metacareers.com/jobs/1365714305076405",
    "location": "Seattle, WA • Burlingame, CA • Full Time",
    "responsibilities": "Team Leadership: Lead team responsible for program managing the development & delivery of global channel experience initiatives including fixture design, merchandising, demo technology, and training for key NPI and seasonal refresh moments. Lead operational and strategic planning, ensuring programs are aligned with business goals and delivered on time and within scope Strategic Initiatives: Own direct program management of high-impact strategic initiatives in partnership with the Channel Experiences leader, acting as a trusted thought partner and planning & execution readiness lead Project Planning Oversight: Create & oversee detailed project plans outlining all tasks, timelines, and dependency requirements at the right altitude. Monitor / track progress against goals and make adjustments as needed. Hold teams accountable. Establish and evolve frameworks, tools, and processes that enable scalable, repeatable, and high-quality delivery of channel experiences worldwide Stakeholder Alignment: Bring the right people together at the right moments to have the right conversations to build robust channel experience strategy & plans in prep for channel sales execution. Develop & provide an objective viewpoint based on an in-depth understanding of the business & desired outcomes Dependency Tracking & Risk Management: Identify critical interdependencies across Global Sales & cross-functional partners to support initiatives. Proactively assess risks and roadblocks and develop mitigation plans to maintain momentum Ensure project quality: Oversee the quality of program management to ensure performance optimization Best Practices: Develop, document, and drive awareness of scalable processes and global best practices. Standardize processes to improve scalability",
    "minimum_qualifications": "10+ years of experience in sales operations, sales management, strategic planning, business operations, consulting, or a related field 2+ years of experience people management, influencing and coaching skills, with experience leading cross-functional teams Experience leading strategy, operations, process improvement, and tactical projects. Experience solving complex business problems (commercial, operational, organizational) and driving projects from strategy to execution Leadership and influencing skills – experience leading/influencing stakeholders at all levels of an organization Experience working cross-functionally with Results and detail oriented, with commercial/business acumen Experience shifting priorities, balancing multiple initiatives at once, and maintaining organization leadership in developing and executing successful plans in an environment of fast growth and ambiguity Demonstrated communication and presentation skills with an emphasis on translating insights and data into actionable recommendations for leaders",
    "preferred_qualifications": "",
    "compensation": "$152,000/year to $214,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1718936445463332": {
    "title": "Product Quality Engineer, Networking",
    "URL": "https://www.metacareers.com/jobs/1718936445463332",
    "location": "Fremont, CA • Full Time",
    "responsibilities": "Develop and implement manufacturing processes for Meta open network hardware technologies by applying knowledge of product design, fabrication, assembly and testing Ensure product and process quality targets are met by designing test methods, establishing standards and driving continuous improvement projects with Meta manufacturing partners and key commodity suppliers Drive root cause and corrective action for failures that occur during server integration, rack production and in the Data Center Early engagement with Meta Engineering teams to implement robust DFx requirements and ensure products meet cycle-time, cost, quality and yield targets Create and maintain all production process and quality documentation Conduct First Article and Source Inspections reviews on Meta hardware components and assemblies Create BOMs, engineering change notifications, and manufacturing process changes through product lifecycle management tools International travel may be required",
    "minimum_qualifications": "BS, Electrical or Computer Science, or equivalent 7+ years experience in manufacturing and test for Network Hardware products Familiar with manufacturing test solutions for network hardware products Knowledge of quality methodologies and tools is required Proven problem solving and communication skills Scripting skills in Bash, Perl, or Python is desirable",
    "preferred_qualifications": "Experience in Network Hardware technologies (routing, switching, transport and optics)",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1833406347371013": {
    "title": "Silicon Validation Engineer, Reality Labs",
    "URL": "https://www.metacareers.com/jobs/1833406347371013",
    "location": "Sunnyvale, CA • Redmond, WA • Austin, TX • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Responsible for System on Chip and end-to-end system validation plan development, execution and sign-off Identify and communicate technical risks related to the project to the stakeholders Plan, organize, and participate in silicon bring-up and validation activities across multiple Systems on Chips Understand system Hardware, Software, Firmware component as a whole and drives test execution and debug with cross functional/PnP teams Collaborate with the team for lab debug, silicon bug repro, failure analysis, and failure report activities Work with cross-functional teams (i.e., architecture, Intellectual Property, Firmware, Electrical Engineering, System on Chip, and product engineer teams) to generate validation reports for SoC and systems Work in an agile environment, changing roadmaps and adapt to validation plans based on changes",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 6+ years of hands-on experience in bring-up, debug, and validation of complex Systems on Chips 2+ years of experience in high-speed protocols (i.e., MIPI, PCIe, USB, DDR) and hands-on experience in high-speed IO bring-up 2+ years of experience in silicon validation planning, execution, validation Firmware development, and validation sign-off 2+ years of experience using lab equipment, such as scopes, BERTs, protocol analyzers, JTAG debuggers, etc Expertise with building silicon validation infrastructure and test automation, in highly cross-functional environments - across multiple team sites Experience influencing design, Design Verification and post-silicon validation teams to optimize the usage of pre-silicon prototype platforms",
    "preferred_qualifications": "Experience with building silicon validation infrastructure and test automation 2+ years of experience working in a cross functional and cross site team environment Knowledge and experience in pre-silicon validation platforms (i.e., FPGA and emulation) Knowledge of ASIC design flow, silicon foundry test flow, and silicon Firmware development process",
    "compensation": "$142,000/year to $203,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2145570816278663": {
    "title": "Research Scientist Intern, Code LLM & Agents (PhD)",
    "URL": "https://www.metacareers.com/jobs/2145570816278663",
    "location": "Menlo Park, CA • Seattle, WA • New York, NY • Internship + 2 more • Internship - Hide",
    "responsibilities": "Perform research to advance the science and technology of intelligent machines. Develop novel methods and systems to advance the state of the art in agentic models. Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results.",
    "minimum_qualifications": "Currently is in the process of obtaining a PhD degree in Computer Science, Artificial Intelligence, Machine Learning, Statistics, or relevant technical field Experience with agent modeling, reinforcement learning, code generation, computational world modeling, language modeling, planning, agentic scaffolds, memory systems, or related areas, as demonstrated by publications, coursework, blog posts, prior internships, and other relevant contributions Experience with Python and deep learning frameworks such as Pytorch or Tensorflow, as demonstrated by course projects, open source releases, or similar venues Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Intent to return to a degree program after the completion of the internship Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as NeurIPS, CVPR, ICCV, ECCV, ICLR, ICML, ACL, NAACL, EMNLP, or similar Experience with interpreting deep neural networks mechanistically, correlating their observable behavior with properties of model parameters and activations Demonstrated software engineering experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub) Experience working and communicating cross functionally in a team environment",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "24883304207957783": {
    "title": "Production Systems Engineer",
    "URL": "https://www.metacareers.com/jobs/24883304207957783",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Drive labs participation in program design, test, phase exit, and retrospective efforts Complex, open-ended troubleshooting and diagnostics for new hardware platforms Troubleshoot, repair, document, and provide feedback for Linux-based data center hardware platforms Work closely with remote hardware design and validation teams, and vendors to deploy and manage new server, storage, and networking products in the data center infrastructure Test and troubleshoot new hardware products and components with minimal documentation and direction Manage full lifecycle for lab hardware assets from provisioning through decommissioning Identify, characterize, and root cause hardware failures and error conditions Collaborate with hardware teams by running small scale experiments, collecting data, and providing feedback on failure symptoms for lab and production servers Drive cross-functional coordination & communication with other data center operations teams Lead efforts to deliver operational and serviceability feedback on new hardware platforms Serve as a local point of contact and subject matter expert regarding Lab activities and new hardware to operations staff Maintain an efficient, orderly hardware test lab operation within the production data center",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta Experience communicating across multiple groups and types of work Experience influencing cross functional teams Experience managing technical projects with a high degree of ambiguity 2+ years experience in one or more of the following core areas: Capacity Planning, Networking, Project Management, Tooling and Automation, Hardware Design, Systems Administration, Hardware Validation (NPI), or Data Center Operations 2+ years of experience managing servers in a large-scale distributed environment",
    "preferred_qualifications": "Hardware Debug Experience",
    "compensation": "$104,000/year to $155,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}