{
  "859680919920616": {
    "title": "Wearable Display Systems Opto-ME Lead",
    "URL": "https://www.metacareers.com/jobs/859680919920616",
    "location": "Sunnyvale, CA • Bellevue, WA • Redmond, WA • Menlo Park, CA • Burlingame, CA • Seattle, WA • Full Time + 5 more • Full Time - Hide",
    "responsibilities": "Work across the full product development cycle to drive mechanical component/subsystem designs from concept to production, including softgoods and sensor system development Manage supplier strategy for prototypes and production of parts Lead the resolution of design, prototyping and manufacturing issues during the development phase Communicate and resolve manufacturing and prototyping challenges​ in concert with the full program schedule Partner with a cross-functional team of engineers and researchers Work with first and third party partners to advance TRL of component technology Occasional domestic and international travel may be a requirement for this position",
    "minimum_qualifications": "Bachelors in Mechanical Engineering or equivalent experience 8 + years of experience developing high-volume consumer products with stringent SWAP-C constraints in such as wearables, mobile devices, or similar 8 + years experience in 3D CAD modeling (NX or similar) Experience working cross functionally to rapidly prototyping new concepts Experience designing for CNC, injection molding, die cutting, lamination, softgoods development Experience managing component vendors Experience planning and executing DOEs",
    "preferred_qualifications": "Experience working on mechanical design and productization of augmented reality (AR) or virtual reality (VR) display systems Working knowledge of optical principles, including geometric optics, wave optics, optical components, adhesives, etc Working knowledge of industry-standard optical design and testing tools, such as Zemax, CodeV, FRED, or similar Hands-on experience with mechanical simulation tools, such as ANSYS or Abaqus, with working knowledge of material behaviors including polymers, adhesives, and brittle materials Knowledge of image processing and optical-display metrics, such as MTF, contrast, luminance, uniformity etc Familiar with data processing and analysis tools like Matlab, Python, VS Code, JMP, C++, etc Experience working with offshore Contract Manufacturers in delivering consumer electronics products in mass production Demonstrated communication and collaboration skills, with past experiences of working effectively with cross-functional teams and driving convergence Experiences of establishing best practices across programs for the internal and external mechanical community, driving efficiency and product improvement",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1372651317805033": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/1372651317805033",
    "location": "Burlingame, CA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run Facebook. Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebook's products create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Bachelor’s degree (or foreign equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field Requires completion of a university-level course, research project, or internship involving the following: Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) C, C++, C#, or Java Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Distributed systems including sharding, consistency, and availability Algorithms",
    "preferred_qualifications": "",
    "compensation": "$185,644/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1558743918628826": {
    "title": "Lab Operations Program Manager-Robotics",
    "URL": "https://www.metacareers.com/jobs/1558743918628826",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Plan and execute lab space bring-up, including requirements gathering, scheduling, and risk management Develop and manage budgets for lab operations and new space initiatives Implement and improve asset logistics tracking processes Coordinate cross-functional teams to ensure lab readiness and compliance Identify and mitigate operational risks to support rapid prototyping and testing",
    "minimum_qualifications": "Bachelor's degree or equivalent experience in Engineering, Science, or a related field 5+ years of technical project/program management experience Experience in lab operations, space planning, and risk mitigation Experience with organizational skills, budgeting, and communication Experience with asset management and logistics tracking",
    "preferred_qualifications": "Masters degree or equivalent experience in Engineering, Science, or a related field Experience navigating early-stage, highly ambiguous initiatives Experience working in a highly collaborative, cross-functional environment while communicating complex concepts clearly and succinctly Experience optimizing design of existing products or devices",
    "compensation": "$142,000/year to $202,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1769530577013070": {
    "title": "Network Engineer, Operations & Support",
    "URL": "https://www.metacareers.com/jobs/1769530577013070",
    "location": "Denver, CO • Ashburn, VA • Newton County, GA • Forest City, NC • Fort Worth, TX • Fremont, CA • Full Time + 5 more • Full Time - Hide",
    "responsibilities": "Incident Response: Drive work investigating complex technical and process issues on a global scale spanning multiple reliability, security, and continuity disciplines for infrastructure spanning thousands of locations during major incidents/site events on edge, caching, and network infrastructure. This will require you to work closely and effectively with a variety of cross functional teams, managed service providers, and third-party vendor partners Escalation Management: Participate in the global team’s Tier 3 and 4 on-call rotation with the goal of routing issues as needed and understanding how processes or tooling might be improved, skills can be developed, or automation can be implemented to prevent the need to escalate similar issues in the future Operational Leadership: As an operations practitioner within the team you will be expected to drive improvement in everything we do. In this role you will indirectly manage the activities of a large contingent workforce responsible for delivering road mapped projects and executing on recurring activities. You will drive standards across the network and ensure that we are fully compliant to those standards and policies Risk Management and Assurance: Work internally and with upstream partner teams to ensure design, build, and operations aligns to applicable reliability, security, privacy, regulatory policy, and business continuity drivers Information and Data Assurance: ensure relevant operational process, procedure, and policy documentation is effectively managed and the data required to support operations is complete and accurate in systems Automation: Be heavily involved in driving the team to analyze operational events in order to identify new automation opportunities and help us achieve our goal of all faults in the network being fully remediated by software. This will include helping others understand our requirements and drive their roadmaps, but may include directly implementing light weight solutions in code Data Measurement: As an operations practitioner supporting our network, you will be expected to drive quality into the metrics we report to assist us in focusing on the areas that give us the best return on investment. This could include measurement and analysis of our escalation issues, fault/event trends, infrastructure capacity, and vendor performance failures Collaboration and Partnership: You will work closely on supporting our internal customers (Network Engineering, Systems Engineering, Traffic, Logistics, Program Management) and vendors (IT asset disposal, and Hardware partners) and ensuring that their needs and issues are being addressed proactively across global sites Roadmap Ownership and Strategy: Own the planning and execution of an organizational-level roadmap and strategy to deliver business outcomes Technical Leadership: Provide root cause analysis and corrective action leadership to resolve all operational issues found across edge and backbone architectures and hardware platforms. You will be integral to identifying problems and implementing effective solutions across highly cross-functional infrastructure teams to include network engineering, logistics, supply chain, compliance, legal, software system engineering, and program management to scale with the rapid expansion of the Meta platform and customer base Business Ownership: Represent the organization and manage interaction with third parties such as hardware, colocation, telecom carrier, and managed service partners Project Leadership: Lead highly cross-functional infrastructure projects and programs in a matrix organization covering a range of areas (data center, production network, infrastructure, logistics, supply chain, compliance, legal, and software system engineering) Communication: Communicate cross-functionally across various teams, organizations and internal and external stakeholders(Network Engineering, Systems Engineering, Traffic, Logistics, Program Management, and hardware partners) to drive infrastructure operations development and management Travel: International and Domestic travel may be required up to 15 percent",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta Operations Center Experience: Minimum of 4 years of direct leadership experience within a global Network Operations Center or IT Operations Center environment to manage Service Level Agreements and continuous improvement against metrics at scale Network Protocol: Advanced knowledge of TCP/IP, IPv4/v6, Border Gateway Protocol, Intermediate System to Intermediate System, Open Shortest Path First, and/or Multi-protocol Label Switching in complex troubleshooting scenarios. Cisco and Juniper Professional level or equivalent experience CDN and Edge: Advanced knowledge in CDN & Network Services, peering network strategies, including topology, traffic analysis, linux operating systems, hardware platform, and architectures in complex troubleshooting scenarios Repair Function: Minimum of 4 years of logical troubleshooting and physical repair with an understanding of physical infrastructure such as cable types, connector types, optic types, racks, patch panels, power/cooling, hardware components, and facilities infrastructure Partnership: Experience successfully collaborating across a global team and with cross-functional partners(e.g. physical infrastructure & network design, engineering, strategy, security, policy, and legal) at all levels to include vendor service delivery managers, individual contributors, and people managers Prioritization: Experience managing from the front to prioritize and drive the bigger mission forward by translating strategy into results Network and Infrastructure Design: Minimum of 4 years of direct experience understanding and influencing network and infrastructure architectures to include constraint and dependency analysis and translating these into deployable and supportable solution requirements",
    "preferred_qualifications": "Facility Experience: Working within varied infrastructure environments, such as colocation facilities, cable landing stations, ILAs, owned data centers, or corporate campuses Vendor Partner Experience: Partnering to translate performance issues into improvement plans with enterprise and service provider vendors such as network hardware platforms(Cisco, Juniper, Ciena, Infinera, Nokia, and Arista), ITAD vendors, logistics vendors, and colocation vendors Data Design: Basic knowledge applying data-driven analysis and leveraging technologies like machine learning and predictive modeling algorithms to solve complex business problems Information Technology Functional Experience: Working within global network or infrastructure operations, deployment, design/engineering and/or support teams Professional Services: Experience with purchasing, negotiating and end-to-end supplier management, such as managing global Request for Proposals (RFPs) and contract negotiations Risk and Assurance Management: Experience in operational compliance, physical & logical infrastructure security, and/or business continuity disciplines Business Metrics: Experience identifying key metrics/measures that will be used to evaluate success and validate the business impact of the program",
    "compensation": "$50.48/hour to $156,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2597597283950569": {
    "title": "Security Engineer, GenAI",
    "URL": "https://www.metacareers.com/jobs/2597597283950569",
    "location": "Bellevue, WA • Menlo Park, CA • Washington, DC • New York, NY • Remote, US • Full Time + 4 more • Full Time - Hide",
    "responsibilities": "Influence and align the organization’s vision and strategy, while engaging our teams to develop and deliver specific, multi-year roadmaps, programs, and projects. Ensure prioritization, resourcing, and timely delivery of this work within a changing business environment Design and implement novel security solutions to protect against AI risks such as prompt injections where no industry standard exists Security Reviews: perform manual design and implementation reviews of products and services that make up the Meta ecosystem, like Instagram, WhatsApp, Oculus, Portal, and more Automated Analysis and Secure Frameworks: build automation (static and dynamic analysis) and frameworks with software engineers that enable Meta to scale consistently across all of our products Developer Guidance: provide guidance and education to developers that help prevent the authoring of vulnerabilities Bug Bounty: help provide technical guidance to our world class bug bounty program and independent security researchers Industry Impact: push the industry forward through conference talks and open source projects to contribute broadly to security for the world",
    "minimum_qualifications": "B.S. or M.S. Computer Science, Engineering, or related technical discipline, or equivalent experience 10+ years experience dealing with security issues web programming languages, development practices, and common bug patterns Experience developing and delivering information on program status for senior leadership Experience leading and managing complex cross-functional programs Experience with exploiting common security vulnerabilities",
    "preferred_qualifications": "Experience contributing to the security community (public research, blogging, presentations, etc.) Experience writing software that enables security processes",
    "compensation": "$213,000/year to $293,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "4254390044844331": {
    "title": "Design Engineer",
    "URL": "https://www.metacareers.com/jobs/4254390044844331",
    "location": "New York, NY • Full Time",
    "responsibilities": "Define and synthesize user requirements Help establish design processes to align cross-functional teams Contribute to strategic decisions, working with engineering and research teams Design and create user experience prototypes and individually contribute to the feature set Work with user research to user test and iterate on the prototypes Give and solicit feedback from others to raise the quality and craftsmanship of the product Partner with product designers, PMs, engineers, researchers and content designers, overseeing the implementation of the user experience Quickly solve issues with your cross-functional leads Clearly articulate design decisions to a vast set of internal stakeholders Help build product strategy Advocate for product design within Meta",
    "minimum_qualifications": "6+ years of experience in shipping software products Design skills and the proven experience to lead in cross-functional environments Knowledge of qualitative and quantitative methods for user research Experience to think at a high level about product strategy and vision Portfolio featuring examples of interaction and visual work Experience building prototypes in short timeframes Bachelor's degree in Design, Human-Computer Interaction, Computer Science, or a related field Thrive in dynamic, fast-paced environments",
    "preferred_qualifications": "Experience programming in Swift, JavaScript, Python, or similar Experience working with researchers",
    "compensation": "$165,000/year to $231,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}