{
  "839725671963072": {
    "title": "Development and Adoption System Manager, Global Operations",
    "URL": "https://www.metacareers.com/jobs/839725671963072",
    "location": "Austin, TX • Menlo Park, CA • Seattle, WA • New York, NY • San Francisco, CA • Full Time + 4 more • Full Time - Hide",
    "responsibilities": "Build and lead a team of Solution Architect Managers focused on internal tooling development, through rapid infrastructure, tooling, and product growth Manage, mentor, and grow the existing team while fostering a healthy, and productive team Define strategic tooling direction and optimize tooling stack Drive end-to-end execution and delivery of technical programs from ideation, technical and data analysis, system design, development, testing, and implementation and post-implementation Implement scalable systems that align with business objectives, mapping supporting data structures to drive informed decision-making and measurable customer outcomes Develop a technical understanding of system architecture and data flows to identify opportunities for optimization, ensuring seamless integration and effective measurement of key performance indicators Craft technical programs where none existed, pulling disparate and often complex components together Drive strategy and execution of the program by building alignment, managing dependencies, mitigating risks, and communicating clearly Forge partnerships with technical and business leaders across the company, ensuring that team resource investments align with company priorities. This requires navigating conflicting priorities, competing resources, quickly evolving business needs, and the AI landscape Lead from the front by leveraging your technical proficiency to proactively identify and analyze complex, long-term, critical tooling challenges with engineering leaders and stakeholders Structure and optimize the team for effective execution, including attracting talent and swiftly filling gaps in the existing team to facilitate growth Build and lead an organization centered on customer focus and effective communication, emphasizing decisive, fast-moving solutions, quick and constructive conflict resolution",
    "minimum_qualifications": "B.S. in Computer Science or a related technical discipline, or equivalent experience 10+ years of software industry experience, including systems engineering, consulting, or technical product/program management experience 2+ years of people management experience leading teams to deliver technical programs or products from inception to delivery Experience in organizational coordination and establishing work relationships across multi-disciplinary teams and partners in different time zones Experience in analytical thinking and problem-solving with large-scale systems, proven track record in delivering technology programs or products from inception to delivery, understanding user needs, gathering requirements, and defining scope Experience operating across multiple teams, demonstrating critical thinking and thought leadership Experience communicating and collaborating with technical management teams to develop systems, solutions, and products Experience in AI, machine learning, or related fields",
    "preferred_qualifications": "",
    "compensation": "$177,000/year to $246,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}