{
  "677274385428137": {
    "title": "Data Center Site Manager",
    "URL": "https://www.metacareers.com/jobs/677274385428137",
    "location": "Cheyenne, WY • Full Time",
    "responsibilities": "Deliver data center infrastructure to Meta and our global community through collaboration with site and global teams Develop technical expertise in Meta's infrastructure, including platforms, tools, systems, architecture, workflows, and performance Lead an engineering operations team to drive insights, solutions, and best practices for efficient hyperscale server management Analyze and improve engineering and operational performance of data centers using data analytics to identify inefficiencies, opportunities, and risks Implement quality assurance, continuous improvement, safety, security, and data protection processes into standard practices Drive innovation and adoption of new technologies at scale to improve tooling, workflows, and technologies Build cross-functional relationships to influence engineering and operations across Meta, improving global data center fleet performance Assume crisis manager role during large-scale production impacting events, working cross-functionally to mitigate risks and resolve incidents Build a team with enough resources to ensure business continuity Represent Meta in community and public forums, coordinating with the Community Development Team Travel up to 30% required Technologist with proven experience in leveraging technical, operations, and engineering expertise to build strategy",
    "minimum_qualifications": "BS in Engineering, Computer Science, or related field 15+ years of experience in engineering or operations Proven problem-solving skills with expertise in analytics and lean methodologies to drive global impact Effective influencer with cross-functional team experience, adapting teams to meet company needs Leadership, strategic thinking, organization, and business-planning skills Thrive in a time-sensitive, hands-on environment Knowledge of data center infrastructure and/or operations, including: Power, cooling, and network systems, structured cabling, and project, incident, and vendor management Communicate effectively internally across disciplines and organizations at all levels, and externally at public events, to public representatives, and the media",
    "preferred_qualifications": "Experience with Data center infrastructure operations Experience with Data analytics Experience with Quality management including Lean/Six Sigma",
    "compensation": "$131,000/year to $186,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "821341880415328": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/821341880415328",
    "location": "New York, NY • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field. Requires completion of a university-level course/research project/internship/thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL and Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$182,002/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "824262043407932": {
    "title": "Camera Perception Engineer",
    "URL": "https://www.metacareers.com/jobs/824262043407932",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Develop and refine image processing pipelines for camera systems Lead perceptual and objective image quality studies to guide product and technology development Innovate and implement algorithmic solutions to enhance camera product image quality Create and improve tools, metrics, and workflows for the camera tuning process Coordinate and communicate image quality deliverables to cross-functional teams Contribute to and review the comprehensive camera system design",
    "minimum_qualifications": "Bachelor's degree in Electrical Engineering, Computer Science, Image Processing, Color Science or a related field 6+ years of experience in supporting Camera and Imaging development Understanding of image processing techniques, ISP blocks, and mainstream computational photography or AI-based algorithms for mobile camera products Proven track record to enhance product development processes through technology and tooling improvements Experience in designing experimental methods and extracting data to answer complex questions Demonstrated experience working effectively with a broad range of colleagues and partners, to drive impact",
    "preferred_qualifications": "MS or PhD in Image Processing, Color Science, Electrical Engineering, Computer Science, or a related field In-depth experience in Image Quality metrics Extensive knowledge of image processing techniques, ISP blocks, and mainstream computational photography or AI-based algorithms for mobile camera products Familiarity with human perception and statistical analysis, or relevant research experience Proven track record to collaborate effectively across functions Interest in photography and camera image quality",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1069034411836715": {
    "title": "Electrical Engineer",
    "URL": "https://www.metacareers.com/jobs/1069034411836715",
    "location": "Sunnyvale, CA • Redmond, WA • New York, NY • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Own electrical development of highly complex systems delivering and ensuring that electrical systems achieve product goals Lead electrical architecture definition or provide technical leadership to a larger development team Design schematics, direct board layout, lead cross-functional design reviews and draft design documentations Conduct feasibility studies and analysis to evaluate new technologies and components. Propose innovative solutions to enhance product performance and features Manage bring up and debug, support manufacturing and assembly build Collaborate in a team environment and work across engineering disciplines to develop systems and manage trade offs across electronics, mechanics, optics, sensors, haptics, firmware and software Work in distributed team environment Contribute to building and sustaining internal community through recruitment and mentorship Inform prioritization of work across teams and disciplines and actively participate in resolving technical conflicts Travel both domestically and internationally",
    "minimum_qualifications": "8+ years of industry experience in electrical design BS in Electrical Engineering or Computer Engineering, or equivalent industry experience Proven knowledge of electrical engineering fundamentals Experience with schematic and board design using Cadence OrCAD, Altium or equivalent Experience with use of oscilloscopes, high speed digital test equipment, logic analyzers, or function generators Experience working with multiple of these technologies: digital signal processing, real-time image processing, display engineering, camera modules, mobile SoC (System on Chip) and PMIC (Power Management Integrated Circuit) or Battery Management System Experience leading technical teams, cross-functional groups and vendors against project plans",
    "preferred_qualifications": "MS or PHD in Electrical Engineering or Computer Engineering 12+ years of industry experience in electrical design Experience with audio technologies Experience with high speed signaling over MIPI C-PHY/D-PHY, PCIe, USB SS and UFS Experience with IMUs/sensor physical sensor systems with an understanding of calibration methods Experience with vision systems Experience programming in languages like Python or C/C++",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1442082800218145": {
    "title": "Area Schedule Lead - Data Center Design, Engineering and Construction",
    "URL": "https://www.metacareers.com/jobs/1442082800218145",
    "location": "Menlo Park, CA • Fremont, CA • Remote, US • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Responsible for end to end schedule coordination and updates, including interface with risk management and pro-active communication of updates and alignment of variance root cause/commentary with Cross-functional partners Identifies, documents, and communicates schedule risks through defined processes, including Risk Registers, health reviews, and New Build Program management meetings Accountable for all aspects of vendor and Contractor schedule management Accountable for Contractor baseline schedule development and evaluation during pre-con, including ensuring adherence to program guidance and specifications. Will lead efforts to optimize schedules for speed to market and successful on-time-delivery Responsible for application of commercial entitlement for contractor Extensions Of Time (EOT) for their designated portfolio of projects. Provide leadership to site teams for Delay Tracking, EOT requests and claims. Responsible for making recommendations that are in line with contract and escalating when site decisions differ from the contractual or program guidance Lead the identification and application of Proactive Risk Indicators in sub-area and ensure all risks are properly escalated to Health Reviews, and other appropriate forums. Lead ad-hoc schedule analysis to support program as required Lead a small team of consultants (if required) to support effective schedule management for the designated portfolio of projects Approximately 50% travel to other Data Center sites within the Area and home office",
    "minimum_qualifications": "10+ years of Planning, Scheduling, Construction Management, or Related field experience Bachelor’s degree in Engineering, Construction Management, or Equivalent Technical Field or related field experience Subject Matter Expert in Primavera P6 and other scheduling related methodologies and software Experience developing/managing an Owner’s planning/scheduling program Familiar with Data Center, Infrastructure or Construction programs requiring complicated commissioning specifications Demonstrated analytical, communication, problem solving, prioritization, organization and reporting skills Experience leading complex project or program planning and coordination amongst a large group of internal and external project stakeholders Demonstrated experience developing and driving actions or operational adjustments based on schedule or project controls performance metrics Demonstrated experience partnering with cross-functional teams to influence strategic direction",
    "preferred_qualifications": "Experience identifying schedule efficiencies and driving programmatic or organizational alignment in changing execution strategies to optimize schedule performance Experience negotiating schedule changes or complex construction claims Successful development and implementation of scheduling or project controls strategies in a large organization Familiar with complex networking systems and electrical infrastructure Experience managing a team of Contingent Worker Schedulers",
    "compensation": "$144,000/year to $201,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1821713085101005": {
    "title": "Research Scientist Intern, FAIR - Multi-Agent Multimodal Foundations (PhD)",
    "URL": "https://www.metacareers.com/jobs/1821713085101005",
    "location": "Menlo Park, CA • Seattle, WA • New York, NY • Internship + 2 more • Internship - Hide",
    "responsibilities": "Perform research that enables developing better agents for multi-agent, multimodal scenarios (using text, audio, images, video, or other modalities) Brainstorm with research mentors, review literature and existing solutions of a challenging real-world research problem Develop novel solutions, implement prototypes, and perform extensive experiments to test the proposed solutions in meaningful benchmarks and metrics, analyze the results and verify the conclusions Draft and polish research reports and/or publications Present research outcomes to internal and/or external audiences Contribute research that can be applied to Meta product development",
    "minimum_qualifications": "Currently has or is in the process of obtaining a PhD degree in the field of Natural Language Processing, Speech Processing, Computer Vision, Machine Learning, Artificial Intelligence, or equivalent Research and/or work experience in Natural Language Processing, Speech Processing, Computer Vision, Machine Learning, Deep Learning, Reinforcement Learning, or equivalent Experience in Python, C++, or other related languages Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Experience advancing AI techniques in Natural Language Processing, Speech & Language, Machine Learning, Reinforcement Learning, or Computer Vision, including contributions to open source libraries and frameworks Proven track record of achieving significant results as demonstrated by fellowships and publications at leading workshops or conferences in Machine Learning (NeurIPS, ICML, ICLR, COLM, RLC), Computer Vision (CVPR, ECCV, ICCV) or Speech & Language (ACL, EMNLP, NAACL, TACL, ICASSP, Interspeech, SLT, ASRU, TASLP) Experience manipulating and analyzing complex, large scale, high-dimensionality data from varying sources Experience in utilizing theoretical and empirical research to solve problems Experience working and communicating cross functionally in a team environment Intent to return to degree-program after the completion of the internship/co-op",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1865758441490305": {
    "title": "AI Research Scientist, CoreML - Monetization",
    "URL": "https://www.metacareers.com/jobs/1865758441490305",
    "location": "Burlingame, CA • Full Time",
    "responsibilities": "Extracting meaningful signals from both 1st-party and 3rd-party data sources Advancing representation learning Scaling solutions to efficiently process hundreds of billions of data points Driving continuous algorithmic innovation Seamlessly productionizing research breakthroughs all while optimizing serving costs",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience PhD in Computer Science, Machine Learning, or a relevant technical field 3+ years of industry research experience in LLM/NLP, computer vision, or related AI/ML model training Experience as a technical lead on a team and/or leading complex technical projects from end-to-end Publications at peer-reviewed conferences (e.g. ICLR, NeurIPS, ICML, KDD, CVPR, ICCV, ACL) Programming experience in Python and hands-on experience with frameworks such as PyTorch Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "A track record of impactful research in the ranking/retrieval/recommendation space, as demonstrated by publications, open-source contributions, or real-world deployments First-authored publications at peer-reviewed conferences (e.g. ICLR, NeurIPS, ICML, KDD, CVPR, ICCV, ACL) Experience in pre-training, post-training, fine-tuning models Experience in causal learning, sequence learning, classification, neural networks, graph learning, items associated, in-depth content understanding (user behavior, user interaction) Experience solving complex problems and comparing alternative solutions, tradeoffs, and broad points of view to determine a path forward Willing to collaborate with others in a productive, interdisciplinary environment",
    "compensation": "$177,000/year to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3030607313790195": {
    "title": "User Experience Research Manager - Facebook Search",
    "URL": "https://www.metacareers.com/jobs/3030607313790195",
    "location": "Menlo Park, CA • Seattle, WA • New York, NY • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Manage a user experience research team (qualitative and quantitative UXR) Make staffing decisions based on business priorities, both short term and long term, as well as team strengths and motivation Identify gaps and solutions for future growth and scale within the team or organization, including system, product, function, partnership and/or organization opportunities Responsible for the quality of the team, including coaching, growing individual contributors and coaching under-performing team members Collaborating with product, engineering, design, data science and product marketing Have a point of view about strategic decisions, using insights from the team, and communicate key take-aways clearly Understand how to influence stakeholders and leaders to implement the best ideas Become a trusted, strategic partner to product stakeholders by communicating and demonstrating the value of user research, and by delivering insights that lead to demonstrable business value Manage a team of researchers across a key product vertical, and across multiple research disciplines",
    "minimum_qualifications": "Bachelor’s degree or significant experience conducting user research with meaningful business impact 8+ years of experience conducting primary research (either qualitative or quantitative) across the full product lifecycle, end-to-end (designing, fielding, analyzing and reporting out data) 2+ years of experience directly managing, coaching and developing full-time researchers Experience building teams over time through hiring, growing, and retaining researchers Experience directly managing across different research methodologies, and guiding a research team to develop generative, iterative, and evaluative research plans Experience building and setting research strategy that connects with business strategy Experience working with a variety of cross functional peers and stakeholders (product managers, data scientists, designers, engineers, policy, communications, marketing) Understand complex technical product areas (e.g. recommendation ranking) Experience understanding the balance between ad hoc and rigor, and ultimately how research translates into design and product decisions Experience moving in a fast-moving organization and leveraging multiple new research methods, committed to high-quality, rigorous research and clearly communicating take-aways",
    "preferred_qualifications": "",
    "compensation": "$163,000/year to $226,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "5166308003594756": {
    "title": "Technical Program Manager, AI Accelerator Software",
    "URL": "https://www.metacareers.com/jobs/5166308003594756",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Collaborate with Engineering and business owners to define program requirements, set priorities, and establish scope which includes defining the roadmap and long-term strategy of the teams that you are partnering with Align with application and end-customer focused technical teams on software and system requirements and schedule Create execution strategies and build plans for the full stack software development Ensure lower layer components like libraries, tooling, provisioning software, operating system fully enable applications and datacenter operations Develop and drive a software benchmarking, analysis and optimization strategy for new hardware platforms Lead migration of existing AI software applications to enable critical use cases Own end-to-end overall program success spanning developmental phases (requirements, analysis, design, testing, implementation, operations), organizations (software, hardware, capacity, operations, network, sourcing) and locations worldwide Build aligned program teams to efficiently deliver on shared goals Define and track key metrics and key quality and performance indicators and drive cross functional execution of program deliverables Develop and own communication plans to effectively and proactively communicate program status, issues, and risks to stakeholders Manage and drive strategic vendor engagement and deliveries Manage cross functional dependencies, risks, and changes effectively by optimizing scope, schedule, and resources accordingly Perform risk assessment, risk mitigation and change management on projects Proactively identify and analyze complex, long-term, critical infrastructure problems with engineering leaders and stakeholders Drive internal process improvements across multiple teams and functions",
    "minimum_qualifications": "B.S. in Computer Science, Electrical Engineering or a related technical discipline, or equivalent experience 10+ years of software engineering, systems engineering, hardware engineering or technical product/program management experience Experience delivering complex tech programs and/or products from inception to delivery Knowledge of user needs, gathering requirements, and defining scope Demonstrated experience operating across multiple teams, demonstrated critical thinking, and thought leadership Communication experience and experience working with technical management teams to develop systems, solutions, and products Organizational, coordination and multi-tasking experience Analytical and problem-solving experience with large-scale systems Experience establishing work relationships across multi-disciplinary teams and multiple partners in different time zones",
    "preferred_qualifications": "Understanding of AI software development life cycle, AI algorithms and techniques Experience with high performance or AI training clusters Experience with data center architecture, deployment and working with capacity planning, migration and turn-up Understanding of scientific or technical computing techniques Experience working with hardware-specific software optimization, system analysis and hardware-software co-design Understanding of Graphics or AI accelerator hardware architecture",
    "compensation": "$167,000/year to $230,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}