{
  "729963702697761": {
    "title": "Product Design Technical Program Manager",
    "URL": "https://www.metacareers.com/jobs/729963702697761",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Partner with the Product Design Engineering team to enable the definition and execution of next generation hardware products Coordinate and drive engineering design deliverables including specifications, DOE and validation plans Work with cross-functional teams (System PD, EE, Reliability, Operations) and other cross-functional teams to develop best practices and technology development processes in a fast-paced environment Manage delivery of hardware components for development builds and drive qualification to meet mass production timelines Create development, delivery, and qualification schedules based on system requirements, technical challenges, lead-times and business needs Manage program structure to optimize clarity and efficiency for program teams, leadership Communicate program statuses, identifying potential setbacks, including vendor tooling schedules and PD design sprints Manage communication within and between internal cross functional and external partners Ensure program documents are complete, current, and available for staff and leadership review Contribute to resource planning to ensure program success Up to 20% travel internationally",
    "minimum_qualifications": "BS in Mechanical Engineering field or equivalent experience 5+ years experience working as a technology development program manager or engineering leadership role in consumer electronics Experience in ODM, JDM, and CM vendor engagement models Knowledge of phase gate approach to technology development programs Experience with mechanical system development, design for manufacturing, tooling, validation and characterization processes Adept at communicating, planning, with high level of attention to detail Knowledge of program top issue tracking and version control software Experience operating autonomously across multiple teams and programs Maintains composure in times of ambiguity and direction changes",
    "preferred_qualifications": "7+ years of experience in mechanical design, serving as an engineering lead or program manager for consumer electronics Experience in 1P and/or 2P product development, defining requirements and program constraints, and collaborating with both internal and external stakeholders",
    "compensation": "$134,000/year to $196,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1716411972409213": {
    "title": "Data Center Strategy & Planning Manager",
    "URL": "https://www.metacareers.com/jobs/1716411972409213",
    "location": "Menlo Park, CA • Fremont, CA • Full Time",
    "responsibilities": "Leverage technical experience and expertise, to Identify and build large transformational programs and initiatives across Infrastructure that scale Meta’s Data Center footprint efficiently Develop new Data Center planning strategies that focus on driving improvements in reliability, and achieve cost and operational efficiency including reductions in deployment times, improvements in data center power utilization, and service placement optimizations Optimize network, hardware and DC infrastructure footprints to drive TCO savings Develop detailed project evaluation plans for data center plan evolution and set the pace to drive closure Apply quantitative techniques, develop decision scenarios and trade-offs to drive multi-billion dollar infrastructure decisions at the highest level in the organization Own the communications strategy for data center planning decisions which includes executive level and detailed project briefs and status updates Use technical judgment to drive new project evaluations, technology reviews and proposals building consensus",
    "minimum_qualifications": "Bachelor's degree in a directly related field, or equivalent practical experience Bachelor’s degree in a management, technical or engineering field 8+ years of experience working in Infrastructure/Cloud/Hardware with a background in Strategy, Capacity Planning, Supply Chain Optimization, technology strategy consulting Experience distilling various data points into actionable insights and recommendations, to quickly separate signal from noise for executive communication and decision making Business acumen and intuition, with the experience to form and refine hypotheses into an actionable analysis and recommendation Analytical and quantitative, with the experience to constructively engage with analysts, Data Science and Engineering, and UXR partners to frame and interpret sophisticated analyses Problem solving and strategy skills, including expansive opportunity identification and framing of complex/ambiguous problems Experience in completing multiple cloud/infrastructure/hardware efficiency or optimization projects Technical experience in infrastructure, hardware or similar designs Experience collaborating and working with internal and external organizations and individuals Experience Building Decision scenarios & options and communicating at the all levels of the organization",
    "preferred_qualifications": "Masters Degree 12+ years of experience working in Infrastructure/Cloud/Hardware with a background in Strategy, Capacity Planning, Supply Chain Optimization",
    "compensation": "$195,000/year to $264,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2199105800575907": {
    "title": "Research Scientist Intern – Wearables Input and Interaction",
    "URL": "https://www.metacareers.com/jobs/2199105800575907",
    "location": "New York, NY • Internship",
    "responsibilities": "Ideate and articulate novel interaction techniques that will revolutionize the input stack on wearable devices. Plan and execute cutting-edge research of forward-looking interactions that are uniquely enabled by multimodal input sources, including neuromotor (sEMG) sensors. Create prototypes which explore input and interaction techniques in a variety of wearable computing environments and situations Evaluate the performance of input explorations and measure user response to input solutions",
    "minimum_qualifications": "Currently in the process of obtaining a PhD in the field of HCI, Computer Science, or related field Experience in HCI, UI/UX, AR/VR, graphics, gaming, or other interactive development Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment Publications at CHI, UIST, Ubicomp, SIGGRAPH, IEEE VR, ISMAR, IUI, or related venues",
    "preferred_qualifications": "Experience working with novel/prototype hardware, sensors, or devices Experience with gestural or wearable computing interfaces Experience in designing, running, and analyzing user studies Familiarity with machine learning algorithms Familiarity with multimodal input Familiarity with computer vision or computer graphics Technical and non-technical communication skills Intent to return to degree-program after the completion of the internship",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}