{
  "815262584761550": {
    "title": "Security Engineer",
    "URL": "https://www.metacareers.com/jobs/815262584761550",
    "location": "New York, NY • Full Time",
    "responsibilities": "Perform manual design and implementation reviews of products and services that make up the Meta ecosystem, like Instagram, WhatsApp, Oculus, Portal, and more. Provide guidance and education to Developers that help prevent the authoring of vulnerabilities. Build automation (static and dynamic analysis) and frameworks with Software Engineers that enable Meta to scale consistently across all of our products. Identify opportunities to prevent security problems at scale. Triage and prioritize security alerts from static analysis tools.",
    "minimum_qualifications": "Bachelor’s degree (or foreign degree equivalent) in Computer Science, Computer Engineering, or a related field and 2 years of experience in the job offered or a computer-related occupation Requires 2 years of experience in the following: Finding vulnerabilities in interpreted languages (PHP, Ruby, Python) Providing security best practice and secure code development guidance to software developers Conducting threat model, secure design and code reviews Programming languages such as Python, Java, C++ Common security vulnerabilities along with exploitation and mitigation techniques Authentication and authorization protocols",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1121515873095892": {
    "title": "ASIC Engineer",
    "URL": "https://www.metacareers.com/jobs/1121515873095892",
    "location": "Austin, TX • Full Time",
    "responsibilities": "Participate in Micro-architecture, Design, and Verification reviews and provide feedback. Design and develop RTL or HLS code for some of the Ips. Analyze designs and enhance PPA (Power, Performance, Area). Support and develop Verification Infrastructure, analyze and improve Verification Coverage, Support Simulation accelerators and post-Silicon validation. Ensure that the designs are CDC and Lint clean. Get involved in performance discussions and implement power, performance, area aware designs.",
    "minimum_qualifications": "Bachelor's degree (or foreign equivalent) in Computer Science, Computer Engineering, or a related field Requires completion of one university-level course, one research project, or one internship involving the following: Demonstrated knowledge of Computer Architecture and Logic Design fundamentals RTL development using Verilog, System Verilog or HLS Exposure to Micro-architecture development Lint, CDC, Synthesis, & Power Optimization Synthesis, Timing Closure or Formal Verification Methodology and TCL, Python, Perl, or Shell-scripting",
    "preferred_qualifications": "",
    "compensation": "$123,860/year to $154,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1162002992742116": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/1162002992742116",
    "location": "Washington, DC • Full Time",
    "responsibilities": "Help build the next generation of systems behind Meta’s products. Harness passion for technology and graduate-level knowledge, and help build highly-scalable software systems. Make use of graduate-level knowledge of algorithms and core computer science concepts and ability to apply knowledge to real world systems. Without direct assistance, make the most of ability to recognize and match patterns from different areas of computer science in production systems and hone skill in making architectural decisions. Employ deep knowledge in at least one area: machine learning, data privacy, data processing, programming languages, databases, networking, operating systems, computer graphics, or human computer interaction.",
    "minimum_qualifications": "Requires a Master’s degree (or foreign equivalent) in Computer Science, Engineering, Mathematics, or a related field Requires completion of a graduate-level course, research project, or internship involving the following: Building large-scale infrastructure applications Relational databases and SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS Full stack web/mobile application development in at least one of the following industry-standard languages: C, C++, Java, or C# Leveraging frameworks, including experience in at least one of the following: React or React Native Conducting design and code reviews Building Android applications in Java using Android SDK Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Distributed systems including sharding, consistency, and availability Algorithms Dependency injection and scoped access to shared resources Machine Learning Framework(s): PyTorch, MXNet, or Tensorflow Data structure and algorithms Building mobile and desktop web applications using JavaScript, including asynchronous programming, closures, types, and ES6 Front end development of mobile and desktop applications using React, Vue, or Angular Writing code for User Interface components Building intuitive systems in at least one of the following: Java, PHP, C++, or JavaScript technologies such as ReactJS or AngularJS and Working with code bases building micro services, REST APIs, and GraphQL",
    "preferred_qualifications": "",
    "compensation": "$174,009/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1164608758560390": {
    "title": "Security Engineer",
    "URL": "https://www.metacareers.com/jobs/1164608758560390",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "Build tools that enable connectivity to our infrastructure only from Meta owned and managed devices. Build machine attestation and secure certificate storage solutions to enable strong client trust. Deploy systems that help mitigate security risks by understanding and controlling what software is allowed to execute on our client devices. Develop, validate, and enforce our client security policies. Build and deploy tools and automation that proactively detect and respond to security risks and threats to internal corporate services. Advise and collaborate with other teams. Telecommuting from anywhere in the U.S. allowed.",
    "minimum_qualifications": "Requires Bachelor's Degree (or foreign equivalent) in Computer Science, Engineering or a related field and 1 year of experience in the job offered or a computer-related occupation Requires 12 months of experience involving the following: PHP, Golang, Python, C/C++, Rush, or Ruby Designing and deploying security infrastructure such as PKI, key management, and certificate management Endpoint Security & Management Certificate Lifecycle Devices & OS hardening and security policies Identity & Access Management (Authentication & Authorization, SSO) Network Security and Programming and Code Review",
    "preferred_qualifications": "",
    "compensation": "$178,041/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1815475105767504": {
    "title": "ASIC Verification Engineer",
    "URL": "https://www.metacareers.com/jobs/1815475105767504",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Develop and execute verification plans for ASIC designs, ensuring comprehensive coverage and validation of design specifications. Collaborate with design engineers to understand design intent and identify potential verification challenges. Create and maintain testbenches and test cases using industry-standard verification languages and methodologies (e.g. SystemVerilog, UVM). Perform simulation and debugging of ASIC designs to identify and resolve functional issues. Analyze and document verification results, providing feedback and recommendations for design improvements. Participate in design and verification reviews, contributing to the continuous improvement of verification processes and methodologies. Work closely with cross-functional teams, including design, architecture, and firmware, to ensure successful integration and functionality of ASIC designs.",
    "minimum_qualifications": "Master's degree (or foreign equivalent) in Electrical Engineering, Computer Engineering or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Developing and executing verification plans for digital designs Using hardware description languages (e.g. Verilog) and verification languages (e.g. SystemVerilog) with in UVM (Universal Verification Methodology) Creating and maintaining testbenches and test cases for ASIC verification Debugging and resolving issues in digital designs through simulation and analysis Understanding of digital design concepts and methodologies Collaborating across design, emulation, and silicon validation teams for the development of robust test benches using SystemVerilog, and UVM methodologies Using scripting skills in Python for test automation, environment setup, and process optimization Utilizing EDA tools for simulation and verification (e.g. Cadence, Synopsys, Mentor Graphics) Documenting verification processes and results for review and analysis and Engaging in design and verification review to analyze verification results, identify design issues, provide technical feedback, and recommend improvements to verification strategies and test plans",
    "preferred_qualifications": "",
    "compensation": "$136,000/year to $154,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}