{
  "1160018732265521": {
    "title": "Program Manager, Ecosystems Operations",
    "URL": "https://www.metacareers.com/jobs/1160018732265521",
    "location": "Austin, TX • New York, NY • Full Time",
    "responsibilities": "Understand the implications of regulations on Meta’s policies, workflows, and community of users Lead a large cross-functional team to coordinate responses to regulatory inquiries and investigations, including developing and implementing response strategies and securing broad alignment Build and maintain relationships with cross functional teams and internal stakeholders, including product, legal, policy, engineering, and operations teams, to ensure effective collaboration Develop, support and improve scaled processes supporting regulatory compliance Identify opportunities for process improvement, implementing solutions that increase efficiency and effectiveness",
    "minimum_qualifications": "5+ years of experience working in an Operations, Analytics, Product, Engineering, Consulting, Project Management or equivalent team 4+ years of project /program management experience driving end to end initiatives with minimal guidance Demonstrated problem-solving skills, experience analyzing complex and ambiguous problems, and developing innovative solutions Communication, collaboration, and stakeholder management skills, works effectively in a cross-functional environment Demonstrated experience navigating ambiguity, achieving outcomes in deadline-focused environments, and influencing stakeholders",
    "preferred_qualifications": "",
    "compensation": "$116,000/year to $168,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}