{
  "1607511280408317": {
    "title": "Research Engineer, CoreML - Monetization AI",
    "URL": "https://www.metacareers.com/jobs/1607511280408317",
    "location": "Sunnyvale, CA • Los Angeles, CA • Bellevue, WA • Menlo Park, CA • Burlingame, CA • New York, NY • San Francisco, CA • Fremont, CA • Mountain View, CA • Full Time + 8 more • Full Time - Hide",
    "responsibilities": "Collaborate with cross-functional teams (product, design, operations, infrastructure) to build innovative application experiences Implement custom user interfaces using latest programming techniques and technologies Develop reusable software components for interfacing with back-end platforms Analyze and optimize code for quality, efficiency, and performance Lead complex technical or product efforts and provide technical guidance to peers Architect efficient and scalable systems that drive complex applications Identify and resolve performance and scalability issues Work on a variety of coding languages and technologies Establish ownership of components, features, or systems with expert end-to-end understanding",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta 2+ years of programming experience in a relevant language OR a PhD + 9 months programming experience in a relevant language Track record of setting technical direction for a team, driving consensus and successful cross-functional partnerships Experience building maintainable and testable code bases, including API design and unit testing techniques",
    "preferred_qualifications": "Machine Learning, Recommendation, LLM, Ranking",
    "compensation": "$56.25/hour to $173,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3465788793562732": {
    "title": "Network Production Engineer (University Grad)",
    "URL": "https://www.metacareers.com/jobs/3465788793562732",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Build experience with Backbone, Data Center, and Network Infrastructure Engineering teams through rotational experiences during your first year Build, manage and maintain multi-vendor, multi-protocol data center and backbone networks Develop optimized network monitoring systems Design, and deploy new network architectures Develop automated methods to mitigate and remediate network events Analyze data to diagnose and identify root causes to network issues Be an active participant in deep technical discussions Develop and maintain consistency within the network infrastructure",
    "minimum_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta Experience with computer networks Experience with UNIX, TCP/IP, network fundamentals, or similar Experience coding in at least one language (Python/Golang/Rust/C++ are all in use) Experience learning new concepts around network design and management Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Knowledge of Switching and Routing concepts and implementation Knowledge of routing protocols BGP, OSPF and ISIS Knowledge of tunneling protocols MPLS, GRE, IPnIP",
    "compensation": "$117,000/year to $137,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}