{
  "818755384116530": {
    "title": "Research Scientist Intern, Vision-Language and Embodied AI (PhD)",
    "URL": "https://www.metacareers.com/jobs/818755384116530",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Plan and execute cutting-edge research on embodied AI algorithms, assistance policies, vision-language models, and world model learning for complex, real-world interaction tasks. Develop, implement, and evaluate methods for improving the performance and interpretability of VLMs and related AI/ML models. Leverage state-of-the-art simulators, RL/DRL, neuro-symbolic, AI planning, robotics, stochastic programming, and multimodal learning methods. Write modular, reusable research code and utilize Meta’s large infrastructure to scale experimentation. Collaborate cross-functionally with researchers and engineers to prototype and test models at scale. Deliver clear, compelling, and creative solutions to challenging problems. Work should result in publishable research in top-tier journals or conferences (e.g., NeurIPS, ICLR, CVPR, ECCV, ICML, ICCV, AAAI, IJCAI, ICRA, IEEE T-PAMI, IJCV, IEEE RA-L etc.).",
    "minimum_qualifications": "Currently has, or is in the process of obtaining, a PhD in Machine Learning, Artificial Intelligence, Computer Vision, Robotics, Speech Processing, Applied Statistics, Computational Neuroscience, Algorithms, Computational Mathematics, or a related field Proven research skills: problem definition, solution exploration, analysis, and presentation of results 2+ years of experience in Python and machine learning libraries (Numpy, Scikit-Learn, Scipy, Pandas, Matplotlib, Tensorflow, Pytorch) Understanding of at least one of the following: embodied AI, reinforcement learning, planning, transfer/few-shot/zero-shot/continual/online learning, self-supervised learning, multi/cross-modal learning, vision-language models, LLM interpretability, world model learning, hand pose estimation, or object pose estimation Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Proven track record of significant results: grants, fellowships, patents, and first-authored publications at leading workshops or conferences (e.g., NeurIPS, ICLR, CVPR, ECCV, ICML, ICCV, AAAI, IJCAI, ICRA, IEEE T-PAMI, IJCV, IEEE RA-L etc.) Experience with VLM/LLM training/fine-tuning and solving traditional CV problems (e.g., hand/body pose estimation, object pose estimation, image classification/segmentation, image/video understanding, 3D scene reconstruction) Experience working and communicating cross-functionally in a team environment Intent to return to the degree program after the completion of the internship/co-op Availability for minimum 16 consecutive week internship",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1330936708766435": {
    "title": "Research Scientist Intern, Multimodal Learning for Robotics (PhD)",
    "URL": "https://www.metacareers.com/jobs/1330936708766435",
    "location": "Redmond, WA • Burlingame, CA • Internship",
    "responsibilities": "Conduct collaborative research on developing CV and tactile based algorithms for both human and robotics data. Develop robotic data pipelines for robotic dextrous manipulation, train models, and benchmark different algorithms. Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results.",
    "minimum_qualifications": "Currently has or is in the process of obtaining a Ph.D. degree in Computer Science, Artificial Intelligence, Robotics, or relevant technical field Experience in computer vision, with active contributions in at least one subdomain (3D reconstruction, hand pose estimation, object pose estimation) and strong familiarity across all Understand state of the art in robotic manipulation control policies, with experience in physics based simulators like Mujoco Experience with Python, PyTorch or JAX, or other related languages Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as Robotics (RSS, ICRA, IROS, CoRL, T-RO, IJRR), Machine Learning (NeurIPS, ICML, ICLR, AAAI, JMLR), and Computer Vision (CVPR, ICCV, ECCV, TPAMI), or similar Experience with multimodal learning including but not limited to tactile data Experience working with robot manipulation Experience with building pipelines with foundation CV models, for example, CLIP, DinoV2 or SAM2 Experience working and communicating cross functionally in a team environment Intent to return to the degree program after the completion of the internship/co-op Availability for minimum 16 consecutive week internship",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}