{
  "789572697272514": {
    "title": "Technical Program Manager",
    "URL": "https://www.metacareers.com/jobs/789572697272514",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Work in the Business Messaging team to drive impactful and critical initiatives to monetize our Meta messaging apps. Partner closely with Engineering, Data and Product teams to define and guide high-level goals and roadmaps, monitor key program performance indicators, communicate progress, and ensure the results contribute to overall company, product, customer, and community experience goals. Leverage data-informed insights to drive new products, initiatives and/or uphold the quality of Meta products. Define functional requirements for new products and features and drive impact by delivering measurable results across a wide range of areas. Anticipate and predict potential issues to the platform, design and build tools to protect against these threats, and implement and enforce these systems at scale to make Messaging a seamless user journey.",
    "minimum_qualifications": "Bachelor’s degree (or foreign equivalent) in Computer Science, Statistics, Applied Sciences, Information Systems or related field and 4 years of work experience in the job offered or in an analyst-related occupation Experience must include 4 years in the following: Data Analysis using Scuba, Unidash, Daiquery or other proprietary tools and visualization tools Relational databases and SQL Building, analyzing and debugging dashboards Building and scaling workflows based on data and insights Technical product/program management experience Deliver tech programs or products from inception to delivery with technical knowledge of the underlying platforms and technologies Establish work relationships across multi-disciplinary teams and multiple partners in different time zones",
    "preferred_qualifications": "",
    "compensation": "$184,476/year to $190,933/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "804442048846979": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/804442048846979",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run Facebook. Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebook's products, create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receiving general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Master’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics or a related field and 2 years of experience in the job offered or in a computer-related occupation Experience must include 2 years in the following: Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Build highly-scalable performant solutions Data processing, programming languages, databases, networking, operating systems, computer graphics, or human-computer interaction Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems Distributed systems",
    "preferred_qualifications": "",
    "compensation": "$203,350/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1012200294365737": {
    "title": "Research Scientist",
    "URL": "https://www.metacareers.com/jobs/1012200294365737",
    "location": "New York, NY • Full Time",
    "responsibilities": "Perform research and develop solutions to computer software and computer hardware problems. Research, design, and develop new optimization algorithms and techniques to improve the efficiency and performance of Meta's platforms. Design and implement large-scale distributed software systems to serve large numbers of complex requests simultaneously and without failure. Utilize technical research background, train new ranking models, and run experiments. Create tools for migrating large bodies of user data across systems for new products, scalability efforts, and development of new core infrastructure. Use machine learning, statistics, or other data techniques to build algorithms. Suggest, collect, and synthesize system requirements from stakeholders and create effective feature roadmaps. Analyze and resolve computer challenges from a system-engineering standpoint. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions.",
    "minimum_qualifications": "Requires PhD degree (or foreign equivalent) in Computer Science, Engineering, Information Systems, Mathematics, Statistics, or a related field Requires completion of a graduate-level course, research project, or internship involving the following: Algorithms, data structures, or systems software Solving analytical problems using quantitative approaches Gathering, manipulating, or analyzing complex, high-volume, high-dimensionality data from varying sources Communicating complex research in a clear, precise, and actionable manner Research in topics closely related to machine learning, NLP, recommendation systems, pattern recognition, signal processing, data mining, artificial intelligence, information retrieval, or computer vision Performing research that enables learning the semantics of data (images, video, text, audio, or other modalities) and advances the technology of intelligent machines Devising better data-driven models of human behavior Developing highly scalable classifiers and tools leveraging machine learning, statistics, regression, rules-based models, or mathematical models",
    "preferred_qualifications": "",
    "compensation": "$258,524/year to $290,180/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1148220083483375": {
    "title": "Software Engineer (Systems)",
    "URL": "https://www.metacareers.com/jobs/1148220083483375",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run applications. Build new features and improve existing products. Work on problems of diverse scope and design core, backend software components. Handle large scale data storage, synchronization and coordination of large server cluster, and provide a runtime environment for front end code. Receiving little instruction on day-to-day work, code using primarily C/C++, Java, PHP and Hack. Interface with other teams to incorporate their innovations and vice versa. Conduct design and code reviews. Analyze and improve efficiency, scalability, and stability of various system resources. Complete medium to large features (each with many tasks) independently without guidance. Identify and drive changes as needed for assigned codebase, product area and/or systems. Telecommuting from anywhere in the U.S. allowed.",
    "minimum_qualifications": "Requires a Master's degree (or foreign equivalent) in Computer Science, Engineering, Applied Sciences, Mathematics, Analytics, or a related field and 36 months of experience in the job offered or in a related occupation Requires 36 months of experience involving the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Designing and completing medium to large software features independently without guidance Owning a particular software component, feature, or system Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Data processing, programming languages, databases, networking, operating systems, computer graphics, or human-computer interaction Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems Distributed Systems",
    "preferred_qualifications": "",
    "compensation": "$245,588/year to $290,180/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1563889517938190": {
    "title": "Data Engineer, Analytics",
    "URL": "https://www.metacareers.com/jobs/1563889517938190",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Design, model, and implement data warehousing activities to deliver the data foundation that drives impact through informed decision making. Design, build and launch collections of sophisticated data models and visualizations that support multiple use cases across different products or domains. Collaborate with engineers, product managers and data scientists to understand data needs, representing key data insights visually in a meaningful way. Define and manage SLA for all data sets in allocated areas of ownership. Create and contribute to frameworks that improve the efficacy of logging data, while working with data infrastructure to triage issues and resolve. Determine and implement the security model based on privacy requirements, confirm safeguards are followed, address data quality issues, and evolve governance processes within allocated areas of ownership. Solve challenging data integration problems utilizing optimal ETL patterns, frameworks, query techniques, and sourcing from structured and unstructured data sources. Optimize pipelines, dashboards, frameworks, and systems to facilitate easier development of data artifacts. Influence product and cross-functional teams to identify data opportunities to drive impact. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions.",
    "minimum_qualifications": "Requires a Master's degree (or foreign equivalent) in Computer Science, Engineering, Information Systems, Mathematics, Statistics, Data Analytics, Business Analytics, Applied Sciences, or a related field and 2 years of work experience in the job offered or in a computer-related occupation Requires 2 years of experience in the following: Features, design, and use-case scenarios across a big data ecosystem Custom ETL design, implementation, and maintenance Object-oriented programming languages Schema design and dimensional data modeling Writing SQL statements Analyzing data to identify deliverables, gaps, and inconsistencies Managing and communicating data warehouse plans to internal clients Python",
    "preferred_qualifications": "",
    "compensation": "$218,284/year to $235,400/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1725681268095134": {
    "title": "Manufacturing Technical Manager",
    "URL": "https://www.metacareers.com/jobs/1725681268095134",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Work with contract manufacturing (CM) partners on yield improvement and process troubleshooting. Work with CM partner to design and layout the FATP (final assembly, test, and pack- out) line by applying lean and Six Sigma technology. Develop manufacturing processes at the factory and drive line qualifications by working with cross-functional teams and CM partners. Work with cross-functional team (HW Engineering, Operations and manufacturing partner teams) to drive ramp and MP readiness. Drive cost and cycle time reduction through line balancing, and line automation. Drive FACA (Failure Analysis Corrective Action) and yield bridge to mass production. Influence product manufacturability, testability, serviceability, reliability, flexibility and cost effectiveness by coordinating cross-functional teams during early development and ramp. In connection with the above duties, apply knowledge and/or skills of: setting up physical production line UPH (Unit per Hour) and Yield Rate improvement Line Layout planning Standard Operation Process establishment Implementing Lean concept to production line AutoCAD Program Management Reviewing Mechanical Design for Manufacturing Establishing Bill of Material and Operating Agile system.",
    "minimum_qualifications": "Master's degree (or foreign equivalent) in Industrial and Operations Engineering or a related field and 2 years of experience in the job offered or in a related occupation Experience must include 2 years in the following: Setting up physical production line UPH (Unit per Hour) and Yield Rate improvement Line Layout planning Standard Operation Process establishment Implementing Lean concept to production line AutoCAD Program Management Design for Manufacturing of Mechanical Products Bill of Material Structure Operating Agile system for Engineering Change and Product Lifecycle Management",
    "preferred_qualifications": "",
    "compensation": "$228,282/year to $231,110/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}