{
  "833432782356431": {
    "title": "Research Scientist Intern, Soft Wearable Tactile Sensors (PhD)",
    "URL": "https://www.metacareers.com/jobs/833432782356431",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Research and develop the next generation of soft wearable technologies. Collaborate with the larger Reality Labs team and provide creative solutions to challenges in soft wearables and sensing technologies. Design, prototype, and characterize novel wearable, acoustics-based sensors. Emphasis on fundamental scientific and engineering questions related to the complex deformation of soft wearable technologies. Communicate or publish research activities and findings to collaborators across a variety of disciplines.",
    "minimum_qualifications": "Currently in the process of obtaining a PhD degree in Mechanical Engineering, Materials Science, Applied Physics, Robotics or relevant technical field 2+ years experience with hardware prototyping, soft wearable technologies, and hands-on experience including but not limited to soft transducers design, manufacturing and characterization Systematic thinking, cross-group collaboration, clear communication Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Demonstrated experience via an internship, work experience, or widely used contributions to open source projects Knowledge of ultrasonics-based non-destructive evaluation Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences and journals such as Science & Nature family of Journals, PNAS, Physical Review Letters, Advanced Materials, Advanced Functional Materials, Experimental Mechanics, Extreme Mechanics, SES, SEM, ICTAM, ASME, MRS, APS, Phononics, or similar Experience working and communicating cross functionally in a team environment Availability for minimum 16 consecutive week internship Intent to return to the degree-program after the completion of the internship/co-op",
    "compensation": "$7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "837627411947285": {
    "title": "Medical Devices, Regulatory Affairs Specialist",
    "URL": "https://www.metacareers.com/jobs/837627411947285",
    "location": "Burlingame, CA • New York, NY • Full Time",
    "responsibilities": "Interact directly with FDA and/or indirectly with international regulatory agencies on most projects/products at reviewer level. All significant issues will be reviewed with the manager Support regulatory compliance activities, including site registration, audits, post-market vigilance reporting, product recalls, etc., as needed Prepare FDA, European and Canada submissions for product changes as required to ensure timely approval for market release. Review significant regulatory issues with manager, as necessary, and resolve submission issues with engineering partners, geography regulatory partners, and regulatory agencies as needed Prepare regulatory strategies/plans and compliance requirements. Provide on-going support to project teams for regulatory issues and questions",
    "minimum_qualifications": "Bachelor’s degree in a scientific discipline or equivalent work experience 3+ years of industry experience in medical device regulatory affairs or related industry Experience working with minimal supervision and under general direction only Experience multitasking, supporting multiple projects, functioning on a global basis, prioritizing, conducting team meetings, and meeting project deadlines",
    "preferred_qualifications": "Master’s Degree in Regulatory Affairs Extensive knowledge of applicable regulations, standards and guidance for medical devices (MDR, MEDDEV, MDCG, IMDRF, FDA QSR, SaMD, cybersecurity, ISO 13485, ISO 14971, IEC 62304, etc.) Technical expertise in software development practices and how to communicate with SW engineers to get required regulatory deliverables Experience with development and regulations for medical devices intended for direct to consumer health wearables RAPS RAC Certification",
    "compensation": "$90,000/year to $137,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1494662195191120": {
    "title": "Display System Engineer",
    "URL": "https://www.metacareers.com/jobs/1494662195191120",
    "location": "Sunnyvale, CA • Redmond, WA • Full Time",
    "responsibilities": "Drive the design and integration of full binocular display systems, including optics, mechanics, calibration, and system interfaces Define sub-system requirements with the product team, then deliver AR/VR hardware, software, and calibration that meets specifications. This may include: hardware (optics, electronics, mechanics, silicon, sensors, data communication), software (computer vision algorithms, calibration, modeling, analysis), and performance analysis Resolve requirements discrepancies and ensure alignment across all engineering disciplines Drive cross-functional engagement with partners to develop concepts and prototypes into manufacturable product hardware Collaborate with product, hardware, software, calibration, integration, and validation teams to deliver AR/VR hardware that meets specifications Lead design verification, testing, and troubleshooting to correlate with optical modeling, metrology, and system performance Influence technical direction and strategy across the organization Mentor and develop engineers and cross-functional partners",
    "minimum_qualifications": "MS or BS in Engineering, Physics, Optics, or related field, or equivalent work experience 10+ years of experience in developing complex optical systems, with at least 5 years in a technical leadership role 5+ years of experience and knowledge of optics three or more of the following: systems design and integration, imaging, illumination, radiometry and photometry, physical and geometric optics, statistics, and polarization Demonstrated expertise in binocular display system design and integration Experience on shipping products with advanced optical systems Collaboration experience and influencing skills",
    "preferred_qualifications": "Experience with full product life cycle launches in AR/VR or wearable display systems Familiarity with display calibration functions and graphics pipelines In-depth knowledge of display optical requirement definitions, characterization and performance optimization",
    "compensation": "$204,000/year to $281,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3982151508715631": {
    "title": "SEO Europe – Market Specialist, Israel",
    "URL": "https://www.metacareers.com/jobs/3982151508715631",
    "location": "Austin, TX • Full Time",
    "responsibilities": "Work as part of the Europe team, enforcing on crisis response within the region Work as part of an On-call Operational structure to enforce on critical content within SEO Markets with a higher focus on Israel Leverage a combination of language proficiency and Israeli market geopolitical knowledge, along with an understanding of local nuances and minority communities, to capture signals and insights that inform the enforcement and resolution of intricate risk and operational issues within the region Scope scalable solutions to improve the support of our community of users in the market and in partnership with other regions Investigate and resolve issues that are reported on Meta products, such as requests for account support and reports of potentially abusive content including but not limited to graphic images, videos and text, offensive or derogatory language, and other objectionable material Support enforcement efforts on agnostic content that originates from multiple sources globally where language expertise is not required Support enforcement efforts identifying integrity risks to our local and regional advertising business and enforce on these risks Support region wide programs of work supporting peak season buying initiatives, protecting advertisers, businesses and removing friction in the ad delivery process Analyze key metrics and collaborate with cross-functional teams to improve our processes and tools Build subject matter expertise around abuse areas prevalent in the region and work with the team on enforcement efforts to manage and control impacts Investigate emerging risk across the region and influence cross functional resolution. Provide input and support on policy recommendations using geopolitical as well as operational understanding with cross-functional partners Liaise closely with our Meta vendor teams to ensure all operational KPIs meet and exceed targets and work collaboratively to improve processes and tools and scale solutions Remain up to date on key workflow changes, operational guidelines, policy updates and our Community Standards Support the training and onboarding of Meta partners",
    "minimum_qualifications": "Bachelors degree and/or Masters or equivalent experience Professional working proficiency in Hebrew and extensive knowledge of U.S. Israeli diaspora is essential as this role will involve working on issues in these languages as well as dealing with external clients in that market 1+ years of professional experience within an operations environment Experience communicating with a variety of audiences and stakeholders from the Israeli market Experience in successfully navigating projects that demand situational analysis and informed decision-making, often involving the evaluation of unclear or ambiguous factors Interest in supporting the Facebook and Instagram community Effective communication and collaboration skills while working closely with cross-functional teams Self-starter with experience of operating in a time-sensitive, ever changing environment",
    "preferred_qualifications": "",
    "compensation": "$34.62/hour to $40.38/hour + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "4419698284933008": {
    "title": "Research Scientist Intern, AI Core Machine Learning (PhD)",
    "URL": "https://www.metacareers.com/jobs/4419698284933008",
    "location": "New York, NY • Internship",
    "responsibilities": "Develop novel state-of-the-art machine learning algorithms and corresponding systems, leveraging various deep learning techniques Analyze and improve efficiency, scalability, and stability of corresponding deployed algorithms Perform state of the art research to advance the science and technology of Machine Learning and Artificial Intelligence Devise better data-driven models for information retrieval, Multi-modal fusion, generation or media understanding (CV, NLP, Speech/ Audio) Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results Contribute to research that can be applied to Meta product development",
    "minimum_qualifications": "Currently has or is in the process of obtaining a PhD degree in Machine Learning, Artificial Intelligence, Computer Science, Information or Multimedia Retrieval, Reinforcement Learning, Mathematics, Signal Processing, or relevant technical field Must obtain work authorization in country of employment at the time of hire and maintain ongoing work authorization during employment Experience with Python, C++, C, Java or other related language Experience with deep learning frameworks such as Pytorch or Tensorflow Experience building systems based on machine learning and/or deep learning methods Research experience with algorithms for sequential decision-making, e.g., planning, reinforcement learning, or similar",
    "preferred_qualifications": "Intent to return to degree program after the completion of the internship/co-op Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as NeurIPS, ICLR, ICML, AAAI, AISTATS, RecSys, KDD, IJCAI, CVPR, ECCV, ACL, NAACL, EACL, ICASSP, or similar Demonstrated experience and self-driven motivation in solving analytical problems using quantitative approaches ML/ AI research and/ or work experience in information retrieval problems, generative approaches, and/ or Natural Language Processing, CV, or Speech/ Audio Experience building systems based on machine learning, reinforcement learning and/or deep learning methods Demonstrated software engineer experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub) Experience working and communicating cross functionally in a team environment",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "24541596912178588": {
    "title": "Cloud Security Engineer",
    "URL": "https://www.metacareers.com/jobs/24541596912178588",
    "location": "Bellevue, WA • Menlo Park, CA • Full Time",
    "responsibilities": "Design, prototype, and implement AI-driven security systems and tools to protect Meta’s products and internal infrastructure Develop and maintain security-focused code, libraries, and frameworks for use by Security Engineers, Analysts, and engineering teams Collaborate with cross-functional partners to deliver scalable, security solutions aligned with company objectives Rapidly experiment with and iterate on specialized security technologies, leveraging AI to address emerging threats and requirements Apply deep security expertise to solve complex challenges, mitigate risks, and mentor other engineers in advanced security domains",
    "minimum_qualifications": "B.S. or M.S. in Computer Science or related field, or equivalent experience 5+ years of experience in designing and implementing security systems, tools, or frameworks Extensive knowledge of attacker tactics, techniques, and procedures Proficiency in coding with experience in languages such as Python, C/C++, Go, or equivalent Experience collaborating with technical and non-technical stakeholders Ability to rapidly prototype and iterate on security solutions",
    "preferred_qualifications": "Experience on securing cloud deployments, IAC (Infrastructure as Code) deployments for cloud (terraform) Experience addressing security problems by building scalable engineering solutions Experience influencing software engineers building security products Experience creating metrics to measure service and program effectiveness and consistency Experience making contributions to the security or privacy community (public research, OSS, blogging, presentations, etc.)",
    "compensation": "$147,000/year to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "31586736230972804": {
    "title": "Technical Program Manager - AI",
    "URL": "https://www.metacareers.com/jobs/31586736230972804",
    "location": "Austin, TX • Menlo Park, CA • Seattle, WA • New York, NY • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Lead and manage multiple concurrent AI agentic automation portfolios and programs, coordinating cross-functional stakeholders and technical teams Partner with Solution Design, People Engineering, and Data Science teams to deliver autonomous, AI-driven HR technology solutions aligned with People@ goals Define and track success metrics for agentic automation initiatives, clearly communicate project impact, and ensure on-time, high-quality delivery Lead the full project lifecycle—including planning, development, launch, stabilization, and user adoption—of large-scale, autonomous AI initiatives Continuously improve processes, documentation, workflows, and system access, proactively identifying opportunities for agentic automation and efficiency Monitor portfolio progress, manage project scope and timelines, facilitate meetings, and ensure clear communication of next steps and responsibilities Engage project sponsors and stakeholders for input, communicate risks and mitigation plans, and provide transparent, timely reporting Apply analytical and strategic thinking to complex problems, evaluating multiple perspectives and recommending optimal, AI-driven solutions Champion an agentic automation and data-driven approach across the organization, influencing solution design and fostering cross-functional collaboration and innovation",
    "minimum_qualifications": "Bachelor's degree in a directly related field, or equivalent practical experience 6+ years of technical program or project management experience, with a focus on AI, automation, or agent-based systems Demonstrated experience leading the development and deployment of AI agentic automation solutions (e.g., autonomous agents, RPA, intelligent process automation) Communication, presentation, and organizational skills with attention to detail Experience working with cross-functional teams, including engineering, data science, and business stakeholders Demonstrated understanding of technical project management, SDLC, and agile/waterfall methodologies Familiarity with modern HR technology platforms (e.g., Workday, ADP, Salesforce) and automation infrastructure Proficiency in leveraging AI, machine learning, and automation to drive business outcomes",
    "preferred_qualifications": "Agile Project Management certification Experience coordinating technical specifications for agentic automation across platforms and disciplines Project Management Professional (PMP) certification (PMI) Cognitive Project Management for Artificial Intelligence (CPMAI) certification or equivalent Hands-on experience with AI agent frameworks (e.g., LangChain, AutoGPT, RPA tools), intelligent process automation, or HR analytics tools",
    "compensation": "$151,000/year to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}