{
  "810412948638953": {
    "title": "Sensor Modeling Engineer",
    "URL": "https://www.metacareers.com/jobs/810412948638953",
    "location": "Sunnyvale, CA • Burlingame, CA • Full Time",
    "responsibilities": "Collaborate closely with cross functional teams and external partners to push the boundaries of technologies and deliver best-in-class hardware solutions Lead efforts to integrate new technologies into high volume consumer products through all stages of product development (from prototyping, design through mass production) Generate analytical models of subsystems and validate them through design of experiments and lab testing Perform static, dynamic, structural and thermal-mechanical analyses to guide design optimization before hardware prototyping Collaborate with vendor resources to leverage their engineers and maximize the focus of internal resources on adding value to and differentiating our product",
    "minimum_qualifications": "BS in Mechanical Engineering, Electrical Engineering, Physics or practical equivalent work experience 8+ years of relevant industry experience or similar Expertise in advanced technologies, including consumer electronics products Experience leading technical teams, cross-functional groups and vendors",
    "preferred_qualifications": "Masters or PhD in Mechanical Engineering, Electrical Engineering, Physics or practical equivalent work experience 8+ years of relevant industry experience with focus on sensor technologies Experience leading efforts to integrate new sensor modalities into high volume consumer products Experience in advanced FEA for capacitive touch, proximity sensing technologies, preferably in consumer electronics products as well as worked in structural and electrostatic analysis with non-linear FEA/FEM Proficient in Abaqus, ANSYS, COMSOL, or other FEA tools Proficient in human body modeling Experience defining sensor performance specifications for a product Experience performing bench level measurements coupled with analytical experience Experience with other sensing modalities such as optical, motion, acoustic/utrasonic and health sensing Experience with lab measurements and factory tests as needed to validate the model and run root-cause analyses Proficiency with data collection and analysis tools including JMP, Python, LabView, MATLAB and other scripting languages Experience communicating novel concepts to a broad audience succinctly and in simple terms",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "847246884651274": {
    "title": "Product Design Engineer (University Grad)",
    "URL": "https://www.metacareers.com/jobs/847246884651274",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Contribute to mechanical solutions as part of a highly cross-functional team Model, build, test, and refine prototypes and characterization test systems Work across the full product development cycle, from concept inception to shipping product Collaborate and manage work with Asia-based supply chain Push state-of-the-art technologies and approaches to solving complex mechanical problems while working with cross functional technical teams Travel to external vendors up to 20%",
    "minimum_qualifications": "Currently has or is in the process of obtaining a Bachelor's Degree in Mechanical Engineering, a related field, or equivalent practical experience. Degree must be completed prior to joining Meta Experience in Design for Manufacturability (DFM), Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, GD&T, and 3D/2D CAD Working knowledge in material properties, such as plastics, metal, adhesive, and glass Testing and analysis experience (FEA, Simulation, Design of Experiments, etc.) Knowledge of high-volume manufacturing techniques (stamping, machining, 3D printing, injection molding, etc.) Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Currently has or is in the process of obtaining a Master's Degree in Mechanical Engineering, a related field, or equivalent practical experience Experience working and communicating cross functionally in a team environment Experience with NX and Teamcenter Experience with highly cosmetic products and working with Industrial Design Experience designing for human factors Fluency in a Mandarin and/or Cantonese language is preferred, as this role reviews regional content where usual language is in a regional language",
    "compensation": "$111,000/year to $131,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1122616986710717": {
    "title": "Regional Environmental Health Safety (EHS) Specialist",
    "URL": "https://www.metacareers.com/jobs/1122616986710717",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Lead, manage, and conduct site assessments, job and task risk assessments, and lead incident investigations to ensure compliance and continuous improvement Collaborate with subject matter experts in areas such as lasers, hazardous chemicals, industrial hygiene, robotics, and occupational safety Partner with Safety Engineering for the successful handover of new equipment and facilities Ensure compliance with all applicable federal, state, and local EHS laws, regulations, and permits Develop, maintain, and execute emergency response plans, serving as an emergency response coordinator when needed Drive continuous improvement efforts focused on learning from incident investigations and corrective action Maintain legal registers, risk registers, and environmental impact assessments, ensuring critical controls are effective and communicated Provide meaningful metrics and reporting to support decision-making by leadership and stakeholders Lead risk management efforts including hazard identification, risk assessments, incident investigations, and corrective actions Champion continuous improvement through audits, inspections, data analysis, and implementation of unique safety and environmental solutions Drive employee engagement and EHS initiatives through communication, training, and leadership involvement Travel up to 25%",
    "minimum_qualifications": "Bachelor’s degree in Occupational Safety, Environmental Science, Engineering, or a related field 10+ years of experience in Environmental Health and Safety, with at least 5 years in a leadership or management role Experience with State specific regulatory requirements",
    "preferred_qualifications": "Professional certifications in Safety, Health, Environment (Certified Safety Professional, Certified Industrial Hygienist, Certified Hazardous Materials Manager, or similiar) Demonstrated collaborator who builds lasting relationships across functions and levels Experience in semiconductor, chemical processing, life sciences, pharmaceutical, or manufacturing environments preferred",
    "compensation": "$142,000/year to $202,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1169739911733910": {
    "title": "Logistics and Aviation Specialist",
    "URL": "https://www.metacareers.com/jobs/1169739911733910",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Lead outreach and business coordination between Global Security Executive Protection and key internal and external partners, such as executive support staff, family offices, the Meta Policy and Communications Teams, event attendees and their staffs, event host staff, etc Provide 24/7, first-class travel-related support and complex project management for executives Coordinate within the executive protection team to ensure all teams have the most accurate and timely information regarding any executive travel Advise Executive Protection personnel on the selection of transportation, accommodation, and travel days Liaise with private and corporate security personnel and local representatives and vendors with a high degree of professionalism and discretion Secure private or commercial aircraft, hotels, rental homes and other specific accommodation needs Draft advance plans and briefing materials, schedule and coordinate site visits and meetings in partnership with administrative and business leads Provide policy and procedural guidance to executives and executive support staff concerning proper protocol requirements for internal and external events Support social functions in connection with executive travel, visits, or events, such as setting up of luncheons, dinners and meetings to ensure reservations, invitations, technology, and security are coordinated effectively and in a timely manner Manage event support, including the selection and approval of internal and external locations for official functions, hotels, and meeting spaces and facilitate the integration of resources and support across a myriad of cross-functional teams Travel globally for advance coordination and walkthroughs, as well as to provide on-the-ground support during executive travel, visits, and events Effectively prioritize and manage multiple simultaneous projects Gather and analyze data to improve methodologies, tools and techniques, enabling the team to scale and optimize operations Develop and maintain relationships with business partners to effectively support their respective departments Foster a respectful team work environment centered on open communication, sharing, listening, and recognition of team members at all levels Accommodate work schedules that include overnights, weekends, and holidays to meet role demands",
    "minimum_qualifications": "Minimum of 7 years of experience in executive travel and event logistics, with demonstrated expertise supporting high-profile executives Proven expertise in planning and executing complex travel and events for executives Demonstrated experience solving logistical challenges while organizing travel for individuals and groups Demonstrated experience in crafting clear and concise emails, reports and documents and engaging with executives, team members, and stakeholders Project management experience encompassing organization, communication, documentation, and cross-functional collaboration Experience in problem-solving and decision-making, thinking critically, and performing proficiently under time sensitive situations Experience quickly learning and mastering new technology Experience working/coordinating with executive protection teams and a solid understanding of security considerations and concerns Experience working with high-profile individuals or in high-risk environments",
    "preferred_qualifications": "Experience with budgeting,metrics, and data-based decision-making Experience collaborating with legal or finance teams in a strict regulatory environment Experience working with corporate or government communications or policy teams Experience with event production Familiarity with aviation safety standards and compliance",
    "compensation": "$109,000/year to $157,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2937175906469152": {
    "title": "Lead Counsel, Intellectual Property (IP) Product",
    "URL": "https://www.metacareers.com/jobs/2937175906469152",
    "location": "Austin, TX • Menlo Park, CA • Washington, DC • New York, NY • San Francisco, CA • Full Time + 4 more • Full Time - Hide",
    "responsibilities": "Evaluate company products and features to provide practical and business-focused advice that manages global IP legal risk Advise on issues of direct and secondary liability arising from copyright, trademark, and other IP and content-related laws (e.g., Digital Millennium Copyright Act (DMCA), Communications Decency Act (CDA), EU Copyright Directive, Digital Services Act (DSA)) Support the development and expansion of AI products and the Metaverse, and lead on IP legal issues across Reality Labs, Facebook, Instagram, Threads, WhatsApp, and Messenger Collaborate cross-functionally with product, engineering, policy, operations, and other business teams, as well as legal colleagues Work with a global network of outside counsel advising on IP issues",
    "minimum_qualifications": "J.D. degree (or foreign equivalent) Active membership in at least one US state bar and eligibility to obtain registered in-house counsel status (if required by the State Bar in the assigned work location) 5+ years of legal experience as a practicing attorney, including at a law firm and/or in-house or government experience Subject matter expertise in IP and related areas, including Copyright and Fair Use, Trademark, Rights of Publicity, and IP licensing Subject matter expertise in global intermediary liability issues and laws, including DMCA, CDA, EU Copyright Directive, and DSA Experience with the evolving global IP regulatory landscape, including legal developments involving AI, direct and secondary liability, and other new IP laws Experience counseling on IP issues relating to new technologies Demonstrated experience to independently and quickly assess legal, practical, and business risks, and provide clear guidance in connection with the same Demonstrated experience to operate proactively, collaborate, and build cross-functional relationships with legal and business partners",
    "preferred_qualifications": "",
    "compensation": "$167,000/year to $233,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3866896473601744": {
    "title": "Global Director of Wearables Marketing",
    "URL": "https://www.metacareers.com/jobs/3866896473601744",
    "location": "Los Angeles, CA • Menlo Park, CA • Burlingame, CA • New York, NY • San Francisco, CA • Full Time + 4 more • Full Time - Hide",
    "responsibilities": "Build, manage, and nurture the marketing team responsible for Wearables portfolio Lead the global marketing strategy, campaign, and program development for the Wearables portfolio Establish partnerships with cross-functional partners including Creative, Product Marketing, Marketing Analytics, Marketing Insights, Product Management, Retail, Media, and more Lead relationships with brand partners and external agencies and create impactful campaign work Demonstrate the effectiveness and efficiency of marketing investment for the business through both short- and long-term measurement, across brand & performance metrics Represent the Marketing team with marketing, Reality Labs, and company-level leadership Proactively detect the largest problems impacting their team's execution and makes decisions that resolve and manage dependencies",
    "minimum_qualifications": "15+ years of experience in marketing, advertising, and brand strategy 8+ years of experience managing consumer marketing teams with experience developing integrated marketing programs for large global brands 5+ years of experience working on consumer technology brands/products Experience partnering with Insights and Analytics to learn, iterate, and evaluate Experience managing global budgets, with a focus on stewarding responsible spend that drives business goals Experience managing brand partner, driving mutual growth and results Experience building and scaling a brand, business, and organization",
    "preferred_qualifications": "Experience in consumer hardware Experience leveraging music, fashion, sports partners to build brands",
    "compensation": "$227,000/year to $296,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}