{
  "703000095538056": {
    "title": "Data Scientist, Analytics",
    "URL": "https://www.metacareers.com/jobs/703000095538056",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Apply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how Facebook users interact with our consumer and business products. Mine massive amounts of data and perform large-scale data analysis to extract useful business insights. Develop data pipelines with automated, machine-learning systems that convert noisy core datasets into powerful signals of user behavior. Building models of user behaviors for analysis or to power production systems. Partner with Product and Engineering teams to solve problems and identify trends and opportunities. Design and implement dashboards and reports that track key business metrics and provide actionable insights. Inform, influence, support, and execute our product decisions and product launches by effectively communicating results to cross functional groups. Work across areas of product operations, exploratory analysis, product leadership, and data infrastructure to help shape the future of what we build at Meta.",
    "minimum_qualifications": "Master's degree (or foreign degree equivalent) in Computer Science, Engineering, Data Science, Analytics, Statistics, Mathematics, or a related field and 2 years of work experience in the job offered or in a related occupation Requires 2 years of experience in the following: Machine learning techniques Working with large data sets and network-based data, including TCP or HTTP ETL (Extract, Transform, Load) processes Large scale data processing infrastructures using distributed systems, including Hadoop, Hive, MapReduce, or MPI Quantitative analysis techniques: clustering, regression, pattern recognition, or descriptive and inferential statistics Communicating and presenting results of data analyses, AND Data mining techniques",
    "preferred_qualifications": "",
    "compensation": "$221,754/year to $235,400/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "803140225654060": {
    "title": "Data Scientist",
    "URL": "https://www.metacareers.com/jobs/803140225654060",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "Apply expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how Meta users interact with our consumer and business products. Mine massive amounts of data and perform large-scale data analysis to extract useful business insights. Develop data pipelines with automated, machine-learning systems that convert noisy core datasets into powerful signals of user behavior. Build models of user behaviors for analysis or to power production systems. Partner with Product and Engineering teams to solve problems and identify trends and opportunities. Design and implement dashboards and reports that track key business metrics and provide actionable insights. Inform, influence, support, and execute our product decisions and product launches by effectively communicating results to cross functional groups. Work across areas of product operations, exploratory analysis, product leadership, and data infrastructure to help shape the future of what we build at Meta. Telecommuting from anywhere in the U.S. allowed.",
    "minimum_qualifications": "Bachelor’s degree (or foreign equivalent) in Information Technology, Computer Science or related field.Requires completion of a university-level course, research project or internship involving the following Relational database (SQL) Developing in scripting language (Python, R) Large scale data processing infrastructures using distributed systems (Hadoop, Hive) Data Visualization (Tableau)",
    "preferred_qualifications": "",
    "compensation": "$165,787/year to $196,900/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1508188276871051": {
    "title": "Software Engineer, Systems",
    "URL": "https://www.metacareers.com/jobs/1508188276871051",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run applications. Build new features and improve existing products. Work on problems of diverse scope and design core, backend software components. Handle large scale data storage, synchronization and coordination of large server cluster, and provide a runtime environment for front end code. Receiving little instruction on day-today work, code using primarily C/C++, Java, PHP and Hack. Interface with other teams to incorporate their innovations and vice versa. Conduct design and code reviews. Analyze and improve efficiency, scalability, and stability of various system resources. Complete medium to large features (each with many tasks) independently without guidance. Identify and drive changes as needed for assigned codebase, product area and/or systems.",
    "minimum_qualifications": "Master’s degree (or foreign degree equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field and 3 years of work experience in the job offered or in a computer-related occupation Requires 3 years of work experience involving the following: Coding in one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Designing and completing medium to large features independently without guidance Experience owning a particular component, feature or system Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Build highly scalable performant solutions Data processing, programming languages, databases, networking, operating systems, computer graphics, or human computer interaction Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems, AND Distributed systems",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2296408887543237": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/2296408887543237",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Work on wearable embedded systems. Implement, debug, test, and optimize camera software stack in system level interacting with HW/HAL blocks.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Software Engineering, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS Implementing, debugging, testing, and/or optimizing video processing pipeline, AND Working with and querying large scale distributed data",
    "preferred_qualifications": "",
    "compensation": "$187,974/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2918246465230271": {
    "title": "Reliability Engineer",
    "URL": "https://www.metacareers.com/jobs/2918246465230271",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Determine reliable mechanical design of our augmented, mixed, and virtual reality products. Understand emerging designs and technologies to develop reliable products free of mechanical defects. Identify mechanical design risks associated with these various technologies and architectures, as well as identifying appropriate stresses that our products must pass and creating mechanical engineering test plans which will be used to assess the reliability of our products. Produce accurate reliability analyses in a timely manner and provide suggestions to improve the reliability of our products. Apply principles of mechanical design to solve failure mechanisms of consumer electronics. Develop and perform reliability tests including mechanical, shock, vibration, environmental, and characterization testing. Develop reliability requirements at system and module level for consumer facing hardware. Lead stress characterization of appropriate usage conditions and document FMEA (Failure Mode Effects Analysis). Develop acceleration models and accelerated tests, new reliability test specifications and procedures, and appropriate test plans. Apply design of experiments (DOE) and conduct in-depth research into applicable failure mechanisms. Contribute to failure analysis and use correct methodology to identify root cause of failures. Oversee reliability testing and analysis through product lifecycle and provide accurate and in-depth statistical analysis. Prepare detailed and concise reliability reports. Collaborate with cross-functional teams to implement mitigations for reliability risks. Apply industry test standards including ASTM, MIL, JEDEC, and IEC. Apply mechanical failure analysis techniques including optical microscopy, X-Ray, CT scan, SEM, EDX, and FTIR. Position requires up to 20% domestic and international travel.",
    "minimum_qualifications": "Master’s degree (or foreign degree equivalent) in Mechanical Engineering, Electrical Engineering, or related field and 5 years of work experience in consumer electronics related reliability engineering occupation Requires 5 years of experience in the following: Mechanical design, material science, and failure mechanisms of consumer electronics Developing and performing reliability tests including mechanical, shock, vibration, environmental, and characterization testing Industry test standards including ASTM, MIL, JEDEC,ISO and IEC Failure analysis techniques including but not limited to optical microscopy, X-Ray, CT scan, SEM, EDX, and FTIR Driving stress characterization of device mission profile usage conditions Leading and documenting FMEA (Failure Mode Effects Analysis) Developing acceleration models and accelerated tests capturing the Physics of Failure, AND Contributing to failure analysis and using correct methodology to identify root cause of failures",
    "preferred_qualifications": "",
    "compensation": "$205,898/year to $231,110/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}