{
  "658710090641708": {
    "title": "Technical Program Manager - Monetization Capacity, Efficiency, Hardware (CEH) Business Processes",
    "URL": "https://www.metacareers.com/jobs/658710090641708",
    "location": "Sunnyvale, CA • Bellevue, WA • Menlo Park, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Establish and lead effective program teams to ensure alignment and achieve common objectives Work closely with engineering and business stakeholders to define program requirements, prioritize initiatives, and establish scope, including shaping the roadmap and long-term strategy for partner teams Create and implement communication strategies to proactively share program status, challenges, and risks with stakeholders Proactively manage cross-functional dependencies, risks, and changes by adjusting scope, schedule, and resources as needed to achieve optimal outcomes Collaborate with cross-functional teams to lead technical analysis, design, development, testing, implementation, and post-implementation phases Establish and monitor key metrics, quality benchmarks, and performance indicators to drive cross-functional execution of program deliverables Anticipate and assess complex, long-term, and critical infrastructure challenges in partnership with engineering leaders and stakeholders Shape product decisions to align with overarching company initiatives Lead internal and external process enhancements across teams and functions, streamlining workflows and minimizing manual efforts through automation",
    "minimum_qualifications": "Bachelor's degree in Computer Science, a related technical field, or equivalent experience 12+ years of experience in software engineering, systems engineering, hardware engineering, or technical product/program management Experience delivering technical programs or products from inception to delivery, with an understanding of user needs, gathering requirements, and defining scope Experience working self-sufficiently across multiple teams, demonstrating critical thinking and providing thought leadership Experience in communicating and collaborating with technical management teams to develop systems, solutions, and products Experience in organizational coordination and building work relationships across multidisciplinary teams and partners in different time zones Experience in analytical thinking and problem-solving for large-scale systems, such as cloud-scale storage systems",
    "preferred_qualifications": "",
    "compensation": "$195,000/year to $267,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "670663656086883": {
    "title": "CFE - Human Factors Design Engineer",
    "URL": "https://www.metacareers.com/jobs/670663656086883",
    "location": "Seattle, WA • Full Time",
    "responsibilities": "Lead 3D scanning and motion capture data collection efforts on current and future VR programs Data acquisition and processing: Capture, clean, and synchronize data from multiple sources (motion capture, 3D scans, CAD, IMU, pressure sensors) with temporal and spatial alignment Operate and manage the VR PDE stability studio (lab) Rapid prototyping and problem solving: Create and modify concept prototypes, fixtures, and testing apparatus using 3D printing and other rapid prototyping technologies",
    "minimum_qualifications": "6+ years of extensive experience in 3D scanning and modeling, with a comprehensive understanding of various 3D scanning technologies Proficient in anthropometric landmarking and skilled in modeling across diverse formats including solid, surface, polymesh, and point cloud Experience with motion captures systems Experience in developing 3D data processing tools and pipelines 2+ years of experience in Human Factors Engineering",
    "preferred_qualifications": "2+ years of experience with motion captures systems (Qualisys, OptiTrack, Vicon) Experience building real time virtual production environments Experience with advanced imaging and sensing technologies such as photometric, structured light, laser, thermographics systems Proficient with FFT and coordinate system transforms Experience working with eye tracking system to track user movement",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1012099654334207": {
    "title": "AI Efficiency Software Engineering Manager",
    "URL": "https://www.metacareers.com/jobs/1012099654334207",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Land massive impact by working on business critical Machine Learning Inference and training systems to enable top company and Monetization priorities and accelerate Revenue Growth for the company Collaborate with cross-functional teams to drive technical innovation and proven experience Working on both 0->1 as well as mission critical scaled systems in the Advertising Infrastructure stack You will have the opportunity and scope for faster career growth through working on projects that impact the company’s topline in an organization with planned growth for the next several halves Foster a work environment of continuous learning, growth, and improvement",
    "minimum_qualifications": "Demonstrated experience recruiting and managing technical teams, including performance management and managing engineers 12+ years, or PhD + 8 years, of software engineering work experience, including technical management BS or MS in Computer Science, Engineering, or a related technical discipline or equivalent experience 2+ years managing managers, 5+ years managing technical teams",
    "preferred_qualifications": "Expertise in large model Training and Optimization for Ads recommendation systems Experienced in launching a new AI accelerator with focus on efficiency improvements at scale Experience in the areas of Performance optimizations and Reliability Interest in making AI Systems more efficient",
    "compensation": "$213,000/year to $293,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1128596106062523": {
    "title": "Data Center Production Operations Engineer",
    "URL": "https://www.metacareers.com/jobs/1128596106062523",
    "location": "Henrico, VA • Eagle Mountain, UT • Houston, TX • Salt Lake, UT • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Work within Meta's ticketing system First point of contact for break fix technicians Responsible for assisting with projects (retrofits, new process details, etc.) and repairs throughout the data center Understand and debug hardware and Linux OS related issues Identify and help create documentation for the global data center knowledge base Assist with process improvements and best practices in data center operations Participate in on-call rotation (once a month on call for a week, after hours, first point of contact)",
    "minimum_qualifications": "Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment Currently has, or is in the process of obtaining, a Bachelor's or Master's degree in technical field, or equivalent experience/certification Knowledge of Linux and server hardware support Working knowledge and experience in at least one of the following core areas: Networking, Programming/Scripting, Hardware, or OS repair Solid communication skills are a requirement for this role",
    "preferred_qualifications": "Working conceptual knowledge of technologies such as HTTP, DNS, RAID, and DHCP Experience modifying and developing in Python, SQL, and/or shell scripting",
    "compensation": "$33.17/hour to $47.60/hour + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1180307684205195": {
    "title": "AI Research Scientist, 3D Machine Learning & Computer Vision",
    "URL": "https://www.metacareers.com/jobs/1180307684205195",
    "location": "Redmond, WA • Burlingame, CA • Full Time",
    "responsibilities": "Research, develop and prototype state of the art ML and software in the domains of World Model/VLA, Long-context & consistent 4D scene understanding, 3D environment and object reconstruction, estimation and understanding of user motion and more Build/integrate real-time prototypes for advanced, real-time 3D machine perception systems as part of a fast-moving research and research engineering team Collaborate with team members throughout the lifetime of a project, from prototyping to deployed products Deliver research results that have a direct impact on Meta and Meta's AI-enabled products",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Currently has or is in the process of obtaining a PhD in the field of computer vision, Machine Learning / Artificial Intelligence, robotics or equivalent Track-record of state-of-the-art publications in the field and at top conferences in the field Experienced in advanced computer vision and ML, thorough understanding of 3D geometry fundamentals as well as state of the art ML/AI models incorporate that Mathematical background and understanding of numerical optimization, linear algebra, probabilistic estimation and 3D geometry 3+ years C++/Python experience with a mastery of modern C++/Python features 3+ years experience with modern ML frameworks Interpersonal experience: cross-group and cross-functional collaboration Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as CVPR/ICCV/ECCV, NeurIPS/ICLR, ICRA/RSS/CoRL/IROS, or SIGGRAPH Demonstrated software engineer experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub) Broad understanding of the state of the art of ML and AI model architectures and training paradigms Experience working on real-time, high-performance systems in robotics, world model, AR/VR, or other areas Experience working in a Linux environment",
    "compensation": "$147,000/year to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1449268306175617": {
    "title": "Technical Engineer",
    "URL": "https://www.metacareers.com/jobs/1449268306175617",
    "location": "Menlo Park, CA • Fremont, CA • Full Time",
    "responsibilities": "Provide support for audio software, equipment, and test devices for over 70 users, ensuring immediate and prioritized follow-up Support relationships with software suppliers, facilitating the team software process from request to fulfillment, distribution, maintenance, and renewals Onboard new audio team members, providing essential software, equipment, and user support Offer hardware support for Creative Audio sound designers, leveraging expertise in specialized studio equipment Act as a key liaison with Meta IT Help desk, troubleshooting and solving studio software and computer-managed machine issues with an understanding of unique audio tools Support the management and maintenance of technically advanced audio systems within the studio environment Provide on-site support for the Fremont and Burlingame studios, ensuring operational effectiveness for Creative Audio teams and cross-functional partners Facilitate studio recording session preparation, offering comprehensive support to first-chair audio and music engineers during collaborative content creation Contribute to the ongoing development and implementation of industry-leading AI-supported production workflows and efficiencies in audio production Support audio engineers and sound designers with mixing preparation and audio asset editing for varied creative projects",
    "minimum_qualifications": "Bachelor's degree or Certificate in audio production, or equivalent work experience 2+ years hands-on experience editing and mixing audio, using Pro Tools 3+ years experience in technical and production support in a professional multi-studio recording facility Mid-level technical knowledge in integrating and troubleshooting professional studio equipment Demonstrated experience installing, testing and troubleshooting computer software, specifically audio-related Hands-on experience implementing and troubleshooting audio visual systems Demonstrated Google Suite and database management skills Task and project management tool experience You possess a unique blend of technical expertise, problem-solving skills, and a drive for innovation in the audio space",
    "preferred_qualifications": "Video recording and remote collaboration knowledge Familiarity with various software coding languages",
    "compensation": "$35.10/hour to $99,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1541605910502087": {
    "title": "Security Detection Engineer, Insider Trust",
    "URL": "https://www.metacareers.com/jobs/1541605910502087",
    "location": "Menlo Park, CA • New York, NY • Full Time",
    "responsibilities": "Design, prototype, and implement AI-driven security systems and tools to protect Meta’s products and internal infrastructure Develop and maintain security-focused code, libraries, and frameworks for use by Security Engineers, Analysts, and engineering teams Collaborate with cross-functional partners to deliver scalable, security solutions aligned with company objectives Rapidly experiment with and iterate on specialized security technologies, leveraging AI to address emerging threats and requirements Apply deep security expertise to solve complex challenges, mitigate risks, and mentor other engineers in advanced security domains",
    "minimum_qualifications": "B.S. or M.S. in Computer Science or related field, or equivalent experience 5+ years of experience in designing and implementing security systems, tools, or frameworks Extensive knowledge of attacker tactics, techniques, and procedures Proficiency in coding with experience in languages such as Python, C/C++, Go, or equivalent Experience collaborating with technical and non-technical stakeholders Ability to rapidly prototype and iterate on security solutions",
    "preferred_qualifications": "Experience in Detection and Response Engineering, or similar Security Engineering role Understanding of data exfiltration risks, insider threat concepts, and basic Data Loss Prevention (DLP) technologies Background in security-focused software engineering, and designing scalable systems and data pipelines used to detect and respond to insider threats Experience with log analysis, and building complex automations and integrations using Security Information and Event Management(SIEM) or Security Orchestration, Automation and Response(SOAR) platforms Experience in technical security investigations and threat hunting including leveraging intelligence data to proactively identify and investigate suspicious behavior across networks and systems Experience analyzing network, application, and host-based security events",
    "compensation": "$147,000/year to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1809611226317844": {
    "title": "Data Center Production Operations Engineer (Second Shift)",
    "URL": "https://www.metacareers.com/jobs/1809611226317844",
    "location": "New Albany, OH • Full Time",
    "responsibilities": "Work within Meta's ticketing system First point of contact for break fix technicians Responsible for assisting with projects (retrofits, new process details, etc.) and repairs throughout the data center Understand and debug hardware and Linux OS related issues Identify and help create documentation for the global data center knowledge base Assist with process improvements and best practices in data center operations Participate in on-call rotation (once a month on call for a week, after hours, first point of contact)",
    "minimum_qualifications": "Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment Currently has, or is in the process of obtaining, a Bachelor's or Master's degree in technical field, or equivalent experience/certification Knowledge of Linux and server hardware support Working knowledge and experience in at least one of the following core areas: Networking, Programming/Scripting, Hardware, or OS repair Solid communication skills are a requirement for this role",
    "preferred_qualifications": "Working conceptual knowledge of technologies such as HTTP, DNS, RAID, and DHCP Experience modifying and developing in Python, SQL, and/or shell scripting",
    "compensation": "$33.17/hour to $47.60/hour + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1869362990670183": {
    "title": "Multimedia Systems Technical Program Manager",
    "URL": "https://www.metacareers.com/jobs/1869362990670183",
    "location": "Sunnyvale, CA • Redmond, WA • Burlingame, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Develop and manage end-to-end technical product solutions and ensure on-time delivery Manage and own cross-functional products and programs execution in a matrix organization Drive and influence technical and product strategy, proactively identify risks and develop mitigation strategies, align on priorities, and set direction for a broadly cross-functional area Help define the roadmap and long-term strategy of the teams that you are working with Design measurements to track impact and drive internal process improvements Covey technology, requirements, goals and milestones of your team Collaboratively define the vision for building Meta-scale, state-of-the-art, global products Develop and manage end-to-end project plans to ensure on-time delivery, provide day-to-day coordination, and quality assurance for tasks Move fast in a flat organization by working in concert with technical program managers, product managers and engineers across Meta to establish a shared vision for improving execution and building solutions Ongoing communication of planning, project status, issues and risks in a timely fashion to stakeholders Help drive product decisions to align with higher company initiative Establish shared goals with product teams across the company to build alignment across multiple cross-functional teams and to build and scale products for Meta",
    "minimum_qualifications": "B.S. in Computer Science, Robotics or a related technical field, or equivalent experience 7+ years of experience in software engineering, systems engineering, or technical product/program management Knowledge of hardware development for early stage devices and product development processes Proven experience delivering complex technology programs and/or products from inception to delivery Proficiency in understanding user needs, gathering requirements, and defining project scope to ensure alignment with business objectives Experience operating across multiple teams, with demonstrated critical thinking and thought leadership Experience in defining and optimizing engineering processes at scale Experience shaping strategy/direction and identifying new opportunities for impact across products, platforms, and programs Experience communicating effectively at the executive level and influencing leadership and technical management teams to develop systems, solutions, and products",
    "preferred_qualifications": "Experience working on the Camera system/features for consumer electronic or commercial devices Experience working on the Graphics/Display pipeline for consumer electronic devices Experience working on the Audio system and related features on consumer electronic or commercial devices Experience working on the Software Multimedia stack for consumer electronics devices",
    "compensation": "$134,000/year to $196,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "4227607177507214": {
    "title": "Preconstruction Manager",
    "URL": "https://www.metacareers.com/jobs/4227607177507214",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Serve as a People Manager responsible for leading, developing, and empowering a team of Individual Contributor Preconstruction Managers, each responsible for distinct data center project scopes within the Preconstruction Organization Foster an efficient team built on collaboration, accountability, and continuous improvement Provide coaching, performance feedback, and career development for team members, aligning their growth with organizational priorities and evolving business needs Drive consistency and knowledge-sharing across product-aligned preconstruction teams to ensure scalable best practices and operational diligence Lead and be accountable for the successful execution of multiple preconstruction program designs — from concept through contract execution — ensuring alignment of cost, schedule, scope, and constructability objectives across internal and external partners Manage complex, large-scale commercial agreements through design kickoff to construction start, including coordination of multiple team inputs, evaluation and allocation of risk, and incorporation of commercially responsible terms into contracts Establish and oversee reporting mechanisms for portfolio-level preconstruction health, including budget, schedule, and risk, and communicate key insights to leadership Drive alignment between design, engineering, and construction stakeholders to ensure readiness for execution and continuity of strategy across all projects in the program Partner with Design, Engineering, Planning, and Estimating teams to translate technical scope into executable preconstruction strategies, budgets, and schedules for new and evolving data center designs Lead “bid leveling” and commercial analysis efforts to evaluate partner proposals and make award recommendations based on scope completeness, cost competitiveness, and execution strategies Provide constructability input and influence design and delivery strategies to optimize total cost of ownership, risk mitigation, and execution efficiency Support the development of build strategy and supply chain frameworks — including vendor qualification, procurement roadmap, and contracting models — for new and existing programs Collaborate closely with Contracts Management and Execution teams to ensure continuity of commercial intent, change management accountability, and feedback loop integration from lessons learned Lead or contribute to the development and rollout of new preconstruction processes, tools, and reporting mechanisms to support program scalability and consistency Champion proactive change management practices that integrate preconstruction insights into ongoing design and contract development Maintain a network of qualified external partners and monitor industry trends, market dynamics, and labor availability to inform strategic planning and partner engagement",
    "minimum_qualifications": "Bachelor’s degree in construction management, or equivalent technical degree and/or minimum of Fifteen (15) years direct professional experience in Commercial Management, Construction Management or equivalent Effective communication and coordination skills to lead a team of various backgrounds and experience towards a single project outcome Familiar with large capital programs, ground-up construction and greenfield site development as well as retrofit construction Proficiency in all aspects of Preconstruction: Budget Development, Scheduling, Change Management, Risk Management, Negotiation, etc",
    "preferred_qualifications": "People Management experience is preferred Mission Critical/ Data Center experience is preferred",
    "compensation": "$171,000/year to $231,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "24308030212183826": {
    "title": "Research Scientist Intern, Robotic Control Policy (PhD)",
    "URL": "https://www.metacareers.com/jobs/24308030212183826",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Conduct collaborative research on developing control policies for a range of robotics platforms. Implement frameworks to train state-of-the-art machine learning control policies such as Large Behavioral Models, Imitation Learning, and Reinforcement Learning. Develop robotic data collection pipelines for robotic dextrous manipulation, train models, and benchmark different algorithms. Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results.",
    "minimum_qualifications": "Currently has or is in the process of obtaining a Ph.D. degree in Computer Science, Artificial Intelligence, Robotics, or relevant technical field Understand state of the art in robotic manipulation control policies, and advancing the technological frontier in an impactful and efficient way Experience with RoS, Python, PyTorch or JAX, or other related languages Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Experience with modern control policies like reinforcement learning, imitation learning, and large behavioral models Familiarity with modeling and analysis used in robotics including kinematics, dynamics, motion planning, perception, task planning, and control theory Experience working with robot manipulation Experience learning policies from human demonstrations with wearable devices Experience working and communicating cross functionally in a team environment Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as Robotics (RSS, ICRA, IROS, CoRL, T-RO, IJRR), Machine Learning (NeurIPS, ICML, ICLR, AAAI, JMLR), and Computer Vision (CVPR, ICCV, ECCV, TPAMI), or similar Intent to return to the degree program after the completion of the internship/co-op",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}