{
  "2784187088452787": {
    "title": "Integrity Operations Manager, Organic Content",
    "URL": "https://www.metacareers.com/jobs/2784187088452787",
    "location": "Washington, DC • Full Time",
    "responsibilities": "Provide mentorship, guidance and career development to members of your team, including managers and/or individual contributors Establish team goals and work with direct reports on strategies for executing, measuring progress and sharing results Track and analyze key operational and performance metrics, identify trends, and develop solutions to optimize team workflow and introduce new workflows to improve efficiency Understand top safety abuse concerns, quality, or customer insight data, and support your team in making recommendations to improve our product, policies, and procedures to keep the platform safe Develop and maintain partnerships with global cross-functional teams including Operations, Policy, Product, and Legal to problem solve and develop solutions Directly manage large projects and coordinate across all stakeholders (internal and external) as needed to ensure the right execution, communication and resources are in place to deliver the key milestones Regularly communicate and interface with leadership and global executives in crisis management situations Actively engage as a member of a Global Operations global leadership team for cross-cutting operational and people initiatives Address sensitive content issues, including but not limited to graphic images, videos and writings, offensive or derogatory language, and other objectionable material",
    "minimum_qualifications": "BA/BS degree 8+ years of experience working in large-scale operations, domains such as online operations, informational systems, analytics, product, risk management, or management consulting 2+ years of people management experience with proven track record of attracting, scaling, and developing teams Demonstrated experience influencing across functional boundaries and/or globally, and experience communicating and influencing across a variety of audiences Analytical and problem-solving experience",
    "preferred_qualifications": "3+ years experience in the Trust & Safety space Experience managing managers and/or individual contributors Experience working with highly sensitive graphic content",
    "compensation": "$116,000/year to $168,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}