{
  "790188013642003": {
    "title": "Data Operations Manager",
    "URL": "https://www.metacareers.com/jobs/790188013642003",
    "location": "Redmond, WA • Burlingame, CA • Full Time",
    "responsibilities": "Drive cross-functional collaboration to converge on scalable data collection and annotation solutions Develop a software and metrics strategy to enable large scale data collection and labelling of human demonstration, teleoperation, and simulation Ensure compliance with safety and EHS requirements Track, analyze, and improve performance and efficiency of operators and annotators (internal and external) working through others Lead and run Monthly Business Reviews to report metrics and progress to leadership",
    "minimum_qualifications": "Bachelor’s degree or equivalent experience in Engineering, Science, or a relevant technical field 12+ years of experience in Technical Program Management Experience leading large-scale, cross-functional initiatives Experience in data operations, annotation, and workforce management in a technical environment Experience collaborating with research, engineering, safety, and operations teams Experience leading, driving strategic planning, and communicating Experience of solving complex problems and embracing ambiguity to drive innovative and impactful solutions",
    "preferred_qualifications": "Masters degree or equivalent experience in Engineering, Science, or a related field Experience working in a highly collaborative, cross-functional environment while communicating complex concepts clearly and succinctly Experience with navigating highly ambiguous, startup initiatives Experience optimizing design of existing products or devices",
    "compensation": "$195,000/year to $267,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "804358345723099": {
    "title": "Reliability Engineer",
    "URL": "https://www.metacareers.com/jobs/804358345723099",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Develop and execute reliability test plans and validation processes Define reliability metrics and reporting standards for the program Analyze failure modes, perform root cause analysis, and drive corrective actions Collaborate with design, test, and manufacturing teams to improve reliability Establish processes for proactive risk identification and mitigation",
    "minimum_qualifications": "Bachelor’s degree or equivalent experience in Engineering or a related field Experience collaborating across design, test, and manufacturing functions 5+ years of experience in reliability engineering, testing, and validation Experience with analytical thinking and problem-solving skills Experience developing reliability processes and metrics",
    "preferred_qualifications": "Masters degree or equivalent experience in Engineering, Science, or a related field Experience working in a highly collaborative, cross-functional environment while communicating complex concepts clearly and succinctly Experience with working in an ambiguous environment to solve problems Experience optimizing design of existing products or devices",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "810959468249252": {
    "title": "Product Design Engineering Manager",
    "URL": "https://www.metacareers.com/jobs/810959468249252",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Lead a team of engineers developing complex consumer hardware devices, providing technical guidance and oversight Collaborate with recruiting staff to expand the team through conferences, events, and onboarding new employees Develop comprehensive plans for prioritizing technical and resourcing challenges by understanding technical architectures, long-term and short-term planning, hardware roadmapping, and other key issues Regularly assess employee performance, address under-performance, and recognize and promote team members Foster effective collaboration between teams by partnering with product management, technical program management, manufacturing, operations, and other engineering groups Support engineer career development by assigning projects tailored to their skill levels, strengths, and work styles, and promoting long-term skill growth Travel domestically and internationally (up to 10%) to support builds, meet with suppliers, and work with multi-site hardware teams Work effectively with cross-functional teams, including UX, ID, manufacturing, reliability, and others",
    "minimum_qualifications": "BS in Mechanical Engineering or equivalent degree 8+ years of experience shipping consumer products, with an in depth foundation in mechanical engineering fundamentals 3+ years of team management experience, leading mechanical engineers Experience leading hardware teams to ship consumer devices and be inspired about building and developing high-performing teams Proven experience collaborating with Asian contract manufacturers and suppliers, both remotely and on-site Skilled in tackling ambiguous issues, providing strategic direction, and applying conceptual thinking Proficient in state-of-the-art mechanical design and simulation tools, prototyping tools, manufacturing technologies, and materials Experience driving technical contributions to innovation-driven product design teams Demonstrated skill in communicating technical information to stakeholders, driving understanding and buy-in",
    "preferred_qualifications": "",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "812449874977786": {
    "title": "Construction Manager, Leased",
    "URL": "https://www.metacareers.com/jobs/812449874977786",
    "location": "Menlo Park, CA • Remote, US • Full Time",
    "responsibilities": "Manage the construction, commissioning, and turnover of a Data Center within a campus Manage the budget associated with the project Manage the cost change process and negotiate best pricing Manage the schedule and associated risks to ensure reliable and predictable turnover dates Maintain knowledge of the market and support site selection team in developing strategic partnership with the key stakeholders Manage multiple, simultaneous Data Center (DC) construction projects at strategic and project levels from inception through construction completion in alignment with Meta’s Basis of Design Work with Site Selection on early access date coordination and managing basebuild schedule updates from key external stakeholders Support the creation of preliminary construction schedules and cost estimates with high level resource planning and stakeholder coordination Manage warranty and tenant improvement work in the live environment when/as necessary Communicate upward regarding the status and risks of the project Negotiate vendor and contractor contracts and purchase orders as needed Mitigate risk for the project through pre-planning, innovative planning, and partnership Develop cost savings solutions and identify project savings/underruns early Partner with the General Contractor, external key stakeholders and other Vendors to collaborate Partner with Internal Cross Functional Partners to collaborate Coordinate needs and asks with the Procurement/Sourcing group(s) to support the needs of the Project Support the pre-construction efforts for upcoming projects Promote prefabrication strategies Support the development of Capital Project Budgets and Constructions ROMs Support the Lease Delivery Manager with lease campus-wide book of work including contractor, designer, and vendor management Support the on-site inspection process to ensure a zero punch-list and an expeditious turnover to FacOps Support the local DC Ops team and other cross-functional departments as needed Promote and model an attitude of continuous improvement, partnership, and teamwork in behaviors and communications Support and lead an industry leading safety program Promote and model an attitude of openness to giving, seeking, and receiving 360-degree feedback 50% travel to headquarters and other Meta sites Respond on an as-needed basis to emergencies",
    "minimum_qualifications": "10+ years of work experience in construction management General knowledge of electrical and mechanical systems Knowledge of industry standards, building codes and safety standards including fire protection regulations Knowledge of capital budget management Negotiation skills and experience providing solutions to problems Familiar with P6 Proficient working knowledge of MS Word, Excel, and PowerPoint Proficient working knowledge of Bluebeam",
    "preferred_qualifications": "Bachelor's degree in Construction Management, Civil Engineering or equivalent degree and/or minimum of 12 years direct experience in project planning and construction management Construction Management experience in the Lease/Colo market and live environment retrofit scopes of work Experience reviewing/editing lease agreements, amendments and work letters Connectivity Cabling and Data Center Construction Experience Multi-Project experience in large scale construction management, mission critical or infrastructure preferred Unifier software experience Procore software experience BIM 360 software experience MS Visio and Google Cloud experience Building Environment Accreditations (i.e. LEED, SITES, TRUE, WELL)",
    "compensation": "$144,000/year to $201,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1165738908795859": {
    "title": "Component Quality Engineer, AI Accelerator",
    "URL": "https://www.metacareers.com/jobs/1165738908795859",
    "location": "Fremont, CA • Full Time",
    "responsibilities": "Responsible for managing end-to-end quality, working closely with suppliers and internal teams to assure new product readiness and ensure performance meets the key Facebook quality and reliability metrics Responsible for Supply Chain and Data Center quality excursion management through root cause analysis while driving implementation and validation of process improvement and corrective actions Develop and implement component quality programs including continuous quality improvement initiatives Use reliability prediction tools and techniques to evaluate product reliability performance on new products Perform regular audits of manufacturing facilities Monitor supplier’s adherence to new product introduction schedules to ensure predictable and stable mass production volume ramp Conduct supplier capability and technology roadmap assessments to assist supply chain and hardware teams in vendor selection Create and maintain all production process and quality documentation Review all supplier product, process and engineering change notifications 10% International travel may be required",
    "minimum_qualifications": "BS Electrical Engineering or Computer Science, or equivalent 5+ years experience in advanced silicon product design, fabrication, test, reliability or product engineering Experiences with AI accelerators and GPU validation, functionality, test and reliability. Experience with chiplet based products Knowledge of reliability mechanisms and modeling/predictive fail rate analyses Proven understanding of quality systems, audit experience and knowledge of statistical quality tools to drive and assist suppliers in continuous improvement initiatives Experience working with and managing offshore contract manufacturers",
    "preferred_qualifications": "",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1233844264859982": {
    "title": "Product Design Engineering Manager",
    "URL": "https://www.metacareers.com/jobs/1233844264859982",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Manage a team of Product Design Engineers Identify key roles required for team success and recruit top talent into Reality Labs Provide team guidance, regular feedback, education, coaching and mentoring Create career development plans, manage performance, create performance reviews Collaborate with leadership team and design partners to define compelling products and the processes needed to create them Perform architecture and design reviews to ensure hardware quality Collaborate across multiple engineering disciplines in a team environment",
    "minimum_qualifications": "3+ years of experience managing design teams for high-volume consumer products or equivalent experience 3+ years of experience managing engineering teams through product development cycles or equivalent experience 8+ years of experience in mechanical product design Experience in mass production, working with both domestic and overseas manufacturing BS in Mechanical Engineering, Material Science or equivalent",
    "preferred_qualifications": "Experience using handheld and wearable electronics Experience with various tooling processes with metal and composite materials",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1292386755909341": {
    "title": "Thought Leadership Lead",
    "URL": "https://www.metacareers.com/jobs/1292386755909341",
    "location": "Menlo Park, CA • New York, NY • San Francisco, CA • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Lead thought leadership programming for Meta's largest cross-company events and programs Drive programming strategy at large events and programs that support product launch goals Manage external agency vendor for speaker placement, pitching and logistics Work with other marketing and company functions (Communications, Sales, Product, among others) to establish the best programming approach for Meta Store strategy and activations Create bespoke partnerships with key industry organizations to foster connections and build programming for consumers interested in Meta technology Establish and manage an executive speaking program aligned to product opportunities and priorities, including identifying, vetting and securing speaking opportunities Assemble and manage an internal tiger team to deliver and produce content Support the wider Industry Marketing team on our thought leadership programming needs at internal and external events",
    "minimum_qualifications": "12+ years of thought leadership programming experience, driving consumer-facing marketing programs Understanding of the technology landscape and new product launches as it relates to marketing and customer experiences—and of key challenges History of relationship-building, particularly with industry thought leaders, industry organization leaders, and decision makers Experience in developing and producing successful industry marketing programs (identifying and securing speaking engagements, developing and driving strategic positioning and messaging, etc.) Skilled when it comes to working cross-functionally and building long-lasting relationships with key stakeholders",
    "preferred_qualifications": "Experience working as a content or event programming producer",
    "compensation": "$180,000/year to $252,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1337112857951911": {
    "title": "Software Engineer, Meta Horizon Engine - Reality Labs",
    "URL": "https://www.metacareers.com/jobs/1337112857951911",
    "location": "Bellevue, WA • Burlingame, CA • Full Time",
    "responsibilities": "Set direction for one or more engine systems, accurately anticipating new technology changes and product needs Own and implement the hardest parts of the system, while leading and growing the engineers around you Profile and optimize real-time systems to ensure performance under demanding content, resource, and thermal budgets Set a high quality bar to keep the engine easy and delightful for developers to use Engage in depth collaboration with partner teams to drive successful product outcomes",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 6+ years software development experience in industry settings or PhD with 4+ years of experience Experience with C++ and/or C Experience in communicating effectively with a broad range of stakeholders, collaborators and clients, at different levels",
    "preferred_qualifications": "Demonstrated experience leading one or more real-time engine components (e.g. Simulation, Performance, Networking, Audio, Assets) for a AAA engine (Unreal, Frostbite, Unity 3D, or other/proprietary AAA) Experience building for multiple hardware platforms (e.g. PC, Console, MR/VR, Cloud, mobile) Experience with performance optimization of real-time applications Experience developing SDKs or shared technology that balances the needs of multiple shipping products Proven understanding of 3D math, linear algebra and physics",
    "compensation": "$213,000/year to $293,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1354049663026414": {
    "title": "Technical Program Manager, Wearables Base Platform Software",
    "URL": "https://www.metacareers.com/jobs/1354049663026414",
    "location": "Redmond, WA • Seattle, WA • Full Time",
    "responsibilities": "Drive cross-organizational and portfolio partners to own and execute several large-scale workstreams to meet goals, building partnerships with managers and engineers across infrastructure and product teams, with a specific focus on software release planning and execution for hardware manufacturing Bootstrap programs in ambiguous areas, requires managing multiple cross organization or cross company interdependencies related to manufacturing software Monitor and report on program progress, including risks and issues, and take necessary actions to mitigate them, particularly for assessing the readiness of software used to validate new hardware devices Demonstrate end-to-end ownership and thought leadership across multiple organizations, influence strategic direction impacting long-term plans for critical infrastructure challenges in collaboration with engineering leaders and stakeholders, with an emphasis on manufacturing software readiness Resolve conflicts, maintain clarity on priorities and drive progress on execution of software releases Resolve intra-organizational issues and escalate or drive solutions to cross-organizational issues related to release schedules and dependencies Drive with technical expertise within the team, coordinating and contributing to engineering deliverables for software releases Collaborate with multiple teams to drive technical analysis, design, development, testing, implementation, and post-implementation phases for software releases Capacity to travel internationally to align with manufacturing partners and in support of line bringup",
    "minimum_qualifications": "B.S. in Engineering or a related technical field 10+ years of experience in software engineering, systems engineering, or technical product/program management, with an emphasis on embedded software development Proven experience delivering complex technology programs and/or products from inception to delivery Proficiency in understanding user needs, gathering requirements, and defining project scope to ensure alignment with business objectives Experience operating across multiple teams, with demonstrated critical thinking and thought leadership in a release management context Experience in defining and optimizing engineering processes at scale Experience shaping strategy/direction and identifying new opportunities for impact across products, platforms, and programs, with a focus on improving development efficiency and quality Experience communicating effectively at the executive level and influencing leadership and technical management teams to develop systems, solutions, and products, especially regarding manufacturing line readiness and risk",
    "preferred_qualifications": "Experience working in consumer electronics manufacturing environment as an OEM representative Experience working with external software and silicon vendors to support BSP intake and defect management",
    "compensation": "$167,000/year to $230,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1355687169545079": {
    "title": "Component Quality Engineer, Power",
    "URL": "https://www.metacareers.com/jobs/1355687169545079",
    "location": "Fremont, CA • Full Time",
    "responsibilities": "Responsible for managing end-to-end quality, working closely with suppliers, ODMs and internal teams to assure new product readiness and ensure performance meets the key Facebook quality and reliability metrics Responsible for quality excursion management through root cause analysis while driving implementation and validation of process improvement and corrective actions Develop and implement quality programs including continuous quality improvement initiatives Perform regular audits of manufacturing facilities Use reliability prediction tools and techniques to evaluate product reliability performance on new products Conduct supplier quality and technology roadmap assessments to assist supply chain and hardware teams in vendor selection Review all supplier product, process and engineering change notifications 20% International travel may be required",
    "minimum_qualifications": "BS in Electrical Engineering or related technical field 6+ years’ experience in design, fabrication, test, application, or product engineering of Power Systems In-depth understanding of Power product validation, functionality, test and reliability Experience performing design of experiment, root cause analysis and resolve problems on a conceptual and advanced troubleshooting level Experience working with and managing offshore contract manufacturers",
    "preferred_qualifications": "",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1504468224039230": {
    "title": "Developer Advocate, AI Agents",
    "URL": "https://www.metacareers.com/jobs/1504468224039230",
    "location": "Bellevue, WA • Menlo Park, CA • New York, NY • Full Time + 2 more • Full Time - Hide",
    "responsibilities": "Advocate for and build alignment for AI agent tools and proposals within Meta's internal developer community Create code samples, demos, prototypes, articles, and tutorials to engage internal technical audiences and promote our AI agent tools Establish credibility with internal stakeholders as a thought leader to enable collaboration and common goals in the AI agent space Collaborate with internal teams to understand and support strategies for building and engaging the internal developer community around AI agent tools Grow, manage, and maintain a well-received internal profile with Meta's developer community at large regarding AI agent tools",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 8+ years of software engineering or developer relations experience Demonstrated technical digital content, communication, and presentation skills Experience leading, building, and supporting developer tools, SDKs, APIs, or platforms Proven experience collaborating across engineering, product, and user communities Demonstrated experience leveraging data and analytics to understand developer needs and measure effectiveness of advocacy efforts Experience advocating for developer needs and demonstrated impact in driving adoption of technical solutions 1+ years of experience using GitHub Copilot, Claude Code, Cursor, or other AI-assisted development tools",
    "preferred_qualifications": "Subject matter expertise on agentic orchestration patterns like ReAct, tool use (or function calling), memory, etc Experience building AI-assisted tools either custom or with technologies like LangChain, LlamaIndex, Haystack, etc Experience presenting at industry conferences or creating technical blogs/articles Contributions to relevant open-source projects",
    "compensation": "$173,000/year to $247,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1990302721764096": {
    "title": "Product Manager - Business Payments",
    "URL": "https://www.metacareers.com/jobs/1990302721764096",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Responsible for leading a product area defining success metrics, prioritizing product problems and identifying the best strategies for the product, aligned with the organizational goals. Adapt and adjust your strategy to reflect learnings and changes in the product Work with a cross-functional team to define a product, develop a roadmap and drive progress against goals and milestones and resolve challenges and blockers, while maintaining team health Gather and analyze user research and market analysis to inform product decisions and influence the wider product organization Coordinate proactively across partner functions for product success. Structure shared roadmaps for best outcomes Communicate product strategy and progress with clarity to all stakeholders Provide mentorship and coaching to other Product Managers and cross-functional team members where appropriate",
    "minimum_qualifications": "5+ years of relevant industry experience with at least 2 years in Product Management Bachelor's degree (or relevant degree equivalent): STEM subject ideal but not essential (Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences) Experience working with a cross-functional product team on a significant product area: Crafting product vision and strategy, defining product requirements, coordinating resources from other groups (marketing, legal, etc.), and driving the team to achieve key milestones and goals Experience managing a product through multiple product life cycle phases Proven experience to drive a material change in the performance of a product and the effectiveness of the team that delivers that product Demonstrated experience to analyze large scale, complex data sets and making effective decisions based on data Experience integrating a diverse set of requirements from a broad set of users as well as context into a single coherent product strategy Experience leading and motivating a product team and collaborating with partner teams Demonstrated experience in communication, bringing extreme clarity to complex messages",
    "preferred_qualifications": "Payments experience",
    "compensation": "$142,000/year to $201,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1995748597944877": {
    "title": "Technical Program Manager - Systems Software",
    "URL": "https://www.metacareers.com/jobs/1995748597944877",
    "location": "Redmond, WA • Full Time",
    "responsibilities": "Create clarity and alignment on the goals of prototypes Develop and drive technical specifications of prototypes Resolve issues and unblock the team in development of software for prototypes Management of stakeholders and executives Communications of progress, status and issues",
    "minimum_qualifications": "B.S. in Computer Science, Robotics or a related technical field, or equivalent experience 7+ years of experience in software engineering, systems engineering, or technical product/program management Knowledge of systems software development for early stage devices and product development processes Proven experience delivering complex technology programs and/or products from inception to delivery Proficiency in understanding user needs, gathering requirements, and defining project scope to ensure alignment with business objectives Experience operating independently across multiple teams, with demonstrated critical thinking and thought leadership Experience in defining and optimizing engineering processes at scale Experience shaping strategy/direction and identifying new opportunities for impact across products, platforms, and programs Experience communicating effectively at the executive level and influencing leadership and technical management teams to develop systems, solutions, and products",
    "preferred_qualifications": "Significant technical experience in early stage research prototypes and robotics Experience working in large scale Research efforts Experience working with systems software or firmware",
    "compensation": "$167,000/year to $230,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2307605463004630": {
    "title": "Product Quality Engineer",
    "URL": "https://www.metacareers.com/jobs/2307605463004630",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Define, document, implement, and maintain a Product Quality Plan (PQP) that documents quality control requirements for manufacturing the product, component or module. Includes details on Incoming Quality Control (IQC), In-Process QC (IPQC), Outgoing QC (OQC), and Quality Audits Analyze, and resolve Product Quality issues impacting factory, supply chain, or field using Quality tools and Failure Analysis techniques Qualification of manufacturing processes in development and mass production. Qualification requires measurement and analysis of the process capability - dimensional, functional, and cosmetic Specification review and setting with cross functional partners - cosmetic, dimensional and functional Assessing, selecting, and collaborating with suppliers while ensuring adherence to quality standards and product quality plans (PQP) Establish and maintain traceability throughout the hardware product supply chain Work closely with internal Meta teams and external vendors to improve functional and cosmetic yields, utilizing various tools and techniques Analyze test data using statistical methods to identify issues and ensure compliance",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 5+ years working experience within product quality engineering Experience working with minimal guidance Experience with Quality tools Experience debugging hardware failures and identifying root cause in either consumer electronics, aerospace, automotive, medical devices products or related industry",
    "preferred_qualifications": "Experience with Asia high volume manufacturing Statistical analysis Expertise with Quality Analysis tools such as (8D, PFMEA, Fishbone, RC/CA, etc)",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2645851222417447": {
    "title": "Tooling Engineer",
    "URL": "https://www.metacareers.com/jobs/2645851222417447",
    "location": "Sunnyvale, CA • Full Time",
    "responsibilities": "Lead the design and development of new plastic injection mold tooling to meet strict part and assembled device requirements Collaborate with product designers to improve the manufacturing feasibility of plastic, rubber and metal parts using your extensive tooling experience as well as industry best practices Collaborate with tooling suppliers in the design, manufacturing and qualification of world class tooling, as well as supporting molding process development Collaborate with our cross functional team in the selection of materials to meet performance, dimensional and cosmetic requirements Ongoing cooperation with our tooling suppliers to continuously improve tooling designs, tool manufacturing techniques and molding processes based on optimization trials, and DOE results to guide informed decisions Provide guidance in the selection of machinery and equipment to improve the performance and consistency of our suppliers Identify disruptive technologies in all phases of tool design, tool manufacturing and part creation, and work to implement them into mass production Experience with a wide range of molding techniques including insert molding, 2 shot molding, metal injection molding, die casting, transfer molding, liquid silicon molding and thermoforming Travel (Up to 25%) to overseas vendor sites to help drive tool and part optimization",
    "minimum_qualifications": "Bachelors degree in Engineering (Plastics, Materials, Mechanical, Process) or equivalent industry experience 10+ years tooling design and manufacturing experience Previous experience with designing and/or manufacturing tooling for high volume, tight tolerance consumer electronics products or similar Understanding of SPC, DOE, GD&T principles Experience with 3D CAD design software, FEA and mold filling simulation software Experience with a variety of commodity and engineering grade thermoplastic and thermoset resins Experience with post molding operations including but not limited to CNC machining, plastic coatings, ultra sonic welding, silk screening and heat staking Experience working with all types of hot runner systems as well as the associated troubleshooting of these systems On the ground factory experience working with overseas vendors Knowledge in metal part fabrication methods (die-casting, stamping, forging) Organizational skills and related software experience (Excel, Powerpoint, etc) to allow for project tracking and presentations as needed",
    "preferred_qualifications": "Master's degree in Plastics Engineering Capacity to demonstrate achievements and implementation of innovative technology in mass production of consumer products Six Sigma Green or Black Belt certification Experience in the development of electronics consumer products Experience in managing multiple development programs with domestic and overseas vendors",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "2895331307344187": {
    "title": "AI Specialist, Identity and Access Management (IAM)",
    "URL": "https://www.metacareers.com/jobs/2895331307344187",
    "location": "New York, NY • Remote, US • Full Time",
    "responsibilities": "Help advance the science and technology of intelligent machines Work on research projects, strategies, and problems of moderate to high complexity and scope. Can identify and define both short and medium term objectives Influence progress of relevant research communities by producing publications Establish connections with cross-functional partners and contribute research with the goal of applying to Meta's product development Lead and collaborate on research projects within a team Design policies, processes, procedures, methods, tests, and/or components, from the ground up for end-to-end systems Apply in-depth knowledge of how the machine learning system interacts with the other systems around it",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Experience leading a team in solving modeling problems using AI/ML approaches Experience in applying research to production problems Experience communicating research for public audiences of peers 12+ Years Experience in developing and debugging in Python, C/C++, or C# Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "4+ years of experience as technical lead for a project of 4 or more individuals Experience with interdisciplinary and/or cross-functional collaboration Experience bringing machine learning-based products from research to production Highly experience in analytical and problem-solving skills, including a basic understanding of data analysis techniques Good grasp of SOX, SOC2, NIST, PCI, ISO, and other security regulations Experience in the IAM (Identity and Access Management) domain in a cloud based infrastructure environment Program and project management skills",
    "compensation": "$213,000/year to $293,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "25400996512819160": {
    "title": "Creative Director",
    "URL": "https://www.metacareers.com/jobs/25400996512819160",
    "location": "Los Angeles, CA • Menlo Park, CA • New York, NY • San Francisco, CA • Full Time + 3 more • Full Time - Hide",
    "responsibilities": "Develops and leads creative concepts for ongoing marketing campaigns, ensuring alignment with business objectives and brand strategy Leverages historical campaign performance and trends to inform future creative decisions Works with AI and GenAI tools for creative ideation and production Provides constructive guidance to external agencies and cross-functional teams to ensure high-quality creative output across on- and off-platform deliverables such as digital ads, websites, sales enablement materials Leads regular creative reviews and presentations to internal stakeholders, including leadership Sets the creative inputs across creative testing plans to optimize creative Fosters trusting relationships with cross-functional teams and partners to ensure seamless collaboration and effective communication Designs and develops visual concepts, including typography, color palette, and imagery, to support campaign messaging and branding Creates design assets, such as graphics, icons, and illustrations, to enhance campaign visuals Stays up-to-date with industry trends, emerging technologies, and best practices in advertising and marketing and implements relevant insights on the work",
    "minimum_qualifications": "5+ years of work experience as a creative in advertising, marketing, editorial or lead in a creative-related occupation Experience with AI and generative AI tools used for creative ideation and production Portfolio that showcases ideate, develop, and refine concept-driven campaigns that drive results, a mastery of art direction, and design principles Proven track record of advanced presentation skills and experience in communicating effectively with a broad range of stakeholders, collaborators, at different levels Understanding of the business-to-business marketing landscape and Meta’s advertising tools Demonstrated experience collaborating effectively with external agencies and cross-functional teams Experience problem-solving and thinking strategically for advertising campaigns Experience managing time-sensitive projects through to completion while balancing evolving priorities and a broad range of stakeholders Software Proficiencies: Figma, GenAI tools, Adobe Creative Suite including Firefly",
    "preferred_qualifications": "8+ years of work experience as a creative in advertising, marketing, editorial or lead in a creative-related occupation After Effects, Premiere, Media Encoder Bachelor's degree in Advertising Art Direction, Digital Design, Visual Design, or equivalent experience",
    "compensation": "$121,000/year to $173,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}