{
  "1290641465449270": {
    "title": "Research Scientist Intern, Spatial Audio Capture and Reproduction (PhD)",
    "URL": "https://www.metacareers.com/jobs/1290641465449270",
    "location": "Redmond, WA • Internship",
    "responsibilities": "Design and implementation of novel algorithms to solve audio research problems Experimental design, implementation, and execution to evaluate new audio technologies Collaboration with and support of other researchers across audio and acoustic engineering disciplines Communication of research agenda, progress, and results",
    "minimum_qualifications": "1+ years experience working with spatial audio capture algorithms Expertise in one or more of the below research areas: Audio signal processing, Binaural audio technology, Microphone array processing, Machine learning for spatial audio applications, Beamforming, Spatial audio evaluation, Spatial audio coding Coding experience in one or more languages, including but not limited to: C/C++, C#, Python, Max/MSP, or MATLAB Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment Is in the process of obtaining a PhD degree in the field of Acoustics, Computer Science, Mechanical Engineering, Electrical Engineering or related STEM fields",
    "preferred_qualifications": "Experience with real-time multichannel audio processing and coding Experience with machine learning software platforms such as PyTorch, TensorFlow, etc Experience with Unity, Unreal, CryEngine, or similar game engines Proven track record of achieving results as demonstrated in accepted papers in top conferences or journals such as ICASSP, WASPAA, InterSpeech, JASA, JAES, etc Experience working and communicating cross functionally in a team environment Intent to return to a degree-program after the completion of the internship/co-op",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}