{
  "663623643473220": {
    "title": "Research Scientist Intern, Character Animation and Evaluation (PhD)",
    "URL": "https://www.metacareers.com/jobs/663623643473220",
    "location": "Sausalito, CA • Internship",
    "responsibilities": "Prototyping, building and analysis of experimental systems Design and execution of algorithms and/or conduct and analysis of experiments Collaboration with and support of other researchers across various disciplines Communication of research agenda, progress and results",
    "minimum_qualifications": "Currently has, or is in the process of obtaining, a PhD in Computer Graphics, Character Animation, Robotics, Machine Learning, Human-Computer Interaction, Human-Robot Interaction, or related fields Experience with technical character animation (joint hierarchies, motion models, etc.) 2+ years of experience with C#, C++, and/or Python Interpersonal skills: cross-group and cross-culture collaboration Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Intent to return to degree-program after the completion of the internship 2+ years experience with character animation, physical simulation, perceptual evaluation and/or avatar evaluation Experiences in at least one of the following areas: human motion synthesis, editing, and retargeting, reinforcement learning, physics simulator developing in game engines and/or 3D software such as Unity, Unreal, Maya, Blender, conducting perception studies or user studies, or building VR applications Proven track record of achieving results as demonstrated in accepted papers at top animation, graphics, interaction and perception related journals and conferences such as SIGGRAPH, SCA, SAP, CHI, IEEE VR, ICRA, IROS, Eurographics, MIG, IVA, ICMI or related conference",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "679961588479426": {
    "title": "Research Scientist Intern, Language and Agents",
    "URL": "https://www.metacareers.com/jobs/679961588479426",
    "location": "Bellevue, WA • Menlo Park, CA • Seattle, WA • New York, NY • Internship + 3 more • Internship - Hide",
    "responsibilities": "Develop novel state-of-the-art generative AI algorithms and corresponding systems, leveraging various deep learning techniques. Based on the project, help analyze and improve efficiency, scalability, and stability of corresponding deployed algorithms. Perform research to advance the science and technology of intelligent machines. Perform research that enables learning the semantics of and training generative models of data (images, video, 3D, text, audio, and other modalities). Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results. Disseminate research results. When applicable, contribute to research that can be applied to Meta product development.",
    "minimum_qualifications": "Currently has or is in the process of obtaining a Ph.D. degree in Computer Science, Artificial Intelligence, Generative AI, or relevant technical field Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment Experience with Python, C++, C, Java or other related languages Experience building systems based on machine learning and/or deep learning methods",
    "preferred_qualifications": "Intent to return to the degree program after the completion of the internship/co-op Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as NeurIPS, ICML, ICLR, CVPR, ICCV, ECCV, ACL or similar Experience working and communicating cross functionally in a team environment Experience in advancing AI techniques, including core contributions to open source libraries and frameworks in computer vision Experience solving analytical problems using quantitative approaches Experience setting up ML experiments and analyzing their results Experience manipulating and analyzing complex, large scale, high-dimensionality data from varying sources Experience in utilizing theoretical and empirical research to solve problems Experience with deep learning frameworks",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "700527513053260": {
    "title": "Codec Avatar Research Engineer",
    "URL": "https://www.metacareers.com/jobs/700527513053260",
    "location": "Pittsburgh, PA • Burlingame, CA • Full Time",
    "responsibilities": "Develop a large-scale machine learning model to build a universal prior for human motion and behavior Define data requirements and collaborate with the Research SuperCluster team to efficiently load data Explore and implement various state-of-the-art models and methods, including transformers, diffusion models, and multimodal LLMs Collaborate to support the real-time animation of the avatars Define, design, and implement automatic pipeline to leverage large amounts of 2D video data to enhance 3D motion generation",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience Masters or higher degree in Computer Science or a related technical field, or equivalent experience Experience with multi-node machine learning training workflows and frameworks Experience in developing or applying computer graphics algorithms Experience in developing or applying computer vision algorithms Adept communication skills, including experience in driving decision-making processes Experience working with cross-functional teams including, research, software, legal, privacy, and security Proficiency in Python Experience in Linux/shell scripting development",
    "preferred_qualifications": "PhD degree in Computer Science or a related technical field, or equivalent experience 5+ years experience in machine learning and modeling of 3D humans Publish papers on CVPR, ECCV, ICCV, T-PAMI, SIGGRAPH, SIGGRAPH Asia, etc. as the first author Understanding of neural network training, experience with large-scale models, diffusion models, hypernetworks, etc Proficiency in C++",
    "compensation": "$85.10/hour to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "833442005836796": {
    "title": "Research Scientist Intern, Computer Use Agents (PhD)",
    "URL": "https://www.metacareers.com/jobs/833442005836796",
    "location": "Menlo Park, CA • Seattle, WA • Internship",
    "responsibilities": "Perform research to advance the science and technology of intelligent machines Develop new methods and systems for AI agents, reinforcement learning, planning, model based reward modeling and related problems Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results",
    "minimum_qualifications": "Currently is in the process of obtaining a PhD degree in Computer Science, Artificial Intelligence, Machine Learning, Statistics, or relevant technical field Expertise in areas relevant to the internship topics such as agent modeling, reinforcement learning, code generation, computational world modeling, language modeling, planning, agentic scaffolds, memory systems or others, as demonstrated by publications, coursework, blog posts, prior internships, and other relevant contributions Experience with Python and deep learning frameworks such as Pytorch or Tensorflow, as demonstrated by course projects, open source releases, or similar venues Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Intent to return to a degree program after the completion of the internship Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as NeurIPS, CVPR, ICCV, ECCV, ICLR, ICML, ACL, NAACL, EMNLP, or similar Experience with interpreting deep neural networks mechanistically, correlating their observable behavior with properties of model parameters and activations Demonstrated software engineering experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub) Experience working and communicating cross functionally in a team environment",
    "compensation": "$7,650/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1942411453274796": {
    "title": "Creative Strategist",
    "URL": "https://www.metacareers.com/jobs/1942411453274796",
    "location": "Austin, TX • New York, NY • Full Time",
    "responsibilities": "Continually inspire our clients and industries with the right approach that translates into business outcomes Work with a wide-range of cross-functional teams to refine and scale your approaches for maximum impact across Meta’s Platforms Continually work to invent new ways to harness creativity for business growth whilst driving value for people and communities Work hands-on to bring ideas to life. This is a position for builders/creators who demonstrate the imagination to scale your team’s ideas across the globe Collaborate with cross-functional teams internally and externally to drive efficiency on the process and the impact it has on our clients' businesses Continually explore Meta products - be a maker yourself and know the tools well from a consumer standpoint to build the best brand experiences for broad audiences Be adept at handling a high-growth environment. This team is inventing every day and it takes tenacity, bravery and the experience to view the big opportunities to thrive here Operationalize creative data, metrics and insights approach that identifies the right creative challenges and blockers, tracks progress, and delivers long term sustainable progress",
    "minimum_qualifications": "5+ years of experience in creative for performance, gained from working at startups, creative agencies, in-house creative teams, tech companies or as a non-traditional content creator Conceptual thinking and problem solving - experience in visualizing ideas and influencing stakeholders to execute strategies to their full potential across platforms Data fluency – you are happy to get your hands dirty with data and measurement while also being willing to learn new tools and distill data into unique insights Knowledge of AI solutions and tools for marketing and advertising Latest work samples required",
    "preferred_qualifications": "Demonstrated experience as a tinkerer, willing to try your hand at prototyping to test ideas Demonstrated experience in how AI can enhance the creative process and unlock new levels of creativity A unique perspective on storytelling and how it manifests in the digital landscape",
    "compensation": "$96,000/year to $156,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}