{
  "680569014974157": {
    "title": "Production Network Engineer",
    "URL": "https://www.metacareers.com/jobs/680569014974157",
    "location": "Denver, CO • Redmond, WA • Austin, TX • Menlo Park, CA • Seattle, WA • Full Time + 4 more • Full Time - Hide",
    "responsibilities": "Partner with network hardware, software, and vendor teams on the design and development of network topologies and network platforms (switch and optics) Codify the network designs by partnering with the in-house Software Engineer, Tooling, Planning, Simulation, and Delivery teams Develop test automation frameworks integrated in Continuous Integration/Continuous Deployment pipeline to qualify network hardware and software stack for both in-house Facebook Open Switching System(FBOSS) and Vendor platforms before push in production Develop tests that qualify complex network migration procedures in lab/emulation before executing the same in production Work closely with our hardware, software and sourcing teams to develop new networking solutions and influence the future of networking and its associated infrastructure Be oncall to learn from real world production challenges and take the lessons to improve current and future generation products",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience 6+ years of experience working on networks supporting large scale training workloads Experience in designing, deploying and operating datacenter networks at scale Experience coding in languages like Python, C++, Go Experience in network automation software leveraging software defined networking principles Experience configuring and troubleshooting routing and switching protocols (BGP, IS-IS, OSPF, MPLS, RSVP-TE) Working knowledge of network protocols (TCP/UDP, DHCP, DNS) and experience with IPv4 and IPv6",
    "preferred_qualifications": "Understanding of AI training workloads and demands they exert on networks Understanding of RDMA congestion control mechanisms on RoCE Networks Working knowledge of 40/100/400G Ethernet and CWDM, DWDM and optical transport network technologies Understanding of different Optics and internals of a switch ASIC",
    "compensation": "$147,000/year to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "3190424134466790": {
    "title": "Fundamental AI Research Scientist, Language - FAIR",
    "URL": "https://www.metacareers.com/jobs/3190424134466790",
    "location": "Menlo Park, CA • New York, NY • Full Time",
    "responsibilities": "Develop algorithms based on state-of-the-art machine learning and neural network methodologies Perform research to advance the science and technology of intelligent machines Conduct research that enables learning the semantics of data across multiple modalities (audio, speech, images, video, text, and other modalities) Work towards long-term ambitious research goals, while identifying intermediate milestones Design and implement models and algorithms Work with large datasets, train / tune / scale the models, create benchmarks to evaluate the performance, open source and publish",
    "minimum_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience PhD degree in AI, computer science, data science, or related technical fields, or equivalent practical experience 2+ years of experience holding an industry, faculty, academic, or government researcher position Research publications reflecting experience in related research fields: audio (speech, sound, or music) generation, text-to-speech (TTS) synthesis, text-to-music generation, text-to-sound generation, speech recognition, speech / audio representation learning, vision perception, image / video generation, video-to-audio generation, audio-visual learning, audio language models, lip sync, lip movement generation / correction, lip reading, etc Familiarity with one or more deep learning frameworks (e.g. pytorch, tensorflow, …) Experienced in Python programming language Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment",
    "preferred_qualifications": "Publication record at peer-reviewed AI conferences (e.g. ACL, EMNLP, NeurIPS, ICLR, ICML or similar)",
    "compensation": "$147,000/year to $208,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}