{
  "650220267954569": {
    "title": "Lab Operations Program Manager",
    "URL": "https://www.metacareers.com/jobs/650220267954569",
    "location": "Redmond, WA • Burlingame, CA • Full Time",
    "responsibilities": "Plan and execute lab space bring-up, including requirements gathering, scheduling, and risk management Develop and manage budgets for lab operations and new space initiatives Implement and improve asset logistics tracking processes Coordinate cross-functional teams to ensure lab readiness and compliance Identify and mitigate operational risks to support rapid prototyping and testing",
    "minimum_qualifications": "Bachelor's degree or equivalent experience in Engineering, Science, or a related field 5+ years of technical project/program management experience Experience in lab operations, space planning, and risk mitigation Experience with organizational skills, budgeting, and communication Experience with asset management and logistics tracking",
    "preferred_qualifications": "Masters degree or equivalent experience in Engineering, Science, or a related field Experience working in a highly collaborative, cross-functional environment while communicating complex concepts clearly and succinctly Experience bridging research and engineering disciplines to create workable solutions Experience optimizing design of existing products or devices",
    "compensation": "$116,000/year to $166,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "701131469670503": {
    "title": "Director, Marketing Insights, WhatsApp",
    "URL": "https://www.metacareers.com/jobs/701131469670503",
    "location": "San Francisco, CA • Full Time",
    "responsibilities": "Harness comprehensive, best-in-class quant and qual research solutions to identify core audience truths and translate them into actionable insights and executions. Partner with marketing, comms and product organizations to understand user needs and product use cases, define product positioning, develop audience understanding, and shape marketing strategies. Help WhatsApp marketing programs achieve success against their business objectives while maximizing impact, efficiency and user value operate as a full-stack partner across planning, execution, and measurement/optimization to maximize the ROI of our investments. Communicate effectively and strategically with stakeholders at all levels of the business to inform decision-making and drive alignment. Hire and develop an effective team of marketing researchers.",
    "minimum_qualifications": "12+ years experience leading marketing or product research teams, deep executional knowledge of qualitative and quantitative methods and their applications in a business context Expertise leading insights-driven marketing campaigns/product launches from definition to execution, shaping strategy, driving alignment/decision-making, and delivering business outcomes Outstanding problem-solving and ability to quickly move from blank state to well-defined problem and a suitable approach Effective communication skills and a track record of creating alignment/clarity among disparate stakeholders and ambiguous contexts Ability to thrive in a dynamic and fast-paced environment, drive change, and collaborate effectively with a variety of partners Strong manager skills to create an empowered and effective team with opportunities for impact, growth and development",
    "preferred_qualifications": "5+ years experience in a consumer technology, with in-depth knowledge on how to build/implement effective and scalable marketing programs Strong working knowledge of digital and growth marketing with a focus on acquisition, engagement, and retention Clear examples of developing highly differentiated and durable brand positionings which inform product roadmaps and global marketing campaigns Innovation mindset with a focus on applying AI to marketing research project execution, reporting, and program recommendations",
    "compensation": "$233,000/year to $304,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "745855501804954": {
    "title": "Robotics Studio Hardware Systems Mechanical Engineer",
    "URL": "https://www.metacareers.com/jobs/745855501804954",
    "location": "Redmond, WA • Burlingame, CA • Full Time",
    "responsibilities": "Develop mechanical solutions for device prototypes and engineering test scenarios Design and implement test rigs and fixtures for reliability and performance validation Collaborate with engineering, manufacturing, and field teams to ensure hardware meets program needs Document and communicate technical findings and recommendations Support troubleshooting and continuous improvement of hardware systems",
    "minimum_qualifications": "Bachelor’s degree or equivalent experience in Mechanical Engineering or related field 5+ years of experience in hardware systems design, prototyping, and testing Experience with test rig development and reliability validation Experience with technical communication and documentation skills Experience collaborating with engineering, manufacturing, and field teams",
    "preferred_qualifications": "Masters degree or equivalent experience in Engineering, Science, or a related field Experience working in a highly collaborative, cross-functional environment while communicating complex concepts clearly and succinctly Experience optimizing design of existing products or devices",
    "compensation": "$139,000/year to $200,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "771855199007677": {
    "title": "ML Tooling & Dev, Software Engineering Manager",
    "URL": "https://www.metacareers.com/jobs/771855199007677",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Lead and manage a team of software engineers to deliver high-quality products and solutions Collaborate with cross-functional teams to drive technical innovation Develop and implement technical strategies to achieve business objectives Foster an environment of continuous learning, growth, and improvement",
    "minimum_qualifications": "8+ years of, or PhD + 4 years of software engineering work experience, including hands on technical management Demonstrated experience recruiting, building, structuring, and leading technical organizations, including performance management Bachelor of Science/Masters in Computer Science or equivalent practical experience Experience supporting, coaching, mentoring, and developing software engineers 2+ years of experience in managing a team of engineers with varied skill levels",
    "preferred_qualifications": "Experience leading teams in ML tooling and dev/prod infrastructure (profilers, debuggers, sanitizers, fuzzers, benchmarking, regression detection, testing, CI, SW/HW co-design) High engineering standards and demonstrated experience deploying robust, scalable, and reliable infrastructure systems in production Experience in hardware-software bring-up development environments (simulators, FPGA emulators) Experience with high-performance computation programming models (e.g., GPU CUDA, OpenCL, OpenMP, NCCL, RCCL) Knowledge of ML frameworks (PyTorch, TensorFlow, ONNX, MXNet) Experience with and basic understanding of hardware architectures (Intel SIMD, GPU, RISC-V, AI Accelerators) Proven experience launching and operating large-scale infrastructure services and projects Expertise in deployment, release management, and automation, ensuring smooth and reliable rollouts Experience implementing monitoring, alerting, and incident response for high availability and performance Experience integrating new and existing services with core infrastructure components (networking, storage, authentication, logging, monitoring) Communication skills for engaging with a broad developer community and XFN partners Experience and knowledge in ML model production (deployment, CI/CD, monitoring) and operationalizing ML models at scale",
    "compensation": "$177,000/year to $251,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "805901248891018": {
    "title": "Robotics Studio Systems Integration Engineer",
    "URL": "https://www.metacareers.com/jobs/805901248891018",
    "location": "Redmond, WA • Burlingame, CA • Full Time",
    "responsibilities": "Architect and integrate test stations and systems for device validation and reliability Define requirements and specifications for engineering test setups Lead communication and collaboration across engineering, manufacturing, and operations teams Develop documentation and best practices for system integration Mentor and guide engineers in integration practices",
    "minimum_qualifications": "Bachelor’s degree or equivalent experience in Engineering or a related field 7+ years of experience in systems integration, test station design, and technical leadership Experience leading cross-functional teams and driving complex projects Experience communicating, documenting, and mentoring across teams Experience in defining requirements and system-level problem solving",
    "preferred_qualifications": "Masters degree or equivalent experience in Engineering, Science, or a related field Experience working in a highly collaborative, cross-functional environment while communicating complex concepts clearly and succinctly Experience with dealing with ambiguity and developing solutions that unblock research Experience optimizing design of existing products or devices",
    "compensation": "$170,000/year to $240,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1882055162525005": {
    "title": "Executive Administrative Partner",
    "URL": "https://www.metacareers.com/jobs/1882055162525005",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Coordinate internal and external meetings Manage complex calendar set-up and movement Prepare expense reports and purchase requisitions Coordinate both domestic and international travel arrangements Organize space planning, strategic offsite events and team all-hands meetings Build cross-functional relationships between departments Partner closely with org lead admins Communicate key org and company updates to admins and xfn partners General office duties as needed",
    "minimum_qualifications": "4+ years of relevant experience providing administrative support to 1 or more executives 4+ years of relevant experience coordinating travel logistics on behalf of 1 or more executives 4+ years of relevant calendar management and expense report management experience for 1 or more executives Experience prioritizing multiple projects Experience with Microsoft Office and Google Suite",
    "preferred_qualifications": "",
    "compensation": "$40.38/hour to $55.48/hour + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}