{
  "670372999028092": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/670372999028092",
    "location": "Burlingame, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Duties include: Develop and execute software tests. Perform full stack web or mobile application development with a variety of coding languages. Test system modifications. Create consumer products and features using internal programming language Hack. Implement web or mobile interfaces using XHTML, CSS, and/or JavaScript. Work closely with Product Manager to define feature specifications and build products leveraging frameworks such as Reach and React Native. Work closely with operations and infrastructure to build and scale back-end services. Build report interfaces and data feeds. Conduct design and code reviews. May be assigned to specific group focused on product or infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Select methods and techniques for obtaining solutions. Complete medium to large features independently without guidance. Identify and drive changes as needed for assigned codebase, product area, or systems.",
    "minimum_qualifications": "Requires a Bachelor's degree (or foreign equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field Requires completion of coursework, research project, or internship involving the following: Coding in one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Relational databases and SQL Leveraging frameworks, including experience in at least one of the following: React or React Native Conducting design and code reviews",
    "preferred_qualifications": "",
    "compensation": "$186,349/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "791068003786389": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/791068003786389",
    "location": "New York, NY • Full Time",
    "responsibilities": "Build new features and improve existing products. Work on problems of moderate scope, push code, drive the development of the systems behind Facebook's products create web applications that reach billions of people, build high volume servers, and be a part of a team to connect people around the globe. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming and software engineering. Produce high quality code with good test coverage, using modern abstractions and frameworks. Receive general instructions on routine work and detailed instructions on new projects or assignments, work independently, use available resources to get unblocked, and complete tasks on-schedule by exercising strong judgement and problem solving skills. Master Facebook’s development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Actively seek and give feedback in alignment with Facebook’s Performance Philosophy.",
    "minimum_qualifications": "Bachelor’s degree (or foreign equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics or related field and 2 years of experience in the job offered or in a computer-related occupation Experience must include 2 years in the following Coding in an industry-standard language (e.g. Java, Python, C++, or JavaScript) C, C++, C#, or Java Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other *nix-like OS including file manipulation and simple commands Core web technologies: HTML, CSS, or JavaScript Building highly-scalable performant solutions Distributed systems including sharding, consistency, and availability Algorithms",
    "preferred_qualifications": "",
    "compensation": "$193,000/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "820278877089617": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/820278877089617",
    "location": "Bellevue, WA • Full Time",
    "responsibilities": "Design and develop cutting-edge Generative AI-powered tools for advertisers, leveraging advanced machine learning models, Large Language Models (LLMs), and econometric techniques to drive business growth and innovation. Collaborate with cross-functional teams to integrate Generative AI solutions into existing advertising platforms, ensuring seamless user experiences and optimal performance. Develop and maintain reliable, efficient, and scalable backend computing architectures and models to power Generative AI tools, utilizing expertise in system design, data analysis, and causal inference. Ensure the security, integrity, and compliance of all systems and data, adhering to Meta's high standards for data protection and privacy. Enhance ranking algorithms for fairness, personalization, and Small and Medium-sized Businesses (SMBs) empowerment, using econometric theory, machine learning methods, and data analysis to optimize algorithmic performance. Conduct research and experimentation to identify areas for improvement and develop innovative solutions to complex problems. Design and conduct experiments to analyze advertiser user behavior, identifying key business needs and decision-making patterns using causal inference, machine learning, and econometric techniques. Contribute to knowledge development by presenting findings and sharing insights with internal stakeholders and the broader academic community. Apply advanced data analysis and machine learning techniques to large datasets, extracting insights and developing predictive models that inform business decisions and drive growth. Utilize LLMs, natural language processing (NLP), and computer vision to analyze and generate content, optimizing advertising campaigns and improving user engagement. Design and develop recommendation systems that leverage Generative AI, machine learning, and collaborative filtering to provide personalized advertising experiences for users. Integrate GenAI-powered recommendation systems with existing advertising platforms, ensuring seamless user experiences and optimal performance. Continuously evaluate and refine recommendation systems to ensure they meet evolving user needs and preferences. Collaborate with cross-functional teams, including product management, design, and engineering, to ensure the successful development and deployment of Generative AI-powered tools and systems. Communicate complex technical concepts and research findings to non-technical stakeholders, providing clear and actionable insights that inform business decisions.",
    "minimum_qualifications": "Ph.D. (or foreign degree equivalent) in Information Technology Management, Computer Science, Economics, Statistics, or a related field, and 6 months of experience in the job offered or in a computer-related occupation Experience must include 6 months of experience in the following: Machine learning,econometrics, and statistical modeling Large language model development and implementation Causal inference techniques,including instrumental variables,regression discontinuity, and difference-in-differences Programming in Hack, Python, Java, C++, R, and Julia Machine learning frameworks, including Tensor Flow and PyTorch Generative AI technologies, including GANs, VAEs,and LLMs Data analysis and visualization using pandas, NumPy,and Matplotlib Cloud infrastructure environments, including AWS and Google Cloud Platform Software development principles, including design patterns, testing methodologies, and version control systems",
    "preferred_qualifications": "",
    "compensation": "$203,350/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "828192116348015": {
    "title": "Software Engineer",
    "URL": "https://www.metacareers.com/jobs/828192116348015",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Research, design, develop, build and test operating systems-level software, compilers, and network distribution software for large distributed components that run applications. Build new features and improve existing products. Work on problems of diverse scope and design core, backend software components. Handle large-scale data storage, synchronization and coordination of large server cluster, and provide a runtime environment for front end code. Receiving little instruction on day-to-day work, code using primarily CIC++, Java, PHP and Hack. Interface with other teams to incorporate their innovations and vice versa. Conduct design and code reviews. Analyze and improve efficiency, scalability, and stability of various system resources. Complete medium to large features (each with many tasks) independently without guidance. Identify and drive changes as needed for assigned codebase, product area and/or systems.",
    "minimum_qualifications": "Requires a Master's Degree (or foreign equivalent) in Digital Arts, Computer Science, Engineering, Mathematics, Analytics, or related field and 36 months of experience in the job offered or in a related occupation Experience must include 36 months involving the following: Coding in one of the following industry-standard languages: C, C++, Java, or C# Python, PHP, or Haskell Relational databases and SQL Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) Linux, UNIX, or other 'nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting Core web technologies: HTML, CSS, or JavaScript Build highly-scalable performant solutions Data processing, programming languages, databases, networking, operating systems and Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems",
    "preferred_qualifications": "",
    "compensation": "$214,032/year to $240,240/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1287018999842645": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1287018999842645",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. Research, design, and develop new algorithms and techniques to improve the efficiency and performance of Meta’s platforms. Design and implement large-scale distributed software systems to serve large numbers of complex requests simultaneously and without failure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Suggest, collect, and synthesize system requirements from stakeholders. Exercise judgment within defined procedures and practices to determine appropriate action. Identify and drive changes as needed for assigned codebase, product area and/or systems. Conduct design and code reviews. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS Algorithms, data structures, or systems software Data management, programming languages, databases, operating systems Distributed systems",
    "preferred_qualifications": "",
    "compensation": "$178,360/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1309484977391769": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1309484977391769",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors. Exercise judgment within defined procedures and practices to determine appropriate action. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and 1 year of experience in the job offered or a computer-related field Experience must include 1 year of experience in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Building large-scale infrastructure applications Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases SQL and Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS",
    "preferred_qualifications": "",
    "compensation": "$178,360/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  },
  "1488694159129948": {
    "title": "Software Engineer, Product",
    "URL": "https://www.metacareers.com/jobs/1488694159129948",
    "location": "Menlo Park, CA • Full Time",
    "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. Be able to conduct A/B tests to measure (1) metrics impacts of coded improvements versus the production, and (2) metrics difference between test variants. Demonstrate skillful use of SQL and data analysis tools to explain the cause of such metric moves. When newly developed product logic or user interface regresses product performance (measured by latency and timeout), be able to look into the product UI or infra, identify the root cause, and optimize product performance. May be assigned to specific group focused on product or infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions. Work independently, use available resources to get unblocked, and complete tasks on schedule by exercising strong judgment and problem solving skills. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity.",
    "minimum_qualifications": "Master's degree (or foreign equivalent) in Computer Engineering, Electrical Engineering, Computer Science, Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences or a related field Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C# Creating web applications using at least one of the following: Python, PHP, or Ruby Relational databases and SQL Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS Leveraging frameworks including experience in at least one of the following: React or React Native Conducting design and code reviews A/B testing and experiment result analysis Performance optimization of large systems",
    "preferred_qualifications": "",
    "compensation": "$178,360/year to $200,200/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta."
  }
}